export default {
  extends: ["@commitlint/config-conventional"],
  rules: {
    "type-enum": [
      2,
      "always",
      [
        "feat", // добавление новой функциональности
        "fix", // исправление ошибки
        "docs", // изменения в документации
        "style", // правки стилей, влияющие на внешний вид (например, изменение цветов, отступов)
        "format", // правки форматирования кода, не влияющие на логику или внешний вид (автоматическое форматирование)
        "refactor", // рефакторинг кода без исправления ошибок или добавления новой функциональности
        "chore", // рутинные задачи, обновление зависимостей, настройка, сборка
        "content", // изменения в контенте статей
        "revert", // откат предыдущего коммита
        "merge", // слияние ветвей
      ],
    ],
    "scope-enum": [
      2,
      "always",
      [
        // --- для кода и интерфейса ---
        "app", // общие изменения в приложении (хуки, общая логика, маршрутизация)
        "components", // изменения в react-компонентах (ui-элементы, переиспользуемые части)
        "styles", // изменения в scss-стилях (файлы стилей, переменные, миксины)
        "hooks", // изменения в пользовательских хуках
        "utils", // изменения во вспомогательных функциях и утилитах
        // --- для контента ---
        "sections", // общие изменения для всех разделов со статьями
        "aefaq", // статьи в faq по adobe after effects
        "prfaq", // статьи в faq по adobe premiere pro
        "psfaq", // статьи в faq по adobe photoshop
        "aeexpr", // статьи на странице по выражениям в adobe after effects
        "rules", // страница с правилами чатов
        "links", // главная страница со ссылками
        "docs", // для документации, не связанной с кодом
        // --- для проекта и файлов ---
        "config", // изменения в файлах конфигурации (vite, eslint, commitlint, tsconfig и т.д.)
        "deps", // обновление зависимостей (yarn.lock, package.json)
        "assets", // медиафайлы (изображения, видео, иконки в public/)
        "*", // любая другая область, если ни одна из перечисленных не подходит
      ],
    ],
    "header-max-length": [2, "always", 100],
    "body-leading-blank": [2, "always"],
    "footer-leading-blank": [2, "always"],
    "type-case": [2, "always", "lower-case"],
    "type-empty": [2, "never"],
    "subject-empty": [2, "never"],
  },
};
