import React from "react";

import {Divider} from "antd";

import Addition from "../../../components/content/Addition";
import {ContentFigure} from "../../../components/content/ContentFigure";
import DetailsSummary from "../../../components/content/DetailsSummary";

const PRExportProblems: React.FC = () => {
  return (
    <div className="faq-content">
      <DetailsSummary title="«Error compiling movie», а в конце лога — «Error code: -1609629695»">
        <p>
          Эта ошибка может появиться по самым разным причинам — универсального способа
          устранить её нет. Чаще всего она связана с применёнными эффектами, «кривыми»
          исходниками, сбоями в работе аппаратного ускорения, нехваткой оперативной памяти
          или места на жёстком диске. Обычно конкретика проблемы указывается в окне с
          ошибкой.
        </p>
        <Addition type="warning">
          Приведённые ниже способы{" "}
          <u>
            <b>не являются панацеей</b>
          </u>{" "}
          для решения ошибки и позволяют лишь исключить часть проблем при экспорте вашей
          секвенции.
        </Addition>
        <ul>
          <li>
            Если в логах пишется{" "}
            <mark className="select">«Accelerated Renderer Error»</mark> или{" "}
            <mark className="select">«Ошибка рендеринга с ускорением»</mark> — попробуйте
            отключить <mark>GPU-ускорение</mark> в настройках проекта на время. Для этого
            перейдите в{" "}
            <mark className="select">«File» → «Project Settings» → «General»</mark> и
            выберите в параметре <mark className="select">«Renderer»</mark> значение{" "}
            <mark className="select">«Mercury Playback Engine Software Only»</mark>.
            <Addition type="warning">
              Скорость экспорта при переключении рендеринга на процессор может измениться
              в лучшую или худшую сторону.
            </Addition>
          </li>
          <li>
            Попробуйте экспортировать вашу секвенцию в другой формат видео, например в{" "}
            <mark className="video">QUICKTIME</mark> с кодеком{" "}
            <mark className="video">Apple ProRes 422</mark> или использовать сторонние
            плагины <mark className="plugin">Voukoder</mark> или{" "}
            <mark className="plugin">AfterCodecs</mark> для экспорта. Если экспорт пройдёт
            успешно, полученный файл при необходимости можно позже переконвертировать в
            нужный вам формат.
          </li>
          <li>
            Попробуйте заменить и перекодировать все ваши исходники в монтажный кодек,
            например <mark className="video">Apple ProRes 422</mark>.
          </li>
          <li>
            Если у вас указывается тайм-код, где происходит ошибка, — перейдите на это
            место и проанализируйте свои действия. Скорее всего, там был применён эффект,
            который может ломать ваш экспорт. Попробуйте его отключить на время или
            заменить на другой, а затем повторить экспорт.
          </li>
          <li>
            Перед экспортом рекомендуется очистить кэш. Для этого перейдите в{" "}
            <mark className="select">«Edit» → «Preferences» → «Media Cache»</mark>,
            найдите раздел <mark className="select">«Media Cache Files»</mark> и нажмите
            кнопку <mark className="select">«Delete»</mark>. В этой же вкладке настроек
            можно настроить автоматическую очистку или изменить место хранения кэша.
          </li>
          <li>
            Убедитесь, что вы не используете кириллицу в путях к исходникам, а также в
            пути для вывода файла. Программы от <mark className="company">Adobe</mark> с
            давних пор не любят кириллицу в путях, и эта проблема тянется до последних
            версий.
          </li>
          <li>
            Если вы выводите через <mark className="app">Adobe Media Encoder</mark>, то
            откажитесь от него в пользу экспорта напрямую из{" "}
            <mark className="app">Adobe Premiere Pro</mark>.
          </li>
          <li>
            <p>
            Если предыдущие методы не помогли, попробуйте включить опцию{" "}
            <mark>Use Previews</mark> в настройках экспорта, чтобы использовать файлы
            пререндера.
            </p>
            <Addition type="info">
              <ul>
                <li>
                  Чтобы создать файлы пререндера, используйте{" "}
                  <mark className="select">«Sequence» → «Render In to Out»</mark>,
                  предварительно установив точки входа и выхода на таймлайне с помощью{" "}
                  <mark className="key">I</mark> и <mark className="key">O</mark>.
                </li>
                <li>
                  Рекомендуется установить кодек{" "}
                  <mark className="video">Apple ProRes 422</mark> для файлов пререндера в
                  настройках секвенции. По умолчанию там установлено{" "}
                  <mark className="video">Apple ProRes 422 LT</mark>, а нужен —{" "}
                  <mark className="video">Apple ProRes 422</mark>.
                </li>
                <li>
                  Экспортировать секвенцию с файлами пререндера нужно в том же кодеке, что
                  указан в настройках секвенции в разделе{" "}
                  <mark className="select">«Video Previews»</mark>. Если указали{" "}
                  <mark className="video">Apple ProRes 422</mark> — экспортируйте своё
                  видео именно в нём, иначе файлы пререндера не подтянутся автоматически.
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary title="«An unknown error (-1609629695) occurred during the Project Manager operation»">
        <p>
          Попробуйте выключить флажок напротив параметра{" "}
          <mark className="select">«Include Preview Files»</mark>, а затем повторить
          попытку сбора материалов в нужную папку.
        </p>
        <ContentFigure
          caption="Project Manager"
          imgTitle="Отключаем Include Preview Files в менеджере проекта"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/premierepro/disable_include_preview_files.png"
          theme="dark"
          type="image"
          variant="windows"
        />
      </DetailsSummary>
      <DetailsSummary title="Экспортировал секвенцию в H.264 и отправил пользователю iPhone, а он не может открыть видео. Почему это происходит и как это исправить?">
        <p>
          <mark className="app">Adobe Premiere Pro</mark> поднимает значение{" "}
          <mark className="select">«Level»</mark> для секвенций с большим разрешением,
          например <mark>3840 на 2160</mark>, а <mark>iPhone</mark> не может понять такие
          файлы. Для решения проблемы попробуйте в настройках экспорта опустить{" "}
          <mark className="select">«Level»</mark> до значения <mark>4.1</mark>,
          предварительно убрав флажки напротив <mark className="select">«Profile»</mark> и{" "}
          <mark className="select">«Level»</mark> для разблокировки настроек.
        </p>
        <ContentFigure
          caption="Export"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/premierepro/set_level_4-1.mp4"
          theme="dark"
          type="video"
          variant="windows"
        />
      </DetailsSummary>
      <DetailsSummary title="Что делать, если экспорт зависает на определённом моменте?">
        <p>
          При экспорте проблема зависания полосы прогресса может возникнуть по разным
          причинам.
        </p>
        <p>
          Иногда вам может помочь использование <mark>Pre-render</mark> файлов для
          финального экспорта.
        </p>
        {/* FIXME: написать!! */}
      </DetailsSummary>
      <DetailsSummary
        tag="не экспортируется, битый файл"
        title="Почему при экспорте в MP4 через встроенный кодек H.264 сохраняется файл с размером в 1 КБ?"
      >
        {/* FIXME: написать!! */}
      </DetailsSummary>
      <DetailsSummary
        tag="исходник с айфона, hlg, rec709"
        title="После экспорта у меня изменились цвета. Как избежать изменения цветов?"
      >
        {/* FIXME: написать!! */}
      </DetailsSummary>
      <DetailsSummary
        tag="медиаенкодер, медиаэнкодер, переместилось"
        title="Почему в предпросмотре Premiere Pro, Media Encoder и после экспорта видео смещается влево или вправо?"
      >
        <p>
          Проверьте текущую версию программ, установленных на вашем устройстве. Вполне
          вероятно, что вы используете версии в промежутке от <mark>23.1</mark> до{" "}
          <mark>23.5</mark>, где присутствует этот неприятный баг смещения текущего кадра.
          Он может возникнуть при использовании композиций из{" "}
          <mark className="app">Adobe After Effects</mark> через{" "}
          <mark className="plugin">Dynamic Link</mark> или при экспорте секвенции через{" "}
          <mark className="app">Adobe Media Encoder</mark>. Для решения этого бага просто
          обновите все программы от Adobe до <mark>23.6</mark> или свежее.
        </p>
      </DetailsSummary>
      <DetailsSummary
        tag="колор бендинг, полоски, цвет, шум, глубина цвета"
        title="Экспортировал композицию и вижу в результате ужасный ступенчатый градиент. Как мне от него избавиться?"
      >
        {/* FIXME: написать!! */}
      </DetailsSummary>
      <DetailsSummary title="Почему я не могу экспортировать видео в H.264 с нечётным разрешением?">
        <p>
          Вы не сможете экспортировать видео в <mark className="video">H.264</mark> или{" "}
          <mark className="video">H.265</mark> с нечётным разрешением из-за технических
          особенностей кодека. Данные кодеки используют макроблоки с чётными значениями,
          поэтому чисто технически у вас не получится указать разрешение, например{" "}
          <mark>575</mark>.
        </p>
        <ContentFigure
          caption="Ошибка в AfterCodecs при экспорте с нечётным разрешением"
          imgTitle="Ошибка экспорта с нечётным разрешением"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/odd_resolution_error.png"
          theme="light"
          type="image"
          variant="windows"
        />
        <p>
          Для решения проблемы просто укажите чётное значение пикселей у каждой стороны в
          свойствах композиции. Для этого откройте настройки композиции с помощью
          комбинации клавиш <mark className="key">Ctrl + K</mark> и укажите в параметрах
          ширины и высоты цифровое значение, которые делится на 2 без остатка. После
          изменения настроек композиции попробуйте начать экспорт заново.
        </p>
      </DetailsSummary>
      <DetailsSummary title="Почему после экспорта отсутствует звук в видео?">
        {/* FIXME: написать!! */}
      </DetailsSummary>
      <DetailsSummary
        tag="конвертация, шаттер енкодер, сжатие видео, квантование, cqr"
        title="Как сжать экспортированное видео без сильной потери качества или до определённого веса?"
      >
        <p>
          При экспорте какой-нибудь секвенции из{" "}
          <mark className="app">Adobe Premiere Pro</mark> можно наткнуться на неприятный
          сюрприз — файл может получиться слишком большим по весу. Такой файл может не
          подойти для загрузки видео на нужный сервис или просто занимать кучу места на
          диске. В таких случаях без сжатия и конвертации видео не обойтись.
        </p>
        <Divider>Конвертируем через Shutter Encoder</Divider>
        <p>
          Для быстрой конвертации видео нам понадобится{" "}
          <mark className="app">Shutter Encoder</mark> — бесплатный и популярный
          графический интерфейс утилиты <mark className="app">FFmpeg</mark>, который
          доступен для <mark>Windows</mark> и <mark>macOS</mark>. С помощью него можно
          конвертировать видео в распространённые форматы и при необходимости указывать
          нужные настройки кодирования.
        </p>
        <Addition type="info">
          Если у вас не установлен <mark className="app">Shutter Encoder</mark>, то его
          можно скачать <a href="https://www.shutterencoder.com/">по этой ссылке</a>. Не
          забудьте передвинуть ползунок доната на <mark>0</mark>, чтобы получить ссылку на
          скачивание.
        </Addition>
        <p>
          После установки и открытия <mark className="app">Shutter Encoder</mark> —
          начните импорт вашего получившегося файла. Затем укажите в{" "}
          <mark className="select">«Choose function»</mark> формат, в который вы хотите
          вывести видео. Между прочим, выбор кодека для конвертации тоже влияет на вес и
          качество картинки, но не все устройства и площадки могут поддерживать тот или
          иной кодек. В большинстве случаев нам подойдёт{" "}
          <mark className="video">H.264</mark> или <mark className="video">H.265</mark>.
        </p>
        <p>
          После выбора кодека, в правой части окна программы появятся различные настройки
          кодирования. Нас интересует лишь раздел{" "}
          <mark className="select">«Bitrate adjustment»</mark>. В этом разделе изменение
          параметров битрейта сильно влияет на качество видео и размер после конвертации.
          Там можно выбрать три варианта для кодирования.
        </p>
        <ContentFigure
          caption="Shutter Encoder"
          imgTitle="Интерфейс Shutter Encoder"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/shutter_encoder_interface.png"
          theme="dark"
          type="image"
          variant="mac"
        />
        <ul>
          <li>
            По умолчанию в <mark className="app">Shutter Encoder</mark> при выборе формата{" "}
            <mark className="video">H.264</mark> или аналогичный, установлен параметр
            кодирования с помощью <mark>VBR</mark> или же с помощью{" "}
            <mark className="word">переменного битрейта</mark>. Он плохо подходит для
            монтажа из-за непредсказуемого поведения, но хорошо подходит для передачи
            видео или публикации в социальные сети. В <mark>VBR</mark> также становится
            активным поле желательного размера видео, только зачастую кодировщик может
            немного уйти за края указанного значения.
            <Addition type="warning">
              Данный вариант кодирования подойдёт, если нужно максимально ужать видео до
              нужного размера по весу. Но есть загвоздка — из-за особенностей{" "}
              <mark className="word">переменного битрейта</mark> сложно предсказать размер
              файла, а также качество получаемой картинки.
            </Addition>
          </li>
          <li>
            Существует вариант кодирования через <mark>CBR</mark> или же с помощью{" "}
            <mark className="word">постоянного битрейта</mark>. Такой способ часто выходит
            самым большим по весу и не эффективен в плане сжатия видео, зато с таким
            способом получаемый вес становится более предсказуемым.
          </li>
          <li>
            Если вам нужно сохранить хорошее качество на протяжении всего видео, при этом
            отбросить часть веса, то есть способ кодирования через <mark>CQ</mark> или же{" "}
            <mark className="word">квантование</mark>. Такой способ позволяет забыть о
            выставлении битрейта перед конвертацией.
            <Addition type="warning">
              <mark>CQ-квантование</mark> поддерживается не всеми кодеками.
            </Addition>
            <Addition type="info">
              <ul>
                <li>
                  В отличие от <mark>VBR</mark>, где качество может сильно колебаться,
                  качество видео, закодированное с помощью <mark>CQ</mark>, останется
                  стабильным на протяжении всего видео, что делает его хорошим выбором для
                  тех, кто ценит предсказуемость в качестве.
                </li>
                <li>
                  По умолчанию <mark>CQ</mark> выставляется со значением <mark>23</mark>.
                  Значение <mark>CQ</mark> вычисляется по следующей формуле: чем меньше
                  значение, тем лучше качество, но больше вес. Эта формула работает и в
                  обратную сторону: чем больше значение, тем хуже качество, но меньше вес.
                  Обычно для получения хорошего качества выставляют значение в диапазоне
                  от <mark>17</mark> до <mark>25</mark>.
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <p>
          После выставления нужных значений укажите путь до файла, включите при
          необходимости конвертацию цветового пространства, а также аппаратное ускорение в
          нижней части интерфейса и нажмите на{" "}
          <mark className="select">«Start function»</mark>. После успешного завершения
          процедуры вы получите новый файл в той папке, в которой вы указали сохранение
          видео.
        </p>
        <Divider>Сжимаем через Adobe Media Encoder</Divider>
        <p>
          Изначально <mark className="app">Adobe Media Encoder</mark> был задуман как
          конвертер, и в нём ещё не было возможности экспорта секвенций из{" "}
          <mark className="app">Adobe Premiere Pro</mark>. Воспользуемся в кои-то веки
          данной программой по назначению. Чтобы начать конвертацию — импортируйте нужное
          видео в <mark className="app">Adobe Media Encoder</mark> любым способом — через{" "}
          <mark className="word">drag'n'drop</mark> в очередь экспорта, через{" "}
          <mark className="select">«File» → «Import»</mark>, через{" "}
          <mark className="key">Ctrl + I</mark> или с помощью двойного нажатия по пустой
          очереди экспорта. В открывшемся окне проводника укажите путь до файла, который
          нужно конвертировать.
        </p>
        <ContentFigure
          caption="Media Encoder"
          imgTitle="Импорт в Adobe Media Encoder"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/media_encoder_import.png"
          theme="light"
          type="image"
          variant="windows"
        />
        <p>
          После импорта файлов вы можете выбрать формат, шаблон и путь сохранения для
          конвертируемого видео. Слева от выбора формата или шаблона вы можете открыть
          список шаблонов, а нажав по названию формата или шаблона — вы можете открыть
          редактор шаблона для конвертации, где вы можете изменить различные параметры
          конвертации. Также вы можете указать путь до папки, в которую нужно сохранить и
          вариант рендера на процессоре или с аппаратным ускорением с помощью видеокарты.
        </p>
        <ContentFigure
          caption="Media Encoder"
          imgTitle="Экспорт в Adobe Media Encoder"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/media_encoder_exporting.png"
          theme="light"
          type="image"
          variant="windows"
        />
        <Addition type="info">
          В <mark className="app">Adobe Media Encoder</mark> можно конвертировать видео с
          помощью сторонних плагинов, по типу <mark className="plugin">Voukoder</mark> и{" "}
          <mark className="plugin">AfterCodecs</mark>, если вам не нравится результат от
          стандартных кодеков.
        </Addition>
        <p>
          После настройки параметров просто нажмите на кнопку начала конвертации и
          ожидайте результата в выходной папке.
        </p>
      </DetailsSummary>
    </div>
  );
};

export default PRExportProblems;
