import React from "react";

import {Divider} from "antd";

import Addition from "../../../components/content/Addition";
import {ArticleMedia} from "../../../components/content/ArticleMedia";
import CodeSnippet from "../../../components/content/CodeSnippet";
import ContentFilter from "../../../components/content/ContentFilter";
import DetailsSummary from "../../../components/content/DetailsSummary";
import JsonToTgsConverter from "../../../components/features/converters/ConverterJsonToTgs";

const AeExport: React.FC = () => {
  return (
    <div className="article-content">
      <DetailsSummary
        anchor="render-queue"
        tag="render queue, очередь рендера, настройки экспорта, render settings, output module, export settings"
        title="Что такое очередь рендеринга?"
      >
        <p>
          <mark className="select">«Render Queue»</mark> — это основное окно для экспорта
          композиций из <mark className="app">Adobe After Effects</mark> в форматах видео,
          аудио или изображений. Это очередь композиций, которые будут экспортироваться
          последовательно, сверху вниз.
        </p>
        <ArticleMedia
          caption="Render Queue"
          src="legacy/aftereffects/render_queue.png"
          type="image"
        />
        <p>
          В очередь можно добавить одну или несколько композиций. Текущую или выделенную
          композицию в окне <mark className="select">«Project»</mark> можно отправить на
          экспорт с помощью сочетания клавиш <mark className="key">Ctrl + M</mark> или
          через меню{" "}
          <mark className="select">«File» → «Export» → «Add to Render Queue»</mark>.
        </p>
        <p>
          Для каждой композиции в очереди можно задать параметры вывода. Есть три основных
          параметра: <mark className="select">«Render Settings»</mark>,{" "}
          <mark className="select">«Output Module»</mark> и{" "}
          <mark className="select">«Output To»</mark>. Для каждого из них доступны готовые
          и пользовательские пресеты. Чтобы выбрать шаблон, нажмите на стрелку слева от
          названия, а для изменения параметров — на само название.
        </p>
        <p>
          Экспорт выбранных композиций можно запустить кнопкой{" "}
          <mark className="select">«Render»</mark> в правом верхнем углу или клавишей{" "}
          <mark className="key">Enter</mark>.
        </p>
        <Divider>Разбираемся с «Output Module»</Divider>
        <p>
          <mark className="select">«Output Module»</mark> отвечает за изменение формата
          вывода и при необходимости — за настройку его параметров через{" "}
          <mark className="select">«Format Options»</mark>.
        </p>
        <p>
          В последних версиях <mark className="app">Adobe After Effects</mark> для
          экспорта доступны популярные форматы видео{" "}
          <mark className="video">H.264 (MP4)</mark>,{" "}
          <mark className="video">QuickTime</mark> и <mark className="video">AVI</mark>,
          аудиоформаты <mark className="audio">AIFF</mark>,{" "}
          <mark className="audio">MP3</mark> и <mark className="audio">WAV</mark>, а также
          возможность экспортировать композицию покадрово в форматах{" "}
          <mark className="image">TIFF</mark>, <mark className="image">JPEG</mark>,{" "}
          <mark className="image">PNG</mark>, <mark className="image">PSD</mark> и других.
          Чтобы выбрать формат, установите нужное значение в параметре{" "}
          <mark className="select">«Format»</mark>.
        </p>
        <p>
          В этом же окне можно изменить размер и кадрирование изображения. В разделе
          настроек аудио — задать частоту дискретизации, битовую глубину и выбрать режим:{" "}
          <mark className="select">«Mono»</mark> или{" "}
          <mark className="select">«Stereo»</mark>.
        </p>
        <Addition type="info">
          При включенной опции <mark className="select">«Audio Output Auto»</mark> звук
          может не попасть в итоговый файл из-за бага в{" "}
          <mark className="app">Adobe After Effects</mark>. Чтобы избежать этого,
          установите значение <mark className="select">«Audio Output On»</mark>.
        </Addition>
        <ArticleMedia
          caption="Output Module Settings"
          src="legacy/aftereffects/output_module_settings.png"
          type="image"
        />
        <Divider>Разбираемся с «Output To»</Divider>
        <p>
          <mark className="select">«Output To»</mark> задаёт путь для сохранения файла. В
          зависимости от выбранного формата к названию автоматически добавляется
          расширение. Для имён файлов можно использовать стандартный шаблон или создать
          собственный.
        </p>
        <ArticleMedia
          caption="Render Queue"
          src="legacy/aftereffects/filename_preset_render_queue.png"
          type="image"
        />
        <p>
          Если в списке шаблонов для <mark className="select">«Output To»</mark> выбрать{" "}
          <mark className="select">«Custom»</mark>, откроется окно{" "}
          <mark className="select">«File Name and Location Template»</mark>, где можно
          изменить шаблон названия, создать собственный или установить его по умолчанию.
        </p>
        <p>
          Для шаблонов имени поддерживаются относительные пути, что обеспечивает гибкость
          управления расположением экспортируемых файлов. Кнопка{" "}
          <mark className="select">«Add Property»</mark> позволяет добавить в структуру
          имени дополнительные параметры.
        </p>
        <ArticleMedia
          caption="File Name and Location Template"
          src="legacy/aftereffects/filename_and_location_template.png"
          type="image"
        />
        <Addition type="info">
          <ul>
            <li>
              Чтобы сохранить композицию на уровень выше папки с проектом, используйте
              конструкцию{" "}
              <mark className="code">[projectFolder]\..\[compName].[fileExtension]</mark>.
            </li>
            <li>
              Чтобы сохранить файл в подпапку внутри папки проекта, используйте
              конструкцию{" "}
              <mark className="code">
                [projectFolder]\renders\[compName].[fileExtension]
              </mark>
              , где вместо <mark className="path">renders</mark> можно указать любое
              другое название.
            </li>
          </ul>
        </Addition>
        <Divider>Разбираемся с «Render Settings»</Divider>
        <p>
          <mark className="select">«Render Settings»</mark> — необязательный, но полезный
          раздел настроек. В нём можно задать разрешение, включить или отключить
          определённые свойства слоёв и указать, использовать ли прокси в финальном
          экспорте.
        </p>
        <ArticleMedia
          caption="Render Settings"
          src="legacy/aftereffects/render_settings.png"
          type="image"
        />
        <Divider>Как управлять очередью рендеринга?</Divider>
        <ul>
          <li>
            Если вы отправили в очередь несколько композиций, но экспортировать нужно лишь
            некоторые из них, установите или снимите флажки напротив нужных элементов.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/select_comp_queue.png"
              type="image"
            />
          </li>
          <li>
            Чтобы убрать композицию из очереди, выделите её и нажмите{" "}
            <mark className="key">Delete</mark>.
          </li>
          <li>
            Чтобы экспортировать одну композицию в нескольких форматах, нажмите на кнопку
            «плюса» рядом с <mark className="select">«Output Module»</mark> и укажите
            нужные форматы. Этот подход экономит время при работе со сложными проектами,
            так как <mark className="app">Adobe After Effects</mark> рендерит композицию
            один раз, а затем упаковывает её в разные форматы.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/multiple_formats_render_queue.png"
              type="image"
            />
          </li>
          <li>
            Чтобы повторить экспорт уже отрендеренной или случайно отменённой композиции,
            нажмите <mark className="key">ПКМ</mark> на нужном элементе в очереди и
            выберите <mark className="select">«Duplicate»</mark>. Если вы хотите
            перезаписать исходный файл, выберите{" "}
            <mark className="select">«Duplicate with File Name»</mark>.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/duplicate_with_filename_render_queue.png"
              type="image"
            />
          </li>
        </ul>
        <Divider>
          Как создать свой шаблон для «Output Module» и сделать его шаблоном по умолчанию?
        </Divider>
        <p>
          Чтобы не настраивать параметры экспорта каждый раз заново, их можно сохранить в
          собственный шаблон. Для этого добавьте композицию в очередь с помощью{" "}
          <mark className="key">Ctrl + M</mark> и нажмите на значок стрелки рядом с{" "}
          <mark className="select">«Output Module»</mark>. В контекстном меню выберите{" "}
          <mark className="select">«Make Template»</mark> — откроется окно для создания и
          настройки шаблонов. Это же окно можно вызвать через{" "}
          <mark className="select">«Edit» → «Templates» → «Output Module»</mark>.
        </p>
        <ArticleMedia
          caption="Make Template"
          src="legacy/aftereffects/render_queue_make_template.png"
          type="image"
        />
        <p>
          В открывшемся окне появится пресет <mark>Untitled</mark>, который можно
          переименовать. В разделе <mark className="select">«Defaults»</mark> можно
          назначить созданный шаблон стандартным для определённых типов задач.
        </p>
        <p>
          Чтобы отредактировать шаблон, нажмите <mark className="select">«Edit»</mark>,
          после чего откроется окно{" "}
          <mark className="select">«Output Module Settings»</mark>. Окно редактирования
          шаблона экспорта, по сути, не отличается от обычной настройки типа вывода.
        </p>
        <ArticleMedia
          caption="Output Module Templates"
          src="legacy/aftereffects/output_module_templates.png"
          type="image"
        />
        <Divider>
          Как создать свой шаблон для «Render Settings» и сделать его шаблоном по
          умолчанию?
        </Divider>
        <p>
          Процесс создания пресета для <mark className="select">«Render Settings»</mark>{" "}
          аналогичен созданию шаблона для модуля вывода. Для этого нажмите на значок
          стрелки рядом с <mark className="select">«Render Settings»</mark> и выберите{" "}
          <mark className="select">«Make Template»</mark>. Это же окно можно вызвать через{" "}
          <mark className="select">«Edit» → «Templates» → «Render Settings»</mark>.
        </p>
        <ArticleMedia
          caption="Render Queue"
          src="legacy/aftereffects/make_template_render_settings.png"
          type="image"
        />
        <p>
          В открывшемся окне будет создан пресет с названием <mark>Untitled</mark>,
          которое можно заменить на любое другое. В разделе{" "}
          <mark className="select">«Defaults»</mark> можно задать его в качестве пресета
          по умолчанию для других типов файлов.
        </p>
        <p>
          Чтобы отредактировать шаблон, нажмите <mark className="select">«Edit»</mark>,
          после чего откроется окно <mark className="key">Render Settings</mark>. Окно
          редактирования шаблона ничем не отличается от обычной настройки рендеринга.
        </p>
        <ArticleMedia
          caption="Render Settings Templates"
          src="legacy/aftereffects/render_settings_templates.png"
          type="image"
        />
      </DetailsSummary>
      <DetailsSummary
        anchor="advanced-export-settings"
        tag="настройки экспорта, export settings, кодек, битрейт, cbr, vbr, cq, crf, voukoder, аудио, prores, h.264, качество видео, разрешение, контейнер, gop, цветовая субдискретизация, color space"
        title="Какие параметры экспорта могут влиять на качество и размер видеофайла?"
      >
        <Addition type="tldr">
          <ul>
            <li>
              На качество изображения и размер итогового видеофайла влияют кодек, битрейт
              и метод кодирования: <mark className="select">«CQ»</mark>,{" "}
              <mark className="select">«VBR»</mark> или{" "}
              <mark className="select">«CBR»</mark>, а также «сложность» и динамика
              происходящего в композиции.
            </li>
            <li>
              Размер импортированных исходников никак не влияет на вес итогового файла
              после экспорта. Если вы импортировали <mark className="file">MP4</mark>{" "}
              объёмом <mark>200 МБ</mark>, то, экспортировав композицию с этим исходником
              из <mark className="app">Adobe After Effects</mark> без изменений и
              наложения эффектов, вы не получите файл идентичного размера.
            </li>
            <li>
              Данная статья содержит только «душную» теорию, поэтому, если вы ищете, как
              настроить экспорт, — прочитайте другие статьи, например{" "}
              <a href="#export-mp4">«Как экспортировать композицию в MP4?»</a> или{" "}
              <a href="#export-prores">«Как экспортировать композицию в Apple ProRes?»</a>{" "}
              для демонстрации настроек тех или иных параметров экспорта в{" "}
              <mark className="app">Adobe After Effects</mark>.
            </li>
          </ul>
        </Addition>
        <p>
          После того как вы <a href="#import-workflow">подготовили исходники</a> и
          завершили работу над проектом, наступает не менее важный этап — экспорт.
          Правильно подобранные настройки помогут получить качественное изображение,
          оптимальный размер файла и обеспечить совместимость с различными платформами.
        </p>
        <p>
          В этой статье мы разберём ключевые параметры экспорта, которые позволят вам
          контролировать финальный результат и донести вашу работу до зрителя в наилучшем
          виде.
        </p>
        <Divider>Как подобрать кодек для экспорта?</Divider>
        <p>
          <mark className="word">Кодеки</mark> условно делятся на две большие группы, и
          выбор между ними зависит от вашей задачи, что вы хотите позже сделать с вашим
          полученным видео.
        </p>
        <ul>
          <li>
            <p>
              Просмотровые (потоковые) кодеки, такие как{" "}
              <mark className="video">H.264</mark>,{" "}
              <mark className="video">HEVC (H.265)</mark>,{" "}
              <mark className="video">VP9</mark> и <mark className="video">AV1</mark>,
              предназначены для конечного зрителя. Они сильно сжимают видео для экономии
              места и быстрой передачи по сети, что делает их идеальными для публикации в
              интернете. При одинаковых настройках{" "}
              <mark className="video">HEVC (H.265)</mark> и{" "}
              <mark className="video">AV1</mark> создают файлы меньшего объёма, чем{" "}
              <mark className="video">H.264</mark> и <mark className="video">VP9</mark>.
            </p>
            <p>
              Однако для монтажа такие видео не всегда подходят, так как их сложное сжатие
              создаёт «тормоза» и артефакты на ровном месте из-за постоянной нагрузки при
              декодировании. Некоторые видеокарты, например <mark>NVIDIA RTX 5000</mark> и
              процессоры от <mark className="company">Intel</mark> со встроенным
              видеоядром, поддерживают аппаратное ускорение этого процесса для{" "}
              <mark className="video">H.264</mark>, но даже оно не всегда работает
              корректно, если вы работаете с подобными исходниками.
            </p>
            <ArticleMedia
              src="cfz3jwdo1v0"
              type="youtube"
            />
          </li>
          <li>
            <p>
              Монтажные кодеки, например <mark className="video">Apple ProRes 4444</mark>{" "}
              или <mark className="video">DNxHD</mark>, созданы для дальнейшего
              использования в монтажных программах.
            </p>
            <p>
              Они сохраняют максимум качества, почти не сжимая изображение, и меньше
              нагружают ресурсы вашего устройства при декодировании, что обеспечивает
              плавную работу в редакторах. Главный их недостаток — огромный размер файлов,
              для работы с которыми может потребоваться быстрый накопитель.
            </p>
          </li>
        </ul>
        <p>
          При экспорте часть параметров — например, разрешение и частота кадров — обычно
          наследуется из настроек композиции. Другие, такие как битрейт и цветовая
          субдискретизация, задаются вручную, если кодек это позволяет. Однако есть
          исключения: у некоторых форматов, в частности{" "}
          <mark className="video">Apple ProRes</mark>, битрейт не настраивается и зависит
          от разрешения и частоты кадров.
        </p>
        <Addition type="info">
          <p>
            Не стоит путать кодек с контейнером. Несмотря на то, что они оба относятся к
            видеофайлам, они предназначены для разных целей.
          </p>
          <ul>
            <li>
              <mark className="word">Кодек</mark> — это технология или алгоритм, который
              сжимает (кодирует) каждый поток для уменьшения размера файла, а затем
              распаковывает (декодирует) его для просмотра. При сжатии с потерями кодек
              отбрасывает часть визуальной информации, которую считает избыточной. Чем
              ниже битрейт, тем агрессивнее сжатие и заметнее артефакты: изображение
              начнёт рассыпаться на квадраты, детали — размываться, а плавные градиенты
              превратятся в грубые полосы.
            </li>
            <li>
              <p>
                <mark className="word">Контейнер</mark> — оболочка, внутри которого
                хранятся видео и аудио, субтитры и служебная информация, а также
                обеспечивает их синхронизацию при воспроизведении. Расширение файла,
                например <mark className="file">MP4</mark>,{" "}
                <mark className="file">MKV</mark>, <mark className="file">MOV</mark> как
                раз и указывает на тип контейнера.
              </p>
              <p>
                Поскольку <mark className="word">контейнер</mark> — это лишь «обёртка»,
                его иногда можно сменить без перекодирования и конвертации. Например, если
                видео с кодеком <mark className="video">H.264</mark> упаковано в{" "}
                <mark className="file">MOV</mark>, в большинстве случаев оно будет
                корректно работать, если просто изменить расширение файла на{" "}
                <mark className="file">MP4</mark>.
              </p>
            </li>
          </ul>
        </Addition>
        <Divider>Как настроить «качество» перед экспортом?</Divider>
        <p>
          Обычно за визуальное качество видео отвечает битрейт. Если битрейта не хватит
          для передачи движения происходящего в вашем видео — оно начнёт неизбежно
          «сыпаться».
        </p>
        <p>
          Однако, если файл уже был сильно сжат, допустим до <mark>1 Мбит/с</mark>,
          вернуть исходное качество, просто повысив битрейт при повторной конвертации, не
          получится. Видео не работает как архив, который можно сжать и распаковать без
          потерь. Если установить битрейт значительно выше, чем у пережатого оригинала, вы
          лишь увеличите размер файла, но не улучшите качество.
        </p>
        <Addition type="info">
          Если вам нужно улучшить качество исходника, воспользуйтесь{" "}
          <a href="#upscale-video-photo">программами для апскейла видео</a>.
        </Addition>
        <p>
          Для управления битрейтом, или скоростью передачи данных, при кодировании
          используются три основных метода: <mark className="select">«CBR»</mark>,{" "}
          <mark className="select">«VBR»</mark> и{" "}
          <mark className="select">«CQ» («CQP»/«CRF»)</mark>.
        </p>
        <ArticleMedia
          src="eN5a2kHHP7s"
          type="youtube"
        />
        <ul>
          <li>
            При постоянном битрейте <mark className="select">«CBR»</mark> скорость
            передачи данных остаётся неизменной на протяжении всего видео. Этот режим
            предсказуем и идеально подходит для прямых трансляций, например на{" "}
            <mark className="app">YouTube</mark> или <mark className="app">Twitch</mark>,
            но для хранения обычных видео он не идеален. Кодировщик в таком случае тратит
            одинаковое количество данных и на статичные, и на динамичные сцены, что порой
            делает размер файла неоправданно большим.
          </li>
          <li>
            <p>
              При переменном битрейте <mark className="select">«VBR»</mark> скорость
              динамически меняется в зависимости от сложности кадра — увеличивается в
              динамичных сценах и уменьшается в статичных. Это позволяет достичь
              приемлемого качества при меньшем размере файла и часто используется в
              сервисах по типу <mark className="app">Netflix</mark> или{" "}
              <mark className="app">КиноПоиск</mark>. Однако этот вариант не подходит для
              сцен с резкими перепадами динамики, когда требуется выделить поток данных,
              значительно превышающий заданный.
            </p>
            <p>
              У переменного битрейта есть два режима:{" "}
              <mark className="select">«1 pass»</mark> и{" "}
              <mark className="select">«2 pass»</mark>.
            </p>
            <ul>
              <li>
                В режиме <mark className="select">«1 pass»</mark> кодировщик обрабатывает
                видео за один проход, сжимая его «на лету». Это быстро, но менее
                эффективно.
              </li>
              <li>
                В режиме <mark className="select">«2 pass»</mark> на первом проходе
                кодировщик анализирует всё видео и создаёт «карту» сложных и простых сцен.
                На втором проходе он использует эту карту, чтобы грамотно распределить
                битрейт: больше данных отдаётся сложным сценам, меньше — простым. Этот
                способ медленнее, но гораздо эффективнее для достижения заданного размера
                файла.
              </li>
            </ul>
          </li>
          <li>
            <p>
              Метод постоянного качества<sup>1</sup> позволяет задать кодировщику целевой
              уровень качества со словами:{" "}
              <mark className="quote">
                «Я задал такой-то уровень качества, а битрейт подбирай сам»
              </mark>
              . Он сам решает, сколько данных выделить каждому кадру, чтобы картинка
              выглядела одинаково хорошо и в спокойных, и в динамичных сценах.
            </p>
            <p>
              Это идеальный вариант для сохранения максимального качества без ручного
              подбора битрейта: он не раздувает файл, как{" "}
              <mark className="select">«CBR»</mark>, и зачастую сжимает видео эффективнее
              и качественнее, чем <mark className="select">«VBR»</mark>.
            </p>
            <Addition type="info">
              <sup>1</sup> Параметр постоянного качества может называться по-разному в
              зависимости от кодека: <mark className="select">«CQP»</mark>,{" "}
              <mark className="select">«QP»</mark>, <mark className="select">«CRF»</mark>{" "}
              или <mark className="select">«CQ»</mark>.
            </Addition>
            <p>
              Этот уровень качества вы задаёте по абстрактной шкале от <mark>0</mark> до{" "}
              <mark>51</mark>, где <mark>0</mark> — сжатие без потерь, а <mark>51</mark> —
              максимально возможное сжатие с наихудшим качеством.
            </p>
            <ul>
              <li>
                Значение по умолчанию в большинстве случаев — <mark>23</mark>. Этого более
                чем достаточно для экспорта на <mark className="app">YouTube</mark>,{" "}
                <mark className="app">VK Видео</mark> и подобные площадки. Но учтите:
                видеохостинги всё равно пережмут ваш ролик по-своему, чтобы сэкономить
                место на своих серверах.
              </li>
              <li>
                Если нужно сохранить видео с максимальным качеством, установите значение
                от <mark>17</mark> до <mark>20</mark>. Размер файла, само собой, заметно
                вырастет. Выбирать значение ниже <mark>15</mark> смысла нет: серьёзного
                прироста качества вы не заметите, а вот размер файла раздуете значительно.
              </li>
            </ul>
            <Addition type="warning">
              <ul>
                <li>
                  Этот тип кодирования доступен только в{" "}
                  <mark className="video">H.264</mark>,{" "}
                  <mark className="video">H.265</mark>, <mark className="video">VP9</mark>
                  , <mark className="video">AV1</mark> и их производных.
                </li>
                <li>
                  При экспорте из <mark className="app">Adobe After Effects</mark> и{" "}
                  <mark className="app">Adobe Media Encoder</mark> стандартными средствами
                  этот вариант кодирования выбрать нельзя. Для этого нужно использовать
                  сторонний плагин-экспортёр{" "}
                  <mark className="plugin">Voukoder Classic</mark>
                  <sup>1</sup> или <mark className="plugin">Voukoder Pro</mark> или
                  сторонние конвертеры, использующие <mark className="app">FFmpeg</mark>,
                  например <mark className="app">Shutter Encoder</mark>.
                  <ul>
                    <li>
                      <sup>1</sup> <mark className="plugin">Voukoder Classic</mark>{" "}
                      доступен только для <mark>Windows</mark> и больше не доступен на
                      официальном сайте и в репозитории{" "}
                      <a href="https://github.com/Vouk/voukoder/releases/tag/13.4.1">
                        GitHub
                      </a>
                      . Архив с этой версией экспортёра и «коннекторами» вы можете найти в{" "}
                      <a href="https://t.me/+Qd9xu7A4TeIwNzY6">
                        «складе стройматериалов»
                      </a>{" "}
                      по хештегу <mark className="tag">#voukoder</mark>.
                    </li>
                  </ul>
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <Divider>
          Почему видео «рассыпается» даже с высоким битрейтом или что такое «GOP»?
        </Divider>
        <p>
          Если видео, экспортированное в <mark className="video">H.264</mark> или его
          производные с высоким битрейтом, «рассыпается» в динамичных сценах, причина,
          скорее всего, не в битрейте, а в структуре <mark className="word">GOP</mark> —
          группы кадров.
        </p>
        <p>
          Чтобы понять почему, нужно знать, что большинство кодеков, включая{" "}
          <mark className="video">H.264</mark>, для максимального сжатия используют
          межкадровую компрессию (<mark className="word">Inter-frame compression</mark>).
          В отличие от внутрикадрового сжатия (
          <mark className="word">Intra-frame compression</mark>,{" "}
          <mark className="word">All-Intra</mark> или{" "}
          <mark className="word">I-frame only</mark>), где каждый кадр — это полноценное
          изображение, при межкадровой компрессии кодек хранит не саму последовательность
          картинок, а набор инструкций о том, как один кадр должен превратиться в другой.
          То есть записываются только изменения между ними, и от того, как эти изменения
          сгруппированы в GOP, и зависит финальный результат.
        </p>
        <p>
          <mark className="word">GOP</mark> или{" "}
          <mark className="word">Group of Pictures</mark> — это последовательность,
          начинающаяся с одного <mark>I-кадра</mark> и включающая несколько{" "}
          <mark>P-кадров</mark> и <mark>B-кадров</mark> до следующего опорного. От длины
          этой группы напрямую зависит поведение видео при сжатии.
        </p>
        <ul>
          <li>
            <mark className="word">I-кадры</mark> — ключевые или опорные кадры. Это
            полноценные, самодостаточные изображения, подобные{" "}
            <mark className="image">JPEG</mark>. Они содержат всю визуальную информацию и
            служат основой для декодирования остальных кадров.
          </li>
          <li>
            <mark className="word">P-кадры</mark> — прогнозируемые. Они не хранят целое
            изображение, а только данные о различиях относительно предыдущего{" "}
            <mark>I-кадра</mark> или <mark>P-кадра</mark>: например, «сдвинуть этот блок
            пикселей вправо» или «немного осветлить область». Это позволяет значительно
            экономить место.
          </li>
          <li>
            <mark className="word">B-кадры</mark> — двунаправленные. Они анализируют и
            предыдущие, и последующие кадры, вычисляя, как между ними изменяется картинка.
            Такой подход обеспечивает ещё большее сжатие, но требует больше вычислений при
            кодировании и декодировании.
          </li>
        </ul>
        <ArticleMedia
          src="v1WgvdbCSs0"
          type="youtube"
        />
        <ul>
          <li>
            При <mark className="word">длинном GOP</mark>, например{" "}
            <mark>250 кадров</mark> между опорными, кодек получает больше пространства для
            предсказаний и экономии данных. Это даёт лучший результат при низком битрейте
            и уменьшает размер файла. Однако при резких движениях или смене сцены качество
            может резко упасть, так как кодеку не хватает свежих <mark>I-кадров</mark> для
            восстановления точной картинки.
          </li>
          <li>
            При <mark className="word">коротком GOP</mark>, например{" "}
            <mark>12–25 кадров</mark>, ключевые кадры появляются чаще. Это делает видео
            более устойчивым к артефактам и потере качества, но увеличивает размер файла.
            Именно поэтому монтажные кодеки вроде{" "}
            <mark className="video">Apple ProRes</mark> используют только{" "}
            <mark>I-кадры</mark> — такой режим называют{" "}
            <mark className="word">All-Intra</mark>. Он обеспечивает стабильность при
            редактировании и идеально подходит для постпродакшена.
          </li>
        </ul>
        <p>
          Для экспорта в веб чаще применяют <mark className="word">длинный GOP</mark>, так
          как это стандарт для стриминговых сервисов. Но если вы замечаете, что на резких
          сменах сцены картинка «сыпется» или цветопередача на однотонных участках
          искажается, попробуйте поэкспериментировать с длиной{" "}
          <mark className="select">«GOP»</mark> в настройках кодека. Это можно сделать,
          например, в <mark className="plugin">Voukoder</mark> или{" "}
          <mark className="app">Shutter Encoder</mark>.
        </p>
        <ArticleMedia
          src="nFGmb8Z2zLw"
          type="youtube"
        />
        <Divider>Как не потерять «цвета» при экспорте?</Divider>
        <p>
          Цвета на видео могут зависеть от настроек вашего проекта, в частности указанного
          рабочего цветового пространства и от выбора варианта экспорта.
        </p>
        <p>
          Если вам важна точность цветопередачи, например при экспорте композиции с жёстко
          заданным цветом фона — экспортируйте видео в кодеке с цветовой субдискретизацией{" "}
          <mark>4:4:4</mark>, например <mark className="video">Apple ProRes 4444</mark>.
          Этот вариант хорош для дальнейшего видеопроизводства, но при загрузке на
          видеохостинги ролик всё равно будет перекодирован с субдискретизацией{" "}
          <mark>4:2:0</mark>, и точность исходного цвета потеряется. Если ваш заказчик
          настаивает на конкретном оттенке, проще объяснить ему этот метод сжатия видео,
          чем пытаться что-то исправить.
        </p>
        <p>
          <mark className="word">Цветовая субдискретизация</mark> — это метод сжатия
          изображения, при котором информация о цвете для группы пикселей усредняется,
          чтобы сэкономить место. Он основан на том, что человеческий глаз гораздо
          чувствительнее к перепадам яркости, чем к перепадам цвета. Поскольку мы плохо
          различаем мелкие детали цвета, на этой информации можно сэкономить много места,
          и человеческий глаз этого почти не заметит. Визуально уловить разницу с
          оригинальным файлом почти невозможно, если не проверять цвет пипеткой в
          графическом редакторе.
        </p>
        <p>
          Работает это за счёт того, что видеосигнал разделяется на две составляющие,
          которые наш глаз воспринимает по-разному:{" "}
          <mark className="word">яркостную</mark> и{" "}
          <mark className="word">цветность</mark>. Такой подход используется, например, в
          цветовой модели <mark>YCbCr</mark>, широко применяемой в цифровом видео.
        </p>
        <ul>
          <li>
            <mark className="word">Яркость</mark> (Luma, Y) — это, по сути,
            детализированная чёрно-белая версия изображения. Она отвечает за контуры,
            текстуры и чёткость. Наш глаз особенно чувствителен к этой информации.
          </li>
          <li>
            <mark className="word">Цветность</mark> (Chroma, Cb/Cr) — это информация о
            цвете, которая «раскрашивает» чёрно-белую основу. Главный принцип
            субдискретизации: мы сохраняем всю или почти всю информацию о яркости, но
            выбрасываем часть информации о цвете.
          </li>
        </ul>
        <p>
          Основные форматы цветовой субдискретизации — <mark>4:2:0</mark>,{" "}
          <mark>4:2:2</mark> и <mark>4:4:4</mark>. Первая цифра в этой схеме отвечает за
          количество сэмплов яркости, вторая — за количество сэмплов цвета в первой строке
          пикселей, а третья — во второй. Иногда встречается и четвёртая цифра, которая
          указывает на наличие альфа-канала.
        </p>
        <ArticleMedia
          src="aF_RCHoc89U"
          type="youtube"
        />
        <ul>
          <li>
            В <mark>4:2:0</mark> изображение получается самым сжатым: на четыре пикселя у
            каждого сохраняется собственная яркость, но цветовая информация берётся общей
            для целого квадрата из двух по горизонтали и двух по вертикали. Кодек делает
            ставку на то, что в небольшом квадрате <mark>2×2</mark> пикселя цвет вряд ли
            сильно меняется, и наш глаз «согласится» с усреднённым вариантом, пока
            детализация по яркости остаётся высокой. Этот вариант используется практически
            везде: на <mark className="app">YouTube</mark>,{" "}
            <mark className="app">TikTok</mark> и других популярных видеоплощадках.
          </li>
          <li>
            В <mark>4:2:2</mark> компромисс мягче: яркость остаётся у каждого пикселя
            своя, а цвет делится попарно по горизонтали. То есть первый и второй пиксель
            получают одинаковый цвет, третий и четвертый — тоже. В этом случае кодек
            отбрасывает половину горизонтальной информации о цвете. Наш мозг смотрит на
            два соседних пикселя и как бы думает:{" "}
            <mark className="quote">„Они так близко, наверное, одного цвета“</mark>. И мы
            не замечаем подмены. Этот вариант часто используется в профессиональных
            камерах.
          </li>
          <li>
            В <mark>4:4:4</mark> или <mark>4:4:4:4</mark> и яркость, и цвет уникальны для
            каждого пикселя, вследствие чего цвета после экспорта не исказятся. Никакой
            экономии — никакой потери цветовой информации, однако размер такого файла вас
            вряд ли обрадует.
          </li>
        </ul>
        <Divider>Как избежать «дерганого» видео из-за частоты кадров?</Divider>
        <p>
          Если частота кадров исходного материала и проекта не совпадают, это может
          привести к нежелательным артефактам. Например, если вы импортировали видео с
          частотой <mark>25 FPS</mark>, а в настройках композиции указали{" "}
          <mark>30 FPS</mark>, некоторые кадры будут повторяться, что приведёт к
          прерывистому, «дёрганому» движению. Чтобы этого избежать, убедитесь, что частота
          кадров проекта соответствует частоте кадров исходников. Это можно проверить в
          окне <mark className="select">«Project»</mark> в столбце{" "}
          <mark className="select">«Frame Rate»</mark>.
        </p>
        <p>
          Если вы импортировали в проект видео с переменной частотой кадров, например
          снятое на <mark>iPhone</mark>, его стоит конвертировать в видео с постоянной
          частотой — <mark>30</mark> или <mark>60 FPS</mark> — с помощью конвертера вроде{" "}
          <mark className="app">Shutter Encoder</mark>. О том, как это сделать, вы можете
          прочитать в <a href="#import-pipeline">этой статье</a>. Такие видео проще
          редактировать и ротоскопировать.
        </p>
        <ArticleMedia
          import-workflow
          src="vzh-41y1gxQ"
          type="youtube"
        />
        <Divider>Настраиваем аудио</Divider>
        <p>
          При экспорте видео можно настроить звук, изменив его{" "}
          <mark className="word">битрейт</mark>, <mark className="word">битность</mark>,{" "}
          <mark className="word">кодек</mark> и{" "}
          <mark className="word">частоту дискретизации</mark>. Однако в повседневной
          работе к этим настройкам обращаются редко и обычно оставляют настройки экспорта
          по умолчанию. Разницу в качестве между исходным и экспортированным звуком на
          слух замечают не все, но упомянуть об этих параметрах стоит для расширения
          кругозора.
        </p>
        <ul>
          <li>
            С <mark className="word">битрейтом</mark> мы уже знакомы, но не с его
            типичными значениями для аудио. Как правило, для получения хорошего звука
            после экспорта и публикации на <mark className="app">YouTube</mark> и других
            площадках достаточно значения <mark>256 Кбит/с</mark>, а для остальных случаев
            — <mark>320 Кбит/с</mark> при условии, что изначально был импортирован
            качественный аудиофайл.
          </li>
          <li>
            <p>
              С аудиокодеками всё немного запутаннее: пользователи часто путают форматы
              сжатия звука с кодеками, применяемыми в беспроводных наушниках. Между собой
              они различаются и по способу сжатия, и по качеству итогового звучания.
            </p>
            <p>
              Например, при экспорте из <mark className="app">Adobe After Effects</mark>{" "}
              звук обычно кодируется в <mark className="audio">AAC</mark> с потерями при{" "}
              <a href="#export-mp4">любом из трёх видов</a> экспорта в{" "}
              <mark className="video">H.264</mark> или остаётся несжатым при экспорте в{" "}
              <mark className="video">Apple ProRes</mark>.
            </p>
            <ArticleMedia
              src="6IVmlBWMxVA"
              type="youtube"
            />
            <p>
              Если вам нужно экспортировать композицию с аудиодорожкой, закодированной в
              специфическом формате<sup>1</sup>, и упаковать её в определённый контейнер,
              воспользуйтесь плагинами <mark className="plugin">Voukoder Classic</mark>
              <sup>2</sup> или <mark className="plugin">Voukoder Pro</mark>.
            </p>
            <Addition type="warning">
              <ul>
                <li>
                  <sup>1</sup> Некоторые форматы, например{" "}
                  <mark className="audio">WAV</mark>, могут не воспроизводиться на ряде
                  устройств.
                </li>
                <li>
                  <sup>2</sup> <mark className="plugin">Voukoder Classic</mark> доступен
                  только для устройств на <mark>Windows</mark> и больше не доступен на
                  официальном сайте и в репозитории{" "}
                  <a href="https://github.com/Vouk/voukoder/releases/tag/13.4.1">
                    {" "}
                    GitHub{" "}
                  </a>{" "}
                  . Архив с этой версией экспортёра и «коннекторами» вы можете найти в{" "}
                  <a href="https://t.me/+Qd9xu7A4TeIwNzY6">«складе стройматериалов»</a> по
                  хештегу <mark className="tag">#voukoder</mark>.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            И самое интересное — <mark className="word">частота дискретизации</mark> и{" "}
            <mark className="word">битность</mark>.
            <ul>
              <li>
                <p>
                  <mark className="word">Частота дискретизации</mark> показывает, сколько
                  раз в секунду аналоговый звуковой сигнал «снимается» и превращается в
                  цифровые данные — примерно как количество кадров в секунду для видео.
                  Измеряется в герцах или килогерцах. Стандартным значением считается{" "}
                  <mark>48000 Гц</mark>, именно с ним по умолчанию работают{" "}
                  <mark className="app">Adobe After Effects</mark> и{" "}
                  <mark className="app">Adobe Premiere</mark>.
                </p>
                <Addition type="info">
                  Если в одном проекте используются аудиодорожки с разной частотой
                  дискретизации, например <mark>44100 Гц</mark> и <mark>48000 Гц</mark>,
                  могут возникнуть сложности с их синхронизацией.
                </Addition>
              </li>
              <li>
                <p>
                  <mark className="word">Битность</mark> — это количество битов информации
                  в одном образце звука. Она определяет его динамический диапазон и
                  точность передачи амплитуды (громкости). Чем выше битность, тем
                  детальнее и качественнее получается цифровое аудио.
                </p>
                <p>
                  Стандартные значения — <mark>16</mark> и <mark>24 бита</mark>. Для
                  финального экспорта на площадки вроде{" "}
                  <mark className="app">YouTube</mark> обычно достаточно{" "}
                  <mark>16 бит</mark>. Если же предстоит дальнейшая обработка звука, лучше
                  работать с 24-битным аудио: оно даёт больше простора для редактирования
                  и лучше сохраняет исходное качество.
                </p>
              </li>
            </ul>
            <ArticleMedia
              src="w6f6FeRRjPU"
              type="youtube"
            />
          </li>
        </ul>
        <Divider>Дополнительный материал для размышлений</Divider>
        <div className="flexible-links">
          <a href="https://blog.frame.io/2017/02/15/choose-the-right-codec/">
            Выбор кодека для проекта
          </a>
          <a href="https://aws.amazon.com/ru/blogs/rus/media-part-1-back-to-basics-gops-explained/">
            Что такое «GOP»?
          </a>
        </div>
        <ArticleMedia
          src="MprgQSTqL9E"
          type="youtube"
        />
        <ArticleMedia
          src="gqDuIcJ-alM"
          type="youtube"
        />
      </DetailsSummary>
      <DetailsSummary
        anchor="stop-use-ame"
        tag="dynamic link, проблемы при экспорте"
        title="Почему «из каждого утюга» советуют не использовать Adobe Media Encoder для экспорта?"
      >
        <p>
          Долгие годы <mark className="app">Adobe Media Encoder</mark> считался
          практически безальтернативным решением для экспорта из{" "}
          <mark className="app">Adobe After Effects</mark> в популярный кодек{" "}
          <mark className="video">H.264</mark>. Это было связано с тем, что в старых
          версиях <mark className="app">Adobe After Effects</mark> отсутствовала
          возможность напрямую экспортировать композиции в этом формате. В этой статье мы
          рассмотрим, с какими «сюрпризами» можно столкнуться при использовании{" "}
          <mark className="app">Adobe Media Encoder</mark>.
        </p>
        <p>
          Изначально <mark className="app">Adobe Media Encoder</mark> был разработан для
          конвертации исходников из одного формата в другой, а также для создания
          прокси-файлов, которые затем использовались в{" "}
          <mark className="app">Adobe Premiere</mark>.
        </p>
        <p>
          Однако со временем в <mark className="app">Adobe Media Encoder</mark> появилась
          функция экспорта композиций из <mark className="app">Adobe After Effects</mark>,
          и пошло-поехало. Некоторые пользователи по привычке или из-за незнания
          альтернатив продолжают полагаться только на{" "}
          <mark className="app">Adobe Media Encoder</mark>.
        </p>
        <p>
          С выходом версии <mark>23.0</mark> и новее необходимость в{" "}
          <mark className="app">Adobe Media Encoder</mark> для экспорта в{" "}
          <mark className="video">H.264</mark> заметно уменьшилась: в{" "}
          <mark className="app">Adobe After Effects</mark> вернули нативную функцию
          экспорта в этот кодек. Если вы используете старые версии программы, лучше
          воспользоваться плагинами, такими как{" "}
          <mark className="plugin">AfterCodecs</mark> или{" "}
          <mark className="plugin">Voukoder</mark>. <a href="#export-mp4">Подробнее...</a>
        </p>
        <Addition type="info">
          Если нужно поставить на рендеринг сразу несколько композиций из разных проектов,
          создайте один пустой проект в <mark className="app">Adobe After Effects</mark> и
          импортируйте в него нужные проекты. Затем вы сможете добавить все композиции в
          очередь и запустить экспорт.
        </Addition>
        <Divider>
          Какие проблемы могут быть при использовании Adobe Media Encoder?
        </Divider>
        <ul>
          <li>
            При экспорте сложных сцен <mark className="app">Adobe Media Encoder</mark>{" "}
            может остановить рендеринг без объяснения причин, и будет сложно понять
            причину. Сложные сцены лучше экспортировать напрямую из{" "}
            <mark className="app">Adobe After Effects</mark>, при необходимости используя{" "}
            <a href="#proxy-comp">прокси</a>. Это минимизирует время экспорта и риск
            ошибок.
            <Addition type="warning">
              При экспорте композиции в <mark className="app">Adobe Media Encoder</mark>{" "}
              запускается ещё один процесс <mark className="file">AFTERFX.EXE</mark>,
              который создаёт дополнительную нагрузку на компьютер и может занять всю
              оперативную память, что часто приводит к сбоям.
            </Addition>
          </li>
          <li>
            <mark className="app">Adobe Media Encoder</mark> может терять исходники: после
            экспорта вы рискуете обнаружить разноцветный плейсхолдер вместо нужного файла,
            особенно если рендеринг был долгим.
          </li>
          <li>
            <p>
              <mark className="app">Adobe Media Encoder</mark> может экспортировать
              композиции с артефактами, например со смещённым изображением<sup>1</sup> или
              искажёнными цветами.
            </p>
            <Addition type="info">
              <sup>1</sup> Баг со смещением изображения встречается в версиях от{" "}
              <mark>23.1</mark> до <mark>23.5</mark>. Чтобы его исправить, обновите{" "}
              <mark className="app">Adobe After Effects</mark> и{" "}
              <mark className="app">Adobe Media Encoder</mark> до версии <mark>23.6</mark>{" "}
              или новее.
            </Addition>
          </li>
          <li>
            При экспорте через <mark className="app">Adobe Media Encoder</mark> на
            сторонних эффектах могут появиться красные кресты, водяные знаки или другие
            признаки отсутствия лицензии. Даже если в{" "}
            <mark className="app">Adobe After Effects</mark> с активацией всё в порядке,
            не факт, что она корректно подхватится в{" "}
            <mark className="app">Adobe Media Encoder</mark>, поскольку лицензии многих
            сторонних эффектов привязаны именно к{" "}
            <mark className="app">Adobe After Effects</mark>.
          </li>
          <li>
            При экспорте в <mark className="app">Adobe Media Encoder</mark> вы вряд ли
            добьётесь стабильной работы функции{" "}
            <mark className="select">«Multi-Frame Rendering»</mark>, которая отлично
            работает при экспорте напрямую из{" "}
            <mark className="app">Adobe After Effects</mark>.
          </li>
          <li>
            Композиция, отправленная из <mark className="app">Adobe After Effects</mark> в{" "}
            <mark className="app">Adobe Media Encoder</mark>, может просто не появиться в
            очереди рендеринга. Такое бывает при внутреннем сбое{" "}
            <mark className="plugin">Dynamic Link</mark>, о котором программа не сообщает.
          </li>
          <li>
            Обычно процесс экспорта в <mark className="app">Adobe After Effects</mark>{" "}
            запускается почти мгновенно, в отличие от долгого запуска самого{" "}
            <mark className="app">Adobe Media Encoder</mark>. После его запуска нужно ещё
            подождать, пока он подгрузит композицию, запустит фоновый процесс{" "}
            <mark className="file">AFTERFX.EXE</mark> и только потом начнёт экспорт. Не
            всегда удобно ждать минуту, чтобы{" "}
            <mark className="app">Adobe Media Encoder</mark> «опомнился» для экспорта
            короткого видео.
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        anchor="quality-videoplatforms"
        tag="соцсети, youtube, tiktok, сжатие видео, fps, frame rate, warp stabilizer"
        title="Почему видеоплощадки так нещадно портят качество изображения?"
      >
        <p>
          Представьте, что <mark className="app">YouTube</mark>,{" "}
          <mark className="app">Instagram</mark>
          <sup>1</sup>, <mark className="app">TikTok</mark> и прочие — это огромные
          склады, куда пользователи ежедневно загружают миллионы часов материала. Главная
          причина агрессивного сжатия видео — экономия места на серверах. Если бы площадки
          хранили всё в исходном качестве, им потребовались бы невообразимые объёмы
          памяти. Это нереально дорого, особенно для площадок, предоставляющий бесплатный
          доступ к контенту своим пользователями.
        </p>
        <Addition type="danger">
          <sup>1</sup> <mark className="app">Instagram</mark> и <mark>Meta</mark> признаны
          экстремистскими организациями и запрещены на территории Российской Федерации.
        </Addition>
        <p>
          Вторая причина — скорость доставки контента. Мало кто захочет скачивать два
          гигабайта ради пятисекундного ролика, особенно если интернет медленный. Поэтому,
          чтобы видео воспроизводилось без задержек, его нужно сделать максимально
          «лёгким».
        </p>
        <p>
          Ваша цель — отдать площадке настолько качественный исходник, чтобы даже после её
          «мясорубки» он выглядел достойно. Если есть время, экспериментируйте: загружайте
          тестовые ролики с разными настройками экспорта в режиме приватного доступа на{" "}
          <mark className="app">YouTube</mark> или другую площадку и сравнивайте
          результат. Но, пожалуйста, не зацикливайтесь на мелких деталях. Обычный зритель,
          скорее всего, всё равно не заметит той разницы между загруженным видео и
          исходником, которая так бросается вам в глаза.
        </p>
        <p>
          Популярный техноблогер{" "}
          <a href="https://www.youtube.com/@mkbhd">Маркус Браунли</a> однажды провёл
          эксперимент: он тысячу раз загружал на <mark className="app">YouTube</mark> одно
          и то же видео, чтобы посмотреть, что с ним станет. Результат оказался
          предсказуемым: с каждой новой загрузкой площадка сжимала ролик заново, и
          качество падало. Это работает по тому же принципу, что и копирование старых
          VHS-кассет: каждая следующая копия всегда хуже предыдущей.
        </p>
        <ArticleMedia
          src="JR4KHfqw-oE"
          type="youtube"
        />
        <p>
          Однако итоговый результат зависит не только от{" "}
          <mark className="word">битрейта</mark>, но и от самого контента. Динамичные
          сцены со сложной графикой или множеством мелких частиц требуют очень высокого
          битрейта для сохранения деталей. При низком значении битрейта{" "}
          <mark className="word">кодек</mark> не справляется, так как его принцип работы —
          экономить на статичных участках кадра, чтобы направить все ресурсы на прорисовку
          движения. Если поток данных слишком большой для выделенного битрейта — качество
          видео неизбежно пострадает.
        </p>
        <ArticleMedia
          src="r6Rp-uo6HmI"
          type="youtube"
        />
        <p>
          Если вы ограничены битрейтом, например требованиями видеохостинга, можно
          попробовать «упростить» изображение, чтобы помочь кодеку сжать видео без
          значительной потери качества.
        </p>
        <ul>
          <li>
            Тряска камеры заставляет каждый пиксель в кадре постоянно меняться, что
            требует огромного битрейта. Попробуйте применить эффект стабилизации, например{" "}
            <mark className="plugin">Warp Stabilizer</mark>, чтобы сделать изображение
            статичнее и помочь кодеку сохранить детали, а не тратить ресурсы на обработку
            дрожания.
          </li>
          <li>
            Резкие и хаотичные движения плохо сжимаются при ограниченном битрейте. В
            результате такие сцены с большой вероятностью превратятся в «кашу» из
            артефактов и размытых блоков.
          </li>
          <li>
            Некоторые кодеки, например <mark className="video">H.264</mark> и его
            производные, экономят место, объединяя похожие оттенки в один блок, из-за чего
            теряются детали. Старайтесь избегать низкоконтрастных градиентов на важных
            объектах, чтобы сохранить их детализацию.
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-mp4"
        tag="h264, h265, hevc, avc1, voukoder, aftercodecs"
        title="Как экспортировать композицию в MP4?"
      >
        <p>
          Обычно под экспортом в <mark className="video">MP4</mark> из{" "}
          <mark className="app">Adobe After Effects</mark> подразумевают экспорт в{" "}
          <mark className="video">H.264</mark> — один из самых популярных кодеков, с
          которым ежедневно сталкиваются пользователи интернета, будь то в социальных
          сетях, на видеохостингах, сайтах или даже на телевидении. Первая версия этого
          стандарта была выпущена в 2003 году, и до сих пор он активно используется.
          Помимо <mark className="video">H.264</mark>, существуют более эффективные
          наследники, такие как <mark className="video">H.265 (HEVC)</mark> и{" "}
          <mark className="video">AV1</mark>, но они менее популярны из-за проблем с
          совместимостью на старых устройствах.
        </p>
        <p>
          В этой статье мы рассмотрим, как экспортировать композицию в{" "}
          <mark className="video">H.264</mark> и его производных напрямую из{" "}
          <mark className="app">Adobe After Effects</mark> без использования{" "}
          <mark className="app">Adobe Media Encoder</mark>. Это можно сделать несколькими
          способами: с помощью стандартного экспортёра{" "}
          <mark className="video">H.264</mark>, доступного в{" "}
          <mark className="app">Adobe After Effects</mark> с версии <mark>2023</mark> и
          новее, или сторонних плагинов — <mark className="plugin">Voukoder</mark> и{" "}
          <mark className="plugin">AfterCodecs</mark>. Какой способ выбрать — зависит от
          вас, цели экспорта и вашего проекта.
        </p>
        <Addition type="info">
          Перед чтением этой статьи рекомендуется <a href="#render-queue">ознакомиться</a>{" "}
          с интерфейсом окна <mark className="select">«Render Queue»</mark> и его
          функционалом, если вы впервые экспортируете композиции из{" "}
          <mark className="app">Adobe After Effects</mark>.
        </Addition>
        <Addition type="danger">
          <ul>
            <li>
              <p>
                Обратите внимание: с помощью кодеков <mark className="video">H.264</mark>{" "}
                и <mark className="video">H.265</mark>
                <sup>1</sup> не получится экспортировать видео с прозрачностью. Для
                экспорта композиции с прозрачным фоном лучше использовать формат{" "}
                <mark className="video">QuickTime (Apple ProRes 4444)</mark>.
              </p>
              <ul>
                <li>
                  <sup>1</sup> У кодека <mark className="video">H.265</mark> всё же есть
                  нюанс — чтобы получить видео с этим кодеком и альфа-каналом, нужно
                  сначала экспортировать композицию в{" "}
                  <mark className="video">Apple ProRes 4444</mark>, а затем конвертировать
                  её через <mark className="app">Shutter Encoder</mark> с включённой
                  опцией <mark className="select">«Enable alpha channel»</mark>. Однако
                  альфа-канал в <mark className="video">H.265</mark> на практике можно
                  увидеть только в браузере <mark className="app">Safari</mark> — в{" "}
                  <mark className="app">Adobe After Effects</mark> и других монтажных
                  программах он отображаться не будет.
                </li>
              </ul>
            </li>
            <li>
              Из-за особенностей стандарта <mark className="video">H.264</mark> и его
              производных, не получится экспортировать композицию с нечётным разрешением,
              например <mark>725×501</mark>. В таком случае{" "}
              <mark className="app">Adobe After Effects</mark> автоматически растянет
              видео до разрешения <mark>726×502</mark> или выдаст ошибку при экспорте.
            </li>
          </ul>
        </Addition>
        <Divider>Экспортируем с помощью стандартного H.264</Divider>
        <Addition type="info">
          Если вы используете <mark className="app">Adobe After Effects</mark> версии ниже{" "}
          <mark>23.0</mark>, пролистайте эту статью дальше для ознакомления с
          альтернативными способами экспорта.
        </Addition>
        <p>
          Начнём с самого простого способа экспорта видео в{" "}
          <mark className="video">MP4</mark> — через стандартный экспортёр{" "}
          <mark className="plugin">H.264</mark>. Его добавили в{" "}
          <mark className="app">Adobe After Effects</mark> начиная с версии{" "}
          <mark>23.0</mark>, и теперь он используется по умолчанию вместо старого пресета{" "}
          <mark className="select">«AVI (Animation)»</mark>, который был стандартом в
          более ранних версиях.
        </p>
        <p>
          Вслед за этим были добавлены новые пресеты{" "}
          <mark className="select">«H.264 (15 Мбит/c)»</mark>,{" "}
          <mark className="select">«H.264 (5 Мбит/c)»</mark> и{" "}
          <mark className="select">«H.264 (40 Мбит/c)»</mark> для быстрого применения
          настроек.
        </p>
        <Addition type="warning">
          <p>
            Учтите, что у встроенного в <mark className="app">Adobe After Effects</mark>{" "}
            экспортёра <mark className="plugin">H.264</mark> есть несколько проблем и
            ограничений. Если вы с ними столкнётесь, программа выдаст предупреждение.
          </p>
          <ul>
            <li>
              Он не умеет экспортировать видео с нестандартной частотой кадров, например{" "}
              <mark>20 FPS</mark>. Если проигнорировать предупреждение, ролик получится
              ускоренным и закончится раньше звуковой дорожки. При использовании{" "}
              <mark className="plugin">AfterCodecs</mark>,{" "}
              <mark className="plugin">Voukoder</mark> или других форматов такой проблемы
              нет.
            </li>
            <li>Он плохо дружит с неквадратными пикселями в настройках композиции.</li>
            <li>
              Из-за особенностей самого стандарта <mark className="video">H.264</mark> у
              вас не получится экспортировать композицию с нечётным разрешением, например{" "}
              <mark>725×501</mark>. В этом случае{" "}
              <mark className="app">Adobe After Effects</mark> автоматически растянет
              видео до <mark>726×502</mark>.
            </li>
            <li>
              Видео, экспортированные через стандартный{" "}
              <mark className="plugin">H.264</mark>, могут не открываться в стандартном{" "}
              <mark className="app">медиаплеере Windows</mark> и на некоторых устройствах,
              например <mark>iPhone</mark>. Обычно это решается повторной конвертацией
              видео через любой конвертер (например,{" "}
              <mark className="app">Shutter Encoder</mark>) или экспортом через
              альтернативные плагины.
            </li>
          </ul>
        </Addition>
        <ul>
          <li>
            <p>
              Чтобы отправить на экспорт текущую композицию или выделенную в окне{" "}
              <mark className="select">«Project»</mark>, нажмите{" "}
              <mark className="key">Ctrl + M</mark> или выберите в меню{" "}
              <mark className="select">«File» → «Export» → «Add to Render Queue»</mark>.
            </p>
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/render_queue_h264.png"
              type="image"
            />
            <p>
              Когда откроется окно <mark className="select">«Render Queue»</mark>,
              убедитесь, что у вас выбран стандартный пресет для экспорта в{" "}
              <mark className="video">H.264</mark>. Выбрать нужный шаблон можно с помощью
              значка стрелки справа от <mark className="select">«Output Module»</mark>.
            </p>
          </li>
          <li>
            Чтобы изменить битрейт или другие параметры, нажмите на название шаблона —
            откроется окно <mark className="select">«Output Module»</mark>. Параметры,
            связанные с изменением битрейта для <mark className="video">H.264</mark>,
            находятся в разделе <mark className="select">«Format Options»</mark>.
            <ArticleMedia
              caption="Output Module Settings"
              src="legacy/aftereffects/output_module_format_options.png"
              type="image"
            />
          </li>
          <li>
            В этом окне можно выбрать режим битрейта: переменный или постоянный. Для
            динамичных сцен с множеством частиц выберите{" "}
            <mark className="select">«CBR»</mark> и установите битрейт повыше. Режим{" "}
            <mark className="select">«VBR»</mark> сэкономит место, но может ухудшить
            качество.
            <Addition type="info">
              Если вы не хотите подбирать битрейт вручную, но нужно получить максимальное
              качество, ваш выбор — режим <mark className="select">«CQ»</mark> в плагине{" "}
              <mark className="plugin">Voukoder</mark>. В стандартном{" "}
              <mark className="plugin">H.264</mark> этот режим кодирования отсутствует.
            </Addition>
            <ArticleMedia
              caption="H.264 Options"
              src="legacy/aftereffects/h264_options.png"
              type="image"
            />
          </li>
          <li>
            После того как вы указали нужный битрейт или настроили другие параметры
            экспорта, нажимайте <mark className="select">«OK»</mark>, пока не закроются
            все окна настроек.
          </li>
          <li>
            В <mark className="select">«Output To»</mark> укажите путь и имя файла. Для
            запуска экспорта нажмите <mark className="select">«Render»</mark> или клавишу{" "}
            <mark className="key">Enter</mark>.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/start_render_button.png"
              type="image"
            />
          </li>
          <li>
            Когда экспорт композиции закончится, файл появится в указанной вами
            директории. С полученным видео делайте что хотите: передайте клиенту,
            опубликуйте в соцсетях или удалите.
          </li>
        </ul>
        <Divider>Экспортируем с помощью Voukoder</Divider>
        <ContentFilter
          windowsContent={
            <>
              <Addition type="info">
                <ul>
                  <li>
                    В этой статье демонстрируется{" "}
                    <mark className="plugin">Voukoder Classic</mark> версии{" "}
                    <mark>13.4.1</mark>, недоступный для устройств на <mark>macOS</mark>.
                  </li>
                  <li>
                    <mark className="plugin">Voukoder Classic</mark> в некоторых случаях
                    может исказить цвет. Если вам нужно сохранить точность цветопередачи,
                    используйте экспорт в <mark className="video">Apple ProRes</mark> и
                    конвертируйте видео с помощью стороннего ПО, например{" "}
                    <mark className="app">Shutter Encoder</mark> или используйте другие
                    удобные вам способы экспорта.
                  </li>
                </ul>
              </Addition>
              <p>
                Если результат экспорта через стандартный{" "}
                <mark className="video">H.264</mark> вас не устраивает, попробуйте плагин{" "}
                <mark className="plugin">Voukoder</mark>. Прежде чем им воспользоваться,
                нужно установить саму утилиту вместе с «коннекторами» с помощью
                установочных файлов.
              </p>
              <p>
                К сожалению, исходный репозиторий этой версии{" "}
                <mark className="plugin">Voukoder</mark> на{" "}
                <a href="https://github.com/Vouk/voukoder/releases/tag/13.4.1">GitHub</a>{" "}
                был удалён, так как её заменили платной{" "}
                <mark className="plugin">Voukoder Pro</mark>. Архив с этой версией
                экспортёра и «коннекторами» вы можете найти в{" "}
                <a href="https://t.me/+Qd9xu7A4TeIwNzY6">складе стройматериалов</a> по
                хештегу <mark className="tag">#voukoder</mark>. После корректной установки{" "}
                <mark className="plugin">Voukoder</mark> должен появиться в списке{" "}
                <mark className="select">«Format»</mark> в окне{" "}
                <mark className="select">«Output Module»</mark>.
              </p>
              <Addition type="warning">
                Для корректной установки <mark className="plugin">Voukoder</mark>{" "}
                убедитесь, что <mark className="app">Adobe After Effects</mark> был
                установлен в директорию по умолчанию.
              </Addition>
              <ul>
                <li>
                  <p>
                    Чтобы отправить на экспорт текущую композицию или выделенную в окне{" "}
                    <mark className="select">«Project»</mark>, нажмите{" "}
                    <mark className="key">Ctrl + M</mark> или выберите в меню{" "}
                    <mark className="select">
                      «File» → «Export» → «Add to Render Queue»
                    </mark>
                    .
                  </p>
                  <ArticleMedia
                    caption="Render Queue"
                    src="legacy/aftereffects/render_queue_h264.png"
                    type="image"
                  />
                  <p>
                    Чтобы выбрать <mark className="plugin">Voukoder</mark> в качестве
                    формата для экспорта, нажмите на название текущего пресета, чтобы
                    открыть окно <mark className="select">«Output Module»</mark>.
                  </p>
                </li>
                <li>
                  В открывшемся окне <mark className="select">«Output Module»</mark>{" "}
                  выберите в <mark className="select">«Format</mark> значение{" "}
                  <mark className="select">«Voukoder»</mark>. Чтобы открыть основное окно
                  дополнительных настроек <mark className="plugin">Voukoder</mark> для
                  выбора кодека и его параметров, нажмите на{" "}
                  <mark className="select">«Format Options»</mark>.
                  <ArticleMedia
                    caption="Output Module Settings"
                    src="legacy/aftereffects/selecting_voukoder.png"
                    type="image"
                  />
                </li>
                <li>
                  После открытия настроек <mark className="plugin">Voukoder</mark> нужно
                  выбрать кодек. По умолчанию выбрано значение{" "}
                  <mark className="select">«H.264»</mark>, а в скобках — технология
                  аппаратного ускорения кодирования<sup>1</sup>. При необходимости вы
                  можете выбрать более эффективный по сжатию кодек{" "}
                  <mark className="video">HEVC (H.265)</mark>, если нужно сохранить такое
                  же качество при меньшем размере файла по сравнению с{" "}
                  <mark className="video">H.264</mark>.
                  <ArticleMedia
                    caption="Voukoder 13.4.1"
                    src="legacy/aftereffects/select_codec_in_voukoder.png"
                    type="image"
                  />
                  <Addition type="info">
                    <ul>
                      <li>
                        <sup>1</sup> Варианты показаны на примере связки «процессор{" "}
                        <mark className="company">AMD</mark> + видеокарта{" "}
                        <mark className="company">NVIDIA</mark>». Выбор на вашем
                        устройстве может отличаться.
                        <ul>
                          <li>
                            <mark className="select">«x264»</mark> или{" "}
                            <mark className="select">«x265»</mark> — кодирование с
                            использованием только процессора. Стабильно, но не всегда
                            быстро.
                          </li>
                          <li>
                            <mark className="select">«NVIDIA NVENC»</mark> — кодирование с
                            использованием аппаратного ускорения видеокарты{" "}
                            <mark className="company">NVIDIA</mark>. Это может ускорить
                            рендеринг, но не гарантирует полное использование видеокарты,
                            особенно при использовании «тяжёлых» эффектов.
                          </li>
                          <li>
                            <mark className="select">«AMD AMF»</mark> — то же самое, но
                            для видеокарт и встроенной графики{" "}
                            <mark className="company">AMD</mark>.
                          </li>
                        </ul>
                      </li>
                      <li>
                        Кодеки <mark className="video">AV1</mark> и{" "}
                        <mark className="video">VP9</mark> редко используются для экспорта
                        из <mark className="app">Adobe After Effects</mark>. Если вам
                        нужен этот формат, проще экспортировать композицию в условном{" "}
                        <mark className="video">Apple ProRes 4444</mark>, а затем
                        переконвертировать видео через{" "}
                        <a href="https://www.shutterencoder.com/">Shutter Encoder</a> или
                        другие конвертеры.
                      </li>
                    </ul>
                  </Addition>
                </li>
                <li>
                  <p>
                    После выбора нужного кодека, например{" "}
                    <mark className="select">«H.264 (NVIDIA NVENC)»</mark>, перейдите во
                    вкладку <mark className="select">«Параметры»</mark>. Здесь можно
                    настроить качество видео с помощью метода постоянного качества
                    <sup>1</sup>, который нацелен на поддержание постоянного
                    воспринимаемого качества, не заботясь о размере файла.
                  </p>
                  <Addition type="info">
                    <sup>1</sup> Параметр постоянного качества может называться по-разному
                    в зависимости от выбранного кодека:{" "}
                    <mark className="select">«CQP»</mark>,{" "}
                    <mark className="select">«QP»</mark>,{" "}
                    <mark className="select">«CRF»</mark> или{" "}
                    <mark className="select">«CQ»</mark>.
                  </Addition>
                  <ArticleMedia
                    caption="Voukoder 13.4.1"
                    src="legacy/aftereffects/codec_parameter_voukoder.png"
                    type="image"
                  />
                  <p>
                    При использовании метода постоянного качества кодировщик сам решает,
                    какой битрейт выделить для каждого кадра, чтобы соответствовать
                    заданному уровню качества. Этот уровень устанавливается значением{" "}
                    <mark className="select">«CQP»</mark> от <mark>0</mark> до{" "}
                    <mark>51</mark>, где <mark>0</mark> — сжатие без потерь с огромным
                    размером файла, а <mark>51</mark> — наименьший размер и наихудшее
                    качество.
                  </p>
                  <ul>
                    <li>
                      По умолчанию для параметра постоянного качества установлено значение{" "}
                      <mark>23</mark>. Этого более чем достаточно для экспорта на{" "}
                      <mark className="app">YouTube</mark>,{" "}
                      <mark className="app">VK Видео</mark> и подобные платформы. Учтите,
                      что видеохостинги всё равно пережмут видео по-своему, чтобы
                      сэкономить место на своих серверах.
                    </li>
                    <li>
                      Если нужно сохранить почти максимальное качество, укажите для
                      параметра постоянного качества значение от <mark>17</mark> до{" "}
                      <mark>20</mark>. Размер файла заметно возрастёт. Ставить значение
                      меньше <mark>15</mark> нет смысла: серьёзного прироста качества вы
                      не заметите, а вот размер файла раздуете не на шутку.
                    </li>
                    <li>
                      Если хотите получить хорошее соотношение «качество/минимальный вес»,
                      укажите для параметра постоянного качества значение <mark>30</mark>.
                      Экстремальные значения, например <mark>50</mark>, использовать не
                      рекомендуется, так как в итоге вы можете получить «кашу» из
                      пикселей. Экспериментируйте со значениями с умом.
                    </li>
                  </ul>
                </li>
                <li>
                  Если больше ничего настраивать не нужно, нажимайте{" "}
                  <mark className="select">«OK»</mark>, пока не закроются все окна
                  настроек. Не забудьте указать в{" "}
                  <mark className="select">«Output To»</mark> путь и имя файла. Для
                  запуска экспорта нажмите <mark className="select">«Render»</mark> или
                  клавишу <mark className="key">Enter</mark>.
                  <ArticleMedia
                    caption="Render Queue"
                    src="legacy/aftereffects/start_render_button.png"
                    type="image"
                  />
                </li>
              </ul>
            </>
          }
        />
        <Divider>Экспортируем с помощью AfterCodecs</Divider>
        <p>
          Ещё одна хорошая альтернатива для экспорта <mark className="video">H.264</mark>{" "}
          из <mark className="app">Adobe After Effects</mark> — сторонний экспортёр{" "}
          <mark className="plugin">AfterCodecs</mark> от{" "}
          <mark className="company">Autokroma</mark>.
        </p>
        <ul>
          <li>
            <p>
              Чтобы отправить на экспорт текущую композицию или выделенную в окне{" "}
              <mark className="select">«Project»</mark>, нажмите{" "}
              <mark className="key">Ctrl + M</mark> или выберите в меню{" "}
              <mark className="select">«File» → «Export» → «Add to Render Queue»</mark>.
            </p>
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/render_queue_h264.png"
              type="image"
            />
            <p>
              Чтобы выбрать <mark className="plugin">AfterCodecs</mark> в качестве формата
              для экспорта, нажмите на название текущего пресета, чтобы открыть окно{" "}
              <mark className="select">«Output Module»</mark>.
            </p>
          </li>
          <li>
            В открывшемся окне <mark className="select">«Output Module»</mark> выберите в{" "}
            <mark className="select">«Format</mark> значение{" "}
            <mark className="select">«AfterCodecs MP4»</mark>. Чтобы открыть основное окно
            дополнительных настроек <mark className="plugin">AfterCodecs</mark> для выбора
            кодека и его параметров, нажмите на{" "}
            <mark className="select">«Format Options»</mark>.
            <ArticleMedia
              caption="Output Module Settings"
              src="legacy/aftereffects/selecting_aftercodecs.png"
              type="image"
            />
          </li>
          <li>
            <p>
              В открывшемся окне можно настроить качество и скорость кодирования. По
              умолчанию в параметре <mark className="select">«Quality»</mark> установлено
              значение <mark>70</mark>, а для <mark className="select">«Speed»</mark> —{" "}
              <mark>5</mark>.
            </p>
            <ArticleMedia
              caption="AfterCodecs 1.11.5 for Adobe After Effects"
              src="legacy/aftereffects/aftercodecs_settings.png"
              type="image"
            />
            <ul>
              <li>
                Параметр <mark className="select">«Tradeoff»</mark> определяет тип
                кодирования. <mark className="select">«Quality»</mark> ставит в приоритет
                качество (задаётся в процентах), а результат похож на смесь{" "}
                <mark className="select">«VBR»</mark> и режима постоянного качества.
                <mark className="select">«Bitrate»</mark> задаёт постоянный битрейт на всё
                видео. <mark className="select">«File Size»</mark> подгоняет качество с
                помощью переменного битрейта, чтобы уложиться в заданный размер файла.
              </li>
              <li>
                Параметр <mark className="select">«Speed»</mark> определяет скорость
                кодирования. Чем ниже значение, тем медленнее процесс, но лучше итоговое
                качество и эффективнее сжатие.
              </li>
              <li>
                В разделе <mark className="select">«Colors»</mark> можно настроить
                битность и цветовой диапазон, но обычно эти параметры не трогают.
              </li>
              <li>
                Параметр <mark className="select">«Audio Bitrate»</mark> отвечает за
                качество звука. Автоматический режим может работать некорректно, поэтому
                лучше вручную выставить значение <mark>320 Кбит/с</mark> или{" "}
                <mark>512 Кбит/с</mark>, чтобы не жертвовать качеством.
              </li>
              <li>
                Параметр <mark className="select">«GOP»</mark> определяет, сколько{" "}
                <mark>P-кадров</mark> и <mark>B-кадров</mark> вставляется между ключевыми{" "}
                <mark>I-кадрами</mark>.
              </li>
              <li>
                Параметры <mark className="select">«Tuning»</mark>,{" "}
                <mark className="select">«H.264 Profiles»</mark>,{" "}
                <mark className="select">«VR Meta»</mark> и{" "}
                <mark className="select">«Fast Start»</mark> лучше не трогать, если на то
                нет веской причины.
              </li>
            </ul>
          </li>
          <li>
            Если больше ничего настраивать не нужно, нажимайте{" "}
            <mark className="select">«OK»</mark>, пока не закроются все окна настроек. Не
            забудьте указать в <mark className="select">«Output To»</mark> путь и имя
            файла. Для запуска экспорта нажмите <mark className="select">«Render»</mark>{" "}
            или клавишу <mark className="key">Enter</mark>.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/start_render_button.png"
              type="image"
            />
          </li>
        </ul>
        <Addition type="info">
          Более подробную информацию о рекомендуемом процессе ввода и вывода можно найти в
          Telegram-посте от <a href="https://t.me/montage_tutors/2">Montage Tutors</a>.
        </Addition>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-web"
        tag="видео с прозрачностью, webm, vp9, av1, h265, alpha channel"
        title="Как экспортировать композицию для веб-страницы?"
      >
        <p>
          Рано или поздно наступает момент, когда нужно подготовить видео для публикации
          на веб-странице. Современные браузеры без проблем воспроизводят{" "}
          <mark className="video">H.264</mark> в контейнере{" "}
          <mark className="video">MP4</mark>, но этот формат не всегда даёт оптимальное
          соотношение качества и размера файла. Для веба существуют и более эффективные
          варианты — например, <mark className="video">WEBM</mark> с кодеками{" "}
          <mark className="video">VP9</mark> или <mark className="video">AV1</mark>. Эти
          современные алгоритмы сжатия от <mark className="company">Google</mark>{" "}
          обеспечивают заметно лучшее качество при том же битрейте и часто применяются в
          вебе и мобильных приложениях.
        </p>
        <p>
          На веб-странице можно указать несколько источников для одного тега{" "}
          <mark className="code">{`<video>`}</mark> — браузер сам выберет первый, который
          поддерживается устройством пользователя. Это нужно на случай, если тот или иной
          кодек не будет работать в браузере или на устройстве.
        </p>
        <CodeSnippet language="html">
          {`<!DOCTYPE html>
<html lang="ru">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>aefaq@aechat</title>
  </head>
  <body>
    <video controls autoplay>
      <source src="aefaq.webm" type="video/webm" />
      <source src="aefaq.mp4" type="video/mp4" />
    </video>
  </body>
</html>`}
        </CodeSnippet>
        <p>
          Если видео на странице не требует прозрачности, его можно экспортировать в{" "}
          <mark className="video">H.264</mark>, используя{" "}
          <a href="#export-mp4">те же способы</a>, что и при обычном рендере. Затем
          останется указать файл в качестве источника в исходном коде. Главное — следить
          за размером файла: не каждый посетитель захочет ждать, пока загрузится видео на
          сотни мегабайт.
        </p>
        <p>
          А вот экспортировать композицию в более эффективные{" "}
          <mark className="video">VP9</mark> или <mark className="video">AV1</mark> с
          поддержкой альфа-канала<sup>1</sup> напрямую из{" "}
          <mark className="app">Adobe After Effects</mark> не получится<sup>2</sup>.
          Придётся сначала вывести её в качественном монтажном кодеке, например{" "}
          <mark className="video">Apple ProRes</mark>, а затем перекодировать результат
          через <mark className="app">Shutter Encoder</mark>.
        </p>
        <Addition type="danger">
          <ul>
            <li>
              <sup>1</sup> <mark className="app">Safari</mark> на <mark>iOS</mark> и{" "}
              <mark>macOS</mark>, а также многие программы для монтажа не поддерживают{" "}
              <mark className="video">WEBM</mark> с прозрачностью, поэтому вместо
              альфа-канала вы просто увидите чёрный фон.
            </li>
            <li>
              <sup>2</sup> Несмотря на то, что существует сторонний плагин для экспорта{" "}
              <a href="https://fnord.com/">WEBM</a> от <mark className="user">fnord</mark>{" "}
              для <mark className="app">Adobe Media Encoder</mark>, я категорически не
              рекомендую его использовать. Он часто выдаёт видео с жуткими артефактами,
              отвратительным качеством или просто «падает» посреди рендера без всякой
              причины.
            </li>
          </ul>
        </Addition>
        <Divider>Экспортируем композицию в промежуточном формате</Divider>
        <ul>
          <li>
            Прежде чем экспортировать композицию в{" "}
            <mark className="video">Apple ProRes</mark>, добавьте её в очередь рендеринга
            с помощью комбинации клавиш <mark className="key">Ctrl + M</mark> или через
            меню <mark className="select">«File» → «Export» → «Add to Render Queue»</mark>
            .
          </li>
          <li>
            Нажмите на название пресета в очереди рендера, чтобы открыть настройки{" "}
            <mark className="select">«Output Module»</mark>.
          </li>
          <li>
            В параметре <mark className="select">«Format»</mark> выберите{" "}
            <mark className="select">«QuickTime»</mark>, а в{" "}
            <mark className="select">«Format Options»</mark> — подходящий тип кодека{" "}
            <mark className="video">Apple ProRes</mark>.
            <Addition type="info">
              <ul>
                <li>
                  Для экспорта без альфа-канала выберите{" "}
                  <mark className="video">Apple ProRes 422</mark> или другой подходящий
                  вариант.
                </li>
                <li>
                  Для экспорта с альфа-каналом выберите кодек{" "}
                  <mark className="video">Apple ProRes 4444</mark> и не забудьте в
                  параметре <mark className="select">«Channels»</mark> установить значение{" "}
                  <mark className="select">«RGB + Alpha»</mark>.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            Если другие настройки не требуются, нажмите{" "}
            <mark className="select">«OK»</mark>. Не забудьте указать путь и имя файла в{" "}
            <mark className="select">«Output To»</mark>, а затем запустите экспорт кнопкой{" "}
            <mark className="select">«Render»</mark> или клавишей{" "}
            <mark className="key">Enter</mark>.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/start_render_button.png"
              type="image"
            />
          </li>
        </ul>
        <Divider>Разбираемся с целью экспорта и альфа-каналом в браузерах</Divider>
        <p>
          После получения промежуточного результата, нужно разобраться как и для чего вы
          хотите экспортировать видео.
        </p>
        <ul>
          <li>
            Если нужно расположить на страницу обычное видео без альфа-канала, то как было
            сказано ранее, вы можете конвертировать промежуточный результат в{" "}
            <a href="https://developer.mozilla.org/en-US/docs/Web/Media/Guides/Formats/Video_codecs#common_codecs">
              популярные кодеки, которые поддерживаются браузерами
            </a>{" "}
            и указать несколько источников для одного HTML-тега{" "}
            <mark className="code">{`<video>`}</mark>.
          </li>
          <li>
            Если же нужно получить видео с альфа-каналом, и при этом добиться корректного
            отображения во всех браузерах — включая <mark className="app">Safari</mark>,{" "}
            <mark className="app">Firefox</mark> и браузеры на базе{" "}
            <mark className="app">Chromium</mark> — придётся подготовить два файла:
            специальный <mark className="video">H.265</mark> для{" "}
            <mark className="app">Safari</mark> и <mark className="video">WEBM</mark> для
            остальных. Дело в том, что <mark className="app">Safari</mark> на{" "}
            <mark>iOS</mark> и <mark>macOS</mark> не поддерживает{" "}
            <mark className="video">WEBM</mark> с прозрачностью, поэтому при единственном
            источнике вместо альфа-канала вы просто увидите чёрный фон.
          </li>
        </ul>
        <Divider>Конвертируем промежуточный результат</Divider>
        <p>
          Для конвертации промежуточного результата в этой статье мы воспользуемся
          бесплатной<sup>1</sup> сторонней программой{" "}
          <mark className="app">Shutter Encoder</mark>.
        </p>
        <Addition type="info">
          <ul>
            <li>
              <sup>1</sup> Если <mark className="app">Shutter Encoder</mark> у вас не
              установлен, скачайте его{" "}
              <a href="https://www.shutterencoder.com/">по этой ссылке</a>. Чтобы скачать
              программу бесплатно, на сайте установите чекбокс{" "}
              <mark className="select">
                «I do not wish to participate in the development of the software»
              </mark>
              , а затем нажмите на кнопку скачивания для вашей операционной системы.
            </li>
            <li>
              В <mark className="app">Shutter Encoder</mark> лучше сразу переключиться на
              английский интерфейс. Перевод на русский язык в этой программе некорректен,
              из-за чего можно легко запутаться и включить не те параметры. Чтобы открыть
              настройки, нажмите на значок шестерёнки в левой части заголовка окна.
            </li>
          </ul>
        </Addition>
        <ul>
          <li>
            Для начала конвертации, откройте <mark className="app">Shutter Encoder</mark>
            <sup>1</sup> и импортируйте в него полученный файл с помощью кнопки{" "}
            <mark className="select">«Browse»</mark> или перетащите их в окно программы
            для добавления в очередь.
            <ArticleMedia
              caption="Shutter Encoder"
              src="legacy/shutter_encoder_import.png"
              type="image"
            />
          </li>
          <li>
            Затем выберите в <mark className="select">«Choose Function»</mark> нужный
            формат для конвертации, например <mark className="video">VP9</mark>,{" "}
            <mark className="video">AV1</mark>
            <sup>1</sup> или <mark className="video">H.265</mark>. Изменение данного
            параметра будет относиться ко всем файлам в очереди конвертации.
            <Addition type="info">
              <sup>1</sup> <mark className="video">AV1</mark> сжимает видео эффективнее,
              чем <mark className="video">VP9</mark>, но хуже поддерживается старыми
              устройствами.
            </Addition>
            <ArticleMedia
              caption="Shutter Encoder"
              src="legacy/select_vp9_shutter_encoder.png"
              type="image"
            />
          </li>
          <li>
            Измените тип кодирования, переключив его с{" "}
            <mark className="select">«VBR»</mark> на <mark className="select">«CQ»</mark>.
            Почему не <mark className="select">«VBR»</mark> и не{" "}
            <mark className="select">«CBR»</mark>? Режим{" "}
            <mark className="select">«CQ»</mark> распределяет битрейт динамически в
            зависимости от сложности сцены и поддерживает стабильное качество на всём
            протяжении ролика. В то время как <mark className="select">«VBR»</mark>{" "}
            требует настройки целевого и максимального битрейта, подобрать которые с
            первого раза непросто, особенно если важно сохранить высокое качество и при
            этом не получить слишком тяжёлый файл. А <mark className="select">«CBR»</mark>{" "}
            нередко приводит к «раздутому» размеру файла и не гарантирует стабильное
            качество в разных промежутках видео.
            <ArticleMedia
              caption="Shutter Encoder"
              src="legacy/shutter_encoder_change_cq_h264.mp4"
              type="video"
            />
            <Addition type="info">
              <ul>
                <li>
                  Чем меньше значение <mark className="select">«CQ»</mark>, тем лучше
                  качество. По умолчанию устанавливается <mark>23</mark> — этого
                  достаточно для большинства случаев.
                </li>
                <li>
                  Если нужно сохранить почти максимальное качество, укажите значение от{" "}
                  <mark>17</mark> до <mark>20</mark>. Однако размер файла при этом заметно
                  возрастёт.
                </li>
                <li>
                  Экстремальные значения (например, <mark>50</mark>) использовать не
                  рекомендуется — в итоге можно получить «кашу» из пикселей.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            Укажите битрейт для аудио в параметре{" "}
            <mark className="select">«Audio Bitrate»</mark>; достаточно установить
            значение <mark>320</mark> Кбит/с.
            <ArticleMedia
              caption="Shutter Encoder"
              src="legacy/shutter_encoder_change_audio_bitrate_h264.mp4"
              type="video"
            />
          </li>
          <li>
            Если при конвертации нужно сохранить альфа-канал, справа в разделе{" "}
            <mark className="select">«Advanced Settings»</mark> включите параметр{" "}
            <mark className="select">«Enable alpha channel»</mark>.
            <ArticleMedia
              caption="Shutter Encoder"
              src="legacy/enable_alpha_shutter_encoder.png"
              type="image"
            />
          </li>
          <li>
            При необходимости включите аппаратное ускорение для декодирования видео в
            параметре <mark className="select">«Hardware Acceleration»</mark>. В
            большинстве случаев это ускорит процесс конвертации видео.
            <ArticleMedia
              caption="Shutter Encoder"
              src="legacy/shutter_encoder_enable_hardware_acceleration_h264.png"
              type="image"
            />
            <Addition type="info">
              Выбор значений в этом параметре зависит от выбранного кодека, вашего
              устройства и установленных драйверов.
            </Addition>
            <Addition type="warning">
              На <mark>Windows</mark> при включенном аппаратном ускорении для{" "}
              <mark className="video">H.265</mark> нельзя включить опцию сохранения
              альфа-канала.
            </Addition>
          </li>
          <li>
            После настройки нужных параметров нажмите на кнопку{" "}
            <mark className="select">«Start function»</mark> для начала конвертации. По
            умолчанию программа сохраняет конвертированные файлы в ту же папку, откуда
            были импортированы исходники.
            <ArticleMedia
              caption="Shutter Encoder"
              src="legacy/shutter_encoder_start_function.png"
              type="image"
            />
            <Addition type="info">
              <ul>
                <li>
                  Если в программу добавлено несколько исходников, они будут
                  конвертированы последовательно в соответствии с вашими настройками.
                </li>
                <li>
                  При необходимости вы можете указать свою директорию для сохранения
                  файлов во вкладке <mark className="select">«Output»</mark>.
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <Divider>
          Используем конвертированное видео с прозрачностью на веб-странице
        </Divider>
        <p>
          После того как вы экспортировали видео в <mark className="video">VP9</mark>,
          <mark className="video">AV1</mark> или <mark className="video">H.265</mark> с
          альфа-каналом, укажите их как источники для HTML-тега{" "}
          <mark className="code">{`<video>`}</mark>. Браузер сам выберет нужный формат:
          например, <mark className="app">Chrome</mark>и{" "}
          <mark className="app">Firefox</mark> будут использовать{" "}
          <mark className="video">VP9</mark>, а <mark className="app">Safari</mark> —{" "}
          <mark className="video">HEVC</mark>.
        </p>
        <CodeSnippet language="html">
          {`<video loop controls autoplay>
  <source
    src="images/aefaq@aechat_alpha.mp4"
    type="video/mp4;codecs=hvc1"
  />
  <source
    src="images/aefaq@aechat_alpha.webm"
    type="video/webm"
  />
</video>`}
        </CodeSnippet>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-gif"
        tag="gifgun, ezgif, animated gif"
        title="Как экспортировать композицию в GIF?"
      >
        <p>
          <mark className="image">GIF</mark> — старый, но до сих пор популярный формат,
          разработанный в 1987 году. Его ценят за простоту: любой браузер или мессенджер
          открывает его без проблем, поэтому он и закрепился в культуре мемов, стикеров и
          коротких анимаций.
        </p>
        <p>
          Стандартного экспорта в <mark className="image">GIF</mark> из{" "}
          <mark className="app">Adobe After Effects</mark> нет, но есть обходные пути.{" "}
          <mark className="image">GIF</mark> можно создать с помощью стороннего расширения{" "}
          <mark className="plugin">GifGun</mark>, через{" "}
          <mark className="app">Adobe Media Encoder</mark> или с помощью
          онлайн-конвертера, например <a href="https://ezgif.com/video-to-gif">Ezgif</a>.
          Последний, пожалуй, даёт лучший результат по соотношению «качество/размер».
        </p>
        <Addition type="warning">
          <p>
            Имейте в виду: у формата <mark className="image">GIF</mark> множество
            ограничений и особенностей. Для веб-страниц разумнее использовать{" "}
            <mark className="video">WEBM</mark> или <mark className="video">H.264</mark> —
            они обеспечивают лучшее качество при меньшем размере файла.
          </p>
          <ul>
            <li>
              Нет поддержки полупрозрачности: пиксель либо полностью прозрачный, либо нет.
            </li>
            <li>
              Палитра ограничена 256 цветами, поэтому о плавных градиентах и точной
              цветопередаче придётся забыть.
            </li>
            <li>
              Полученный файл может быть огромным по весу, если указать высокое разрешение
              или частоту кадров. Для веба лучше придерживаться максимум{" "}
              <mark>1024×576</mark> и <mark>15 FPS</mark>. Тяжёлые{" "}
              <mark className="image">GIF</mark> перегружают браузер и замедляют сайты,
              особенно на мобильных устройствах.
            </li>
            <li>
              <mark className="image">GIF</mark> сжимается крайне посредственно по
              сравнению с <mark className="video">WEBM</mark> или{" "}
              <mark className="video">MP4</mark>, поэтому почти всегда получается больше
              по размеру и хуже по качеству.
            </li>
          </ul>
        </Addition>
        <Divider>Экспортируем с помощью GifGun</Divider>
        <ul>
          <li>
            Предположим, что вы уже установили расширение{" "}
            <mark className="plugin">GifGun</mark>. Откройте его через меню{" "}
            <mark className="select">«Window» → «Extensions» → «GifGun»</mark>.
            <ArticleMedia
              caption="Открываем расширение «GifGun»"
              src="legacy/aftereffects/open_gifgun.png"
              type="image"
            />
            <Addition type="info">
              <ul>
                <li>
                  <ContentFilter
                    macContent={
                      <div>
                        Если расширение есть в списке, но не открывается, убедитесь, что
                        вы выполнили в <mark className="app">Терминале</mark> команды для
                        включения debug-режима, необходимые для работы сторонних
                        расширений. Чтобы скопировать команды в буфер обмена, достаточно
                        на них нажать.
                        <CodeSnippet>
                          defaults write com.adobe.CSXS.5 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.6 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.7 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.8 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.9 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.10 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.11 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.12 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.13 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.14 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.15 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.16 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.17 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.18 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.19 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.20 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.21 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.22 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.23 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.24 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.25 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.26 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.27 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.28 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.29 PlayerDebugMode 1
                          <br />
                          defaults write com.adobe.CSXS.30 PlayerDebugMode 1
                          <br />
                        </CodeSnippet>
                      </div>
                    }
                    windowsContent={
                      <div>
                        Если расширение есть в списке, но не открывается, убедитесь, что
                        вы подтвердили слияние записей с{" "}
                        <a
                          download
                          href="files/Enable Extensions Adobe.reg"
                        >
                          файлом реестра
                        </a>
                        , включающим debug-режим для корректной работы сторонних
                        расширений.
                      </div>
                    }
                  />
                </li>
                <li>
                  Для корректной работы расширения рекомендуется в настройках{" "}
                  <mark className="select">
                    «Edit» → «Preferences» → «Scripting & Expressions»
                  </mark>{" "}
                  установить флажок у параметра{" "}
                  <mark className="select">
                    «Allow Scripts to Write Files and Access Network»
                  </mark>
                  .
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            В открывшемся окне расширения вы увидите две основные кнопки:{" "}
            <mark className="select">«Make GIF»</mark> для запуска экспорта и кнопка с
            шестерёнкой для настроек.
            <ArticleMedia
              caption="GifGun"
              src="legacy/aftereffects/gifgun_main.png"
              type="image"
            />
          </li>
          <li>
            В настройках вы можете указать максимальный размер файла, частоту кадров и
            путь сохранения.
            <ArticleMedia
              caption="GifGun"
              src="legacy/aftereffects/gifgun_settings.png"
              type="image"
            />
          </li>
          <li>
            Чтобы начать экспорт <mark className="image">GIF</mark> с заданными вами
            настройками, просто нажмите на <mark className="select">«Make GIF»</mark> из
            главного окна расширения и ожидайте получения результата. Если чекбокс{" "}
            <mark className="select">«Open GIF folder»</mark> был включен, расширение
            автоматически откроет системный проводник с директорией, куда была сохранена
            анимация.
          </li>
        </ul>
        <Divider>Конвертируем через Ezgif</Divider>
        <p>
          Если вы не хотите возиться с дополнениями или у вас уже есть готовое видео,
          которое нужно просто конвертировать в <mark className="image">GIF</mark>,
          воспользуйтесь онлайн-сервисом{" "}
          <a href="https://ezgif.com/video-to-gif">Ezgif</a>. Он обеспечивает хорошее
          соотношение качества и размера файла.
        </p>
        <ul>
          <li>
            <p>
              Сначала загрузите видео на сайт — просто перетащите его в область публикации
              и нажмите кнопку <mark className="select">«Upload Video»</mark>.
            </p>
            <Addition type="warning">
              Максимальный размер загружаемого файла — <mark>200 МБ</mark>.
            </Addition>
            <ArticleMedia
              caption="Ezgif"
              src="legacy/ezgif_main.png"
              type="image"
            />
          </li>
          <li>
            После загрузки можно настроить частоту кадров и разрешение итогового файла.
            Выбор параметров не слишком широкий, но для простой конвертации этого вполне
            достаточно. После указания нужных параметров, нажмите{" "}
            <mark className="select">«Convert to GIF!»</mark>.
            <Addition type="warning">
              Максимальная длительность <mark className="image">GIF</mark> зависит от
              выбранной частоты кадров: до 60 секунд при <mark>5 FPS</mark> или до 15
              секунд при <mark>20 FPS</mark>.
            </Addition>
            <ArticleMedia
              caption="Ezgif"
              src="legacy/ezgif_settings.png"
              type="image"
            />
          </li>
          <li>
            После конвертации готовый <mark className="image">GIF</mark> появится ниже — в
            разделе <mark className="select">«Output GIF Animation»</mark>. Сохраните его,
            нажав <mark className="key">ПКМ</mark> по анимации и выбрав{" "}
            <mark className="select">«Сохранить изображение как...»</mark>.
          </li>
        </ul>
        <Divider>Экспортируем с помощью Adobe Media Encoder</Divider>
        <p>
          <mark className="image">GIF</mark> можно экспортировать и через{" "}
          <mark className="app">Adobe Media Encoder</mark>. Несмотря на то, что многие его
          обходят стороной, он всё же предлагает больше вариантов форматов экспорта по
          сравнению с «чистым» <mark className="app">Adobe After Effects</mark>.
        </p>
        <ul>
          <li>
            Для начала отправьте композицию<sup>1</sup> из{" "}
            <mark className="app">Adobe After Effects</mark> в{" "}
            <mark className="app">Adobe Media Encoder</mark> через меню{" "}
            <mark className="select">
              «File» → «Export» → «Add to Adobe Media Encoder Queue»
            </mark>{" "}
            и дождитесь открытия программы, либо откройте{" "}
            <mark className="app">Adobe Media Encoder</mark> и импортируйте в него готовое
            видео.
            <Addition type="info">
              <sup>1</sup> Композиция корректно отправится в{" "}
              <mark className="app">Adobe Media Encoder</mark> только если версии обеих
              программ совпадают по году выпуска и они установлены в стандартные папки.
            </Addition>
          </li>
          <li>
            В очереди экспорта выберите формат{" "}
            <mark className="select">«Animated GIF»</mark>. Там же можно задать пресет и
            путь сохранения. Для детальной настройки разрешения, частоты кадров и других
            параметров нажмите на название пресета, чтобы открыть окно{" "}
            <mark className="select">«Export Settings»</mark>.
            <Addition type="warning">
              Если выбрать формат <mark className="select">«GIF»</mark> без слова{" "}
              <mark>Animated</mark>, вы получите последовательность отдельных кадров,
              которая заполнит всю папку сохранения.
            </Addition>
            <ArticleMedia
              caption="Media Encoder"
              src="legacy/aftereffects/selecting_animated_gif_media_encoder.png"
              type="image"
            />
          </li>
          <li>
            После настройки параметров в <mark className="select">«Export Settings»</mark>{" "}
            нажмите <mark className="select">«OK»</mark>, чтобы закрыть окно, и запустите
            экспорт, нажав на зелёную иконку в очереди экспорта.
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-dxv"
        tag="resolume, дхв"
        title="Как экспортировать композицию в DXV?"
      ></DetailsSummary>
      <DetailsSummary
        anchor="export-prores"
        tag="prores 4444, prores 422, quicktime, видео с прозрачностью, alpha channel"
        title="Как экспортировать композицию в Apple ProRes?"
      >
        <p>
          <mark className="video">Apple ProRes</mark> — это семейство высококачественных
          кодеков, разработанное <mark>Apple</mark> в 2007 году и широко используемое в
          сфере видеопроизводства. Из <mark className="app">Adobe After Effects</mark>{" "}
          можно напрямую экспортировать композицию в кодеках{" "}
          <mark className="video">Apple ProRes 422</mark>
          <sup>1</sup> и <mark className="video">Apple ProRes 4444</mark>
          <sup>2</sup>, а затем применять их по назначению.
        </p>
        <Addition type="warning">
          В старых версиях <mark className="app">Adobe After Effects</mark> нельзя было
          импортировать файлы с кодеком <mark className="app">Apple ProRes</mark> и
          экспортировать композиции в <mark className="app">Apple ProRes</mark>. Данная
          функция появилась в <mark className="app">Adobe After Effects</mark> версии{" "}
          <mark>16.0.1</mark> (2019) и новее.
        </Addition>
        <p>
          Ключевая особенность монтажных кодеков, включая{" "}
          <mark className="video">Apple ProRes</mark>, в отличие от кодеков,
          предназначенных для просмотра видео, например{" "}
          <mark className="video">H.264</mark> или <mark className="video">VP9</mark>,
          заключается в том, что они меньше сжимают видео и работают стабильнее в
          монтажных программах, хотя занимают больше места на диске.
        </p>
        <Addition type="info">
          <ul>
            <li>
              <sup>1</sup> <mark className="video">Apple ProRes 422</mark> включает
              несколько вариантов, различающихся степенью сжатия и битрейтом. Все они
              поддерживают 10-битную глубину цвета и цветовую субдискретизацию{" "}
              <mark>4:2:2</mark>. Битрейт зависит от разрешения, частоты кадров и
              сложности контента. Хороши для дальнейшего монтажа, если не требуется
              альфа-канал или максимально точное сохранение цвета.{" "}
              <a href="https://ru.m.wikipedia.org/wiki/Apple_ProRes#Apple_ProRes_422">
                Подробнее о вариантах...
              </a>
            </li>
            <li>
              <sup>2</sup> <mark className="video">Apple ProRes 4444</mark> и{" "}
              <mark className="video">Apple ProRes 4444 XQ</mark> — версии с максимальным
              качеством, без цветовой субдискретизации и поддержкой 12-битного цвета и
              альфа-канала. Идеальны для экспорта графики с прозрачностью или без
              изменения цвета после конвертации.
            </li>
          </ul>
        </Addition>
        <Divider>Экспортируем в Apple ProRes</Divider>
        <ul>
          <li>
            Чтобы отправить на экспорт текущую композицию или выделенную в окне{" "}
            <mark className="select">«Project»</mark>, нажмите{" "}
            <mark className="key">Ctrl + M</mark> или выберите в меню{" "}
            <mark className="select">«File» → «Export» → «Add to Render Queue»</mark>.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/render_queue_h264.png"
              type="image"
            />
          </li>
          <li>
            Чтобы изменить формат экспорта, нажмите на название шаблона — откроется окно{" "}
            <mark className="select">«Output Module»</mark>.
          </li>
          <li>
            В открывшемся окне в параметре <mark className="select">«Format»</mark>{" "}
            выберите <mark className="select">«QuickTime»</mark>, а затем перейдите в{" "}
            <mark className="select">«Format Options»</mark>.
          </li>
          <li>
            В открывшемся окне в параметре <mark className="select">«Video Codec»</mark>{" "}
            выберите нужный вам вариант <mark className="video">Apple ProRes</mark>.
          </li>
          <li>
            Если вы собираетесь экспортировать композицию с альфа-каналом — не забудьте в{" "}
            <mark className="select">«Channels»</mark> установить параметр{" "}
            <mark className="select">«RGB + Alpha»</mark>.
          </li>
          <li>
            Затем укажите путь сохранения и нажмите кнопку{" "}
            <mark className="select">«Render»</mark>.
          </li>
        </ul>
        <p></p>
        <ArticleMedia
          caption="Экспорт видео в Apple ProRes"
          src="legacy/aftereffects/export_to_prores.mp4"
          type="video"
        />
        <Divider>Как проверить наличие прозрачности в композиции?</Divider>
        <p>
          Перед экспортом убедитесь, что в вашей композиции действительно есть
          прозрачность. Чтобы проверить это, нажмите на кнопку{" "}
          <mark className="select">«Toggle Transparency Grid»</mark> под окном
          предпросмотра. Она заменяет фон на сетку в виде шахматной доски, показывая
          прозрачные области.
        </p>
        <ArticleMedia
          caption="Composition"
          src="legacy/aftereffects/toggle_transparency_grid.png"
          type="image"
        />
        <Addition type="info">
          Для просмотра видео, закодированных в{" "}
          <mark className="video">Apple ProRes</mark>, рекомендуется использовать
          сторонние плееры, например <mark className="app">VLC</mark> или{" "}
          <mark className="app">MPC-HC</mark>. Учтите, что не все плееры могут корректно
          отобразить видео с альфа-каналом.
        </Addition>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-audio"
        tag="аудио, звук, музыка, wav, mp3, aiff"
        title="Как экспортировать из композиции только аудио?"
      >
        <p>
          Несмотря на то, что <mark className="app">Adobe After Effects</mark> не является
          аудиоредактором, иногда всё же возникает необходимость экспорта целой звуковой
          композиции отдельным файлом.
        </p>
        <ul>
          <li>
            Прежде чем экспортировать композицию как аудиофайл, добавьте её в очередь
            рендеринга с помощью комбинации клавиш <mark className="key">Ctrl + M</mark>{" "}
            или через меню{" "}
            <mark className="select">«File» → «Export» → «Add to Render Queue»</mark>.
          </li>
          <li>
            Нажмите на название пресета в очереди рендера, чтобы открыть настройки{" "}
            <mark className="select">«Output Module»</mark>.
          </li>
          <li>
            В параметре <mark className="select">«Format»</mark> выберите один из
            аудиоформатов: <mark className="audio">WAV</mark>,{" "}
            <mark className="audio">MP3</mark> или <mark className="audio">AIFF</mark>.
          </li>
          <li>
            В <mark className="select">«Output To»</mark> укажите путь и имя файла. Для
            запуска экспорта нажмите <mark className="select">«Render»</mark> или клавишу{" "}
            <mark className="key">Enter</mark>.
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-tgs"
        tag="стикеры, tgs, lottie, animated stickers"
        title="Как экспортировать анимацию для стикеров и эмодзи в Telegram?"
      >
        <Addition type="tldr">
          Для экспорта анимации в <mark className="file">TGS</mark> используйте стороннее
          расширение <mark className="plugin">Bodymovin for Telegram</mark>. В качестве
          альтернативы вы можете экспортировать вашу анимацию в{" "}
          <mark className="file">JSON</mark> с помощью{" "}
          <mark className="plugin">Bodymovin</mark> и конвертировать полученный файл в{" "}
          <mark className="file">TGS</mark> с помощью конвертера в статье.
        </Addition>
        <p>
          В современном мире только ленивый не слышал о мессенджере{" "}
          <mark className="app">Telegram</mark> и о возможности отправлять стикеры
          собеседнику. В стикерах можно хранить шутки, мемы и другой контент. Но мало кто
          знает, как их создавать и экспортировать композицию из{" "}
          <mark className="app">Adobe After Effects</mark> в соответствии с требованиями{" "}
          <mark className="app">Telegram</mark>. Стикеры делятся на четыре вида, и у
          каждого свой подход к экспорту из программы и импорту в{" "}
          <mark className="app">Telegram</mark>.
        </p>
        <Divider>Разбираемся с типами стикеров</Divider>
        <ul>
          <li>
            <mark className="word">Статичный стикер</mark>, или{" "}
            <mark className="word">статичный эмодзи</mark>, — это обычная картинка,
            которую отправляют собеседнику. Её можно создать в любом графическом
            редакторе, например в <mark className="app">Adobe Photoshop</mark> или{" "}
            <mark className="app">GIMP</mark>, или экспортировать из{" "}
            <mark className="app">Adobe After Effects</mark> как{" "}
            <a href="#export-still">один кадр</a>.
            <ul>
              <li>
                Для создания принимаются изображения формата{" "}
                <mark className="image">PNG</mark> или <mark className="image">WEBP</mark>{" "}
                с прозрачным или непрозрачным фоном.
              </li>
              <li>
                Разрешение такого стикера должно быть не более <mark>512</mark> на{" "}
                <mark>512</mark> пикселей. Такие стикеры можно сделать с любым
                соотношением сторон, главное, чтобы ни одна сторона не была больше{" "}
                <mark>512</mark> пикселей.
              </li>
            </ul>
          </li>
          <li>
            <mark className="word">Анимированный стикер</mark> — это векторный стикер с
            анимацией, который не теряет в качестве при воспроизведении на разных
            устройствах. По своей сути он похож на анимацию <mark>Lottie</mark> и имеет
            ряд ограничений по эффектам и размеру файла. Разрешение композиции должно быть{" "}
            <mark>512</mark> на <mark>512</mark> пикселей. Частота кадров композиции
            должна быть строго <mark>30</mark> или <mark>60</mark>, иначе рендер
            завершится с ошибкой.
            <Addition type="danger">
              <p>
                Для корректного вывода анимации в файл формата{" "}
                <mark className="file">TGS</mark> в вашей композиции не должно быть
                следующих эффектов и свойств:
              </p>
              <ul>
                <li>
                  Выражения не поддерживаются, но их можно конвертировать в ключи. Для
                  этого выделите нужное свойство с выражением, нажмите{" "}
                  <mark className="key">ПКМ</mark> и выберите{" "}
                  <mark className="select">
                    «Keyframe Assistant» → «Convert Expression to Keyframes»
                  </mark>
                  .
                </li>
                <li>
                  Не поддерживается интерполяция скорости с помощью{" "}
                  <mark className="select">«Auto Bezier»</mark> у ключевых кадров. Для
                  смены типа интерполяции выделите нужные ключи, нажмите{" "}
                  <mark className="key">Ctrl + Alt + K</mark> и избавьтесь от
                  автоматического Безье.
                </li>
                <li>
                  Слои с изображениями не поддерживаются. Если такой слой всё-таки нужен,
                  выполните его автотрассировку для конвертации в вектор в{" "}
                  <mark className="app">Adobe Illustrator</mark> или другой программе, а
                  затем импортируйте как слой-фигуру.{" "}
                  <a href="https://helpx.adobe.com/illustrator/using/image-trace-results-optimization.html">
                    Подробнее...
                  </a>
                </li>
                <li>
                  Эффекты из <mark className="select">«Effects & Presets»</mark>{" "}
                  использовать нельзя, иначе они просто пропадут из финальной анимации.
                </li>
                <li>
                  Нельзя растягивать слои и использовать{" "}
                  <mark className="select">«Time Remapping»</mark>. Проверить растяжение
                  можно в столбце <mark className="select">«Stretch»</mark>.
                </li>
                <li>
                  Текстовые слои не поддерживаются, их нужно конвертировать в фигуры. Для
                  этого нажмите <mark className="key">ПКМ</mark> по слою с текстом и
                  выберите{" "}
                  <mark className="select">«Create» → «Create Shapes from Text»</mark>.
                </li>
                <li>
                  Не поддерживается поворот слоёв с помощью{" "}
                  <mark className="select">«Auto-Oriented Layers»</mark>. Автоориентацию
                  можно выключить, выделив слой и нажав{" "}
                  <mark className="key">Ctrl + Alt + O</mark>. В открывшемся окне выберите
                  параметр <mark className="select">«Off»</mark>.
                </li>
                <li>
                  Маски для слоёв, трёхмерные слои,{" "}
                  <mark className="select">«Solid Layer»</mark>,{" "}
                  <mark className="select">«Merge Paths»</mark>,{" "}
                  <mark className="select">«Repeater»</mark>,{" "}
                  <mark className="select">«Star Shape»</mark> и{" "}
                  <mark className="select">«Gradient Stroke»</mark> не поддерживаются.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            <mark className="word">Анимированные эмодзи</mark> по своей сути похожи на{" "}
            <mark className="word">анимированные стикеры</mark>. К ним применяются те же
            ограничения по эффектам и возможностям{" "}
            <mark className="app">Adobe After Effects</mark>, и выводятся они аналогичным
            образом.
            <ul>
              <li>
                Для анимированных эмодзи нужно указать размер композиции <mark>100</mark>{" "}
                на <mark>100</mark> пикселей. Ни больше ни меньше.
              </li>
              <li>
                Ограничения по эффектам такие же, как и у{" "}
                <mark className="word">анимированных стикеров</mark>.
              </li>
            </ul>
          </li>
          <li>
            <mark className="word">Видеостикер</mark> — это, по сути, обычное видео в
            формате <mark className="video">WEBM</mark> с кодеком{" "}
            <mark className="video">VP9</mark>. Максимальное разрешение такого стикера —
            <mark>512</mark> на <mark>512</mark> пикселей.
          </li>
        </ul>
        <Addition type="info">
          Подробнее о требованиях для того или иного типа стикеров вы можете прочитать на{" "}
          <a href="https://core.telegram.org/stickers">сайте Telegram</a>.
        </Addition>
        <Divider>Экспортируем анимированный стикер через Bodymovin-Telegram</Divider>
        <p>
          Для экспорта из <mark className="app">Adobe After Effects</mark> в стикеры
          формата <mark className="file">TGS</mark> понадобится бесплатное стороннее
          расширение{" "}
          <a href="https://github.com/TelegramMessenger/bodymovin-extension">
            Bodymovin-TG
          </a>
          . Учтите, что оно давно не обновлялось и могут возникать ошибки при работе с
          последними версиями <mark className="app">Adobe After Effects</mark>. Кроме
          того, в нём меньше функций по сравнению с оригинальным{" "}
          <mark className="plugin">Bodymovin</mark>.
        </p>
        <p>
          После установки <mark className="plugin">Bodymovin-TG</mark> появится в меню{" "}
          <mark className="select">
            «Window» → «Extensions» → «Bodymovin for Telegram Stickers»
          </mark>
          . Если вы уверены, что ваша анимация соответствует всем требованиям для
          анимированных стикеров или эмодзи, откройте окно расширения, выделите в нём
          нужную композицию, укажите путь для сохранения и нажмите{" "}
          <mark className="select">«Export»</mark>. Если при экспорте что-то пойдёт не
          так, расширение сообщит об этом.
        </p>
        <ArticleMedia
          caption="Bodymovin for Telegram Stickers"
          src="legacy/aftereffects/bodymovin_tg_export_window.png"
          type="image"
        />
        <Addition type="warning">
          Для корректной работы расширения нужно установить флажок{" "}
          <mark className="select">
            «Allow Scripts to Write Files and Access Network»
          </mark>{" "}
          в{" "}
          <mark className="select">
            «Edit» → «Preferences» → «Scripting & Expressions»
          </mark>
          .
        </Addition>
        <p>
          После экспорта перейдите в{" "}
          <a href="https://t.me/Stickers">бот для создания стикеров</a> и начните процесс
          создания стикера. Если что-то пойдёт не так, бот сообщит об этом и укажет на
          проблему. Чаще всего ошибки возникают из-за слишком большого размера файла или
          неверно указанного типа стикера в начале работы.
        </p>
        <Divider>
          Альтернативный вывод анимированного стикера через обычный Bodymovin
        </Divider>
        <Addition type="danger">
          Описанный ниже способ не всегда работает стабильно и приведён в качестве
          экспериментальной альтернативы.
        </Addition>
        <p>
          Если экспорт через <mark className="plugin">Bodymovin-TG</mark> завершился сбоем
          или вам не хватает функциональности оригинального расширения, попробуйте
          экспортировать анимацию через обычный <mark className="plugin">Bodymovin</mark>,
          а затем конвертировать полученный файл с помощью{" "}
          <i style={{opacity: 0.5}}>самодельного</i> конвертера из этой статьи.
        </p>
        <p>
          Прежде чем экспортировать анимацию в <mark className="file">JSON</mark>, нужно
          установить стороннее бесплатное<sup>1</sup> расширение{" "}
          <mark className="plugin">Bodymovin</mark>, которое можно загрузить с{" "}
          <a href="https://aescripts.com/bodymovin/">aescripts</a>. После установки оно
          появится в меню{" "}
          <mark className="select">«Window» → «Extensions» → «Bodymovin»</mark>.
        </p>
        <Addition type="info">
          <sup>1</sup> Чтобы скачать расширение, зарегистрируйтесь на сайте{" "}
          <a href="https://aescripts.com">aescripts</a>, вернитесь на страницу с
          расширением, установите цену <mark>0</mark> в поле{" "}
          <mark className="select">«Name Your Own Price»</mark>, добавьте его в корзину и
          подтвердите заказ. Нужный плагин появится{" "}
          <a href="https://aescripts.com/downloadable/customer/products/">
            в вашем профиле
          </a>
          , и вы сможете его скачать абсолютно бесплатно.
        </Addition>
        <Addition type="warning">
          <ul>
            <li>
              Перед экспортом убедитесь, что ваша анимация поддерживается расширением{" "}
              <mark className="plugin">Bodymovin</mark>. Совместимость эффектов можно
              проверить прямо в <mark className="plugin">Bodymovin</mark> на вкладке{" "}
              <mark className="select">«Support Features»</mark>. Если какой-то эффект или
              действие не поддерживается, в итоговой композиции могут отсутствовать
              некоторые объекты, слои или анимация.
            </li>
            <li>
              Для корректной работы расширения нужно установить флажок{" "}
              <mark className="select">
                «Allow Scripts to Write Files and Access Network»
              </mark>{" "}
              в{" "}
              <mark className="select">
                «Edit» → «Preferences» → «Scripting & Expressions»
              </mark>
              .
            </li>
          </ul>
        </Addition>
        <p>
          Для экспорта векторной анимации в <mark className="file">JSON</mark> откройте
          вкладку <mark className="select">«Compositions»</mark> в расширении{" "}
          <mark className="plugin">Bodymovin</mark>, выделите нужную композицию, укажите
          путь для сохранения и нажмите <mark className="select">«Export»</mark>. Если при
          экспорте что-то пойдёт не так, расширение сообщит об этом.
        </p>
        <ArticleMedia
          caption="Bodymovin"
          src="legacy/aftereffects/bodymovin_export_window.png"
          type="image"
        />
        <Addition type="info">
          Полученную анимацию можно посмотреть на вкладке{" "}
          <mark className="select">«Preview»</mark> в самом расширении или в{" "}
          <a href="https://www.svgsprite.com/tools/lottie-player/">Lottie Player</a>.
        </Addition>
        <p>
          После успешного экспорта анимации в <mark className="file">JSON</mark> поместите
          файл в конвертер ниже и нажмите{" "}
          <mark className="select">«Скачать преобразованный TGS»</mark>.
        </p>
        <Divider>Конвертер JSON в TGS</Divider>
        <JsonToTgsConverter />
        <p>
          После конвертации перейдите в{" "}
          <a href="https://t.me/Stickers">бот для создания стикеров</a> и создайте
          анимированные стикеры или эмодзи с помощью команд{" "}
          <mark className="code">/newanimated</mark> или{" "}
          <mark className="code">/newemojipack</mark>. Если что-то пойдёт не так, бот
          сообщит о проблеме с вашим файлом. Чаще всего ошибки возникают из-за слишком
          большого размера файла или неподдерживаемой анимации.
        </p>
        <Divider>Экспортируем видеостикер</Divider>
        <p>
          Видеостикер — это, по сути, короткий видеоролик в формате{" "}
          <mark className="video">WEBM</mark> с кодеком <mark className="video">VP9</mark>
          . Требования <mark className="app">Telegram</mark> к этому формату следующие:
        </p>
        <ul>
          <li>
            Для обоих типов требуется экспортировать видео в формате{" "}
            <mark className="video">WEBM</mark> с кодеком{" "}
            <mark className="video">VP9</mark>. На этой странице уже обсуждался{" "}
            <a href="#export-web">экспорт в VP9</a> из{" "}
            <mark className="app">Adobe After Effects</mark> с помощью конвертации
            полученного видео.
          </li>
          <li>
            Для{" "}
            <b>
              <u>видеостикеров</u>
            </b>{" "}
            максимальное разрешение — не более <mark>512</mark> на <mark>512</mark>{" "}
            пикселей.
          </li>
          <li>
            Для{" "}
            <b>
              <u>видеосмайликов</u>
            </b>{" "}
            или{" "}
            <b>
              <u>видеоэмодзи</u>
            </b>{" "}
            разрешение должно быть строго <mark>100</mark> на <mark>100</mark> пикселей.
          </li>
          <li>
            Длительность видео не должна превышать <mark>3</mark> секунд, а размер файла —{" "}
            <mark>256</mark> килобайт.
          </li>
          <li>
            Частота кадров не должна превышать <mark>30</mark> в секунду.{" "}
            <i style={{opacity: 0.5}}>Странно, что не 60...</i>
          </li>
        </ul>
        <p>
          После конвертации перейдите в{" "}
          <a href="https://t.me/Stickers">бот для создания стикеров</a> и создайте
          видеостикеры с помощью команд <mark className="code">/newvideo</mark> или{" "}
          <mark className="code">/newemojipack</mark>. Если что-то пойдёт не так, бот
          сообщит о проблеме с вашим файлом.
        </p>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-mogrt"
        tag="анимационный шаблон для premiere pro"
        title="Как сохранить проект в формате MOGRT?"
      >
        <p>
          В <mark className="app">Adobe After Effects</mark> можно создать анимированный
          шаблон формата <mark className="file">MOGRT</mark> из вашей композиции для
          последующего использования в <mark className="app">Adobe Premiere</mark>.
        </p>
        <p>
          Для этого в окне <mark className="select">«Essential Graphics»</mark> нужно
          нажать на кнопку{" "}
          <mark className="select">«Export Motion Graphics Template»</mark>.
        </p>
        <Addition type="warning">
          Экспортировать шаблон не получится, если вы не добавили в панель{" "}
          <mark className="select">«Essential Graphics»</mark> хотя бы одно свойство или
          контроллер.
        </Addition>
        <ArticleMedia
          caption="Essential Graphics"
          src="legacy/aftereffects/export_motion_graphics_template.png"
          type="image"
        />
        <Addition type="info">
          <p>
            Файл <mark className="file">MOGRT</mark> — это, по сути, архив, в котором
            хранятся несколько файлов, формирующих шаблон.
          </p>
          <ul>
            <li>
              <mark className="file">DEFINITION.JSON</mark> — файл с технической
              информацией о контроллерах и свойствах шаблона.
            </li>
            <li>
              <mark className="file">PROJECT.AEGRAPHICS</mark> — файл проекта After
              Effects со всей анимацией.
            </li>
            <li>
              <mark className="file">THUMB.JPG</mark> — обложка для предпросмотра шаблона
              в <mark className="app">Adobe Premiere</mark>.
            </li>
          </ul>
        </Addition>
        <p>
          После нажатия на кнопку экспорта измените{" "}
          <mark className="select">«Destination»</mark> на{" "}
          <mark className="select">«Local Drive»</mark> и с помощью кнопки{" "}
          <mark className="select">«Browse»</mark> укажите путь для сохранения. В разделе{" "}
          <mark className="select">«Compatibility»</mark> можно указать, потребуется ли
          для работы шаблона в <mark className="app">Adobe Premiere</mark> установленный{" "}
          <mark className="app">Adobe After Effects</mark>.
        </p>
        <ArticleMedia
          caption="Export as Motion Graphics Template"
          src="legacy/aftereffects/export_as_motion_graphics_template.png"
          type="image"
        />
        <Addition type="danger">
          <p>
            Не все эффекты будут поддерживаться в{" "}
            <mark className="app">Adobe Premiere</mark>, если на компьютере не установлен{" "}
            <mark className="app">Adobe After Effects</mark>. Для корректной работы
            шаблона без <mark className="app">Adobe After Effects</mark> должны быть
            соблюдены следующие условия.
          </p>
          <ul>
            <li>
              Поддерживаются все стандартные эффекты, кроме{" "}
              <mark className="plugin">Camera-Shake Deblur</mark>,{" "}
              <mark className="plugin">Maxon Cineware</mark>,{" "}
              <mark className="plugin">Warp Stabilizer</mark> и{" "}
              <mark className="plugin">Puppet</mark>.
            </li>
            <li>Сторонние плагины, очевидно, не поддерживаются.</li>
            <li>
              При использовании 3D-слоёв поддерживается только рендер{" "}
              <mark className="plugin">Classic 3D</mark>.
            </li>
            <li>
              Некоторые видеоформаты и футажи, связанные через{" "}
              <mark className="plugin">Dynamic Link</mark>, могут не работать.
            </li>
          </ul>
        </Addition>
        <p>
          После экспорта вы можете импортировать <mark className="file">MOGRT</mark> в
          окно <mark className="select">«Graphic Templates»</mark> в{" "}
          <mark className="app">Adobe Premiere</mark> и перетащить его на таймлайн.
        </p>
        <ArticleMedia
          src="tHDnFgW9NpQ"
          type="youtube"
        />
      </DetailsSummary>
      <DetailsSummary
        anchor="proxy-comp"
        tag="proxy, ускорение рендера, уменьшение перепросчёта, пререндер, быстрый повторный экспорт"
        title="Как создать прокси для композиции?"
      >
        <p>
          В <mark className="app">Adobe After Effects</mark> можно создавать прокси-файлы
          для композиций, чтобы не пересчитывать «тяжёлые» сцены при каждом изменении. Эта
          функция может оказаться полезной, если вы не планируете больше редактировать
          содержимое этой композиции или если сталкиваетесь с проблемами при финальном
          экспорте.
        </p>
        <Divider>Создаём прокси</Divider>
        <p>
          Чтобы создать прокси, в окне <mark className="select">«Project»</mark> найдите
          нужную композицию, нажмите на неё <mark className="key">ПКМ</mark> и выберите{" "}
          <mark className="select">«Create Proxy» → «Movie»</mark>. Программа отправит
          композицию в очередь рендеринга.
        </p>
        <Addition type="info">
          Таким же способом можно создать прокси и для видеофайлов, импортированных в
          проект.
        </Addition>
        <p>
          В очереди рендеринга для параметра{" "}
          <mark className="select">«Render Settings»</mark> установите значение{" "}
          <mark className="select">«Best Settings»</mark>, чтобы прокси рендерился в
          полном разрешении. В <mark className="select">«Output Module»</mark> выберите
          монтажный кодек, например <mark className="video">Apple ProRes 422</mark>. Если
          композиция содержит альфа-канал, используйте{" "}
          <mark className="video">Apple ProRes 4444</mark>.
        </p>
        <ArticleMedia
          caption="Создание прокси для композиции"
          src="legacy/aftereffects/create_comp_proxy.mp4"
          type="video"
        />
        <Addition type="info">
          <ul>
            <li>
              Если прокси после рендеринга не применился автоматически, назначьте его
              вручную: <mark className="key">ПКМ</mark> по композиции в окне{" "}
              <mark className="select">«Project»</mark> →{" "}
              <mark className="select">«Set Proxy» → «File»</mark> и укажите путь к
              отрендеренному файлу.
            </li>
            <li>
              Чтобы каждый раз не выбирать <mark className="select">«Best Settings»</mark>
              , можно назначить этот шаблон по умолчанию в{" "}
              <mark className="select">«Edit» → «Templates» → «Render Settings»</mark>, в
              параметре <mark className="select">«Movie Proxy Default»</mark>. Аналогично
              можно настроить и шаблон для <mark className="select">«Output Module»</mark>
              .
            </li>
          </ul>
        </Addition>
        <Divider>Используем прокси при финальном экспорте</Divider>
        <p>
          Если вы хотите, чтобы при финальном рендеринге использовался созданный
          прокси-файл вместо повторного просчёта исходной композиции, установите значение{" "}
          <mark className="select">«Use All Proxies»</mark> для параметра{" "}
          <mark className="select">«Proxy Use»</mark> в окне{" "}
          <mark className="select">«Render Settings»</mark>.
        </p>
        <Addition type="info">
          Эту настройку также можно сохранить в шаблон, отредактировав пресет{" "}
          <mark className="select">«Best Settings»</mark> или создав свой собственный.
        </Addition>
        <ArticleMedia
          caption="Настройка использования прокси в финальном рендеринге"
          src="legacy/aftereffects/use_all_proxies.mp4"
          type="video"
        />
        <Divider>Как отключить прокси?</Divider>
        <p>
          Чтобы временно отключить прокси, нажмите на иконку квадрата слева от названия
          композиции в окне <mark className="select">«Project»</mark>. Чтобы полностью
          отвязать прокси-файл от объекта, нажмите <mark className="key">ПКМ</mark> по
          композиции и выберите <mark className="select">«Set Proxy» → «None»</mark>.
        </p>
        <ArticleMedia
          caption="Переключение состояния прокси"
          src="legacy/aftereffects/toggle_disable_proxy.mp4"
          type="video"
        />
      </DetailsSummary>
      <DetailsSummary
        anchor="export-still"
        tag="кадр, изображение, скриншот, jpg, png, psd, превью, still"
        title="Как экспортировать текущий кадр как изображение?"
      >
        <p>
          Иногда нужно сохранить один кадр из композиции как файл изображения, например
          для создания превью. Это можно сделать двумя способами.
        </p>
        <Divider>Экспортируем через «Render Queue»</Divider>
        <p>
          Чтобы быстро отправить текущий кадр в очередь рендеринга, нажмите{" "}
          <mark className="key">Ctrl + Alt + S</mark> или перейдите в меню{" "}
          <mark className="select">«Composition» → «Save Frame As» → «File»</mark>.
        </p>
        <p>
          После этого откроется <mark className="select">«Render Queue»</mark>, где по
          умолчанию будет предложен экспорт в формат <mark className="image">PSD</mark>.
          Формат изображения можно изменить в настройках{" "}
          <mark className="select">«Output Module»</mark>. Чтобы запустить экспорт,
          нажмите кнопку <mark className="select">«Render»</mark> в правом верхнем углу
          или клавишу <mark className="key">Enter</mark>.
        </p>
        <ArticleMedia
          caption="Render Queue"
          src="legacy/aftereffects/export_one_frame_render_queue.png"
          type="image"
        />
        <Addition type="info">
          <ul>
            <li>
              Вы можете создать собственный шаблон для экспорта кадров, чтобы не менять
              формат файла каждый раз вручную.
            </li>
            <li>
              Некоторые пользователи ошибочно считают, что кнопка{" "}
              <mark className="select">«Take Snapshot»</mark> (иконка фотоаппарата в окне
              предпросмотра) сохраняет кадр в файл. На самом деле она сохраняет его только
              во временную память программы для сравнения с другими кадрами.
            </li>
          </ul>
        </Addition>
        <Divider>Экспортируем с помощью FX Console</Divider>
        <p>
          Если стандартный способ сохранения кадра через{" "}
          <mark className="select">«Save Frame As»</mark> кажется вам неудобным, есть
          альтернатива — плагин <mark className="plugin">FX Console</mark>, который можно
          загрузить{" "}
          <a href="https://www.videocopilot.net/blog/?s=fx%20console">по этой ссылке</a>.
        </p>
        <p>
          После установки плагин нужно настроить для сохранения изображений в высоком
          качестве. Для этого вызовите его панель сочетанием клавиш{" "}
          <mark className="key">Ctrl + Space</mark>, нажмите на иконку шестерёнки и в
          открывшихся настройках активируйте опцию{" "}
          <mark className="select">«Full Resolution Screenshots»</mark>. Она позволяет
          делать снимки в полном разрешении независимо от выбранного качества
          предпросмотра.
        </p>
        <ArticleMedia
          caption="FX Console"
          src="legacy/aftereffects/fx_console_full_resolution_screenshots.png"
          type="image"
        />
        <p>
          Теперь, чтобы быстро сохранить кадр, достаточно вызвать окно плагина с помощью{" "}
          <mark className="key">Ctrl + Space</mark> и нажать на иконку фотоаппарата.{" "}
          <mark className="plugin">FX Console</mark> предложит три варианта: сохранить
          изображение в формате <mark className="image">JPG</mark>,{" "}
          <mark className="image">PNG</mark> или скопировать его в буфер обмена.
        </p>
        <ArticleMedia
          caption="FX Console"
          src="legacy/aftereffects/fx_console_save_frame_as.png"
          type="image"
        />
        <p>
          При нажатии на <mark className="select">«Save to JPG»</mark> или{" "}
          <mark className="select">«Save to PNG»</mark> появится системное окно для выбора
          пути сохранения файла. После этого текущий кадр композиции будет сохранён как
          отдельное изображение.
        </p>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-sequence"
        tag="вывести секвенцию фото, jpg, png, psd"
        title="Как экспортировать все кадры композиции как отдельные изображения?"
      >
        <ul>
          <li>
            Добавьте композицию в очередь рендеринга с помощью комбинации клавиш{" "}
            <mark className="key">Ctrl + M</mark> или через меню{" "}
            <mark className="select">«File» → «Export» → «Add to Render Queue»</mark>.
          </li>
          <li>
            В очереди рендеринга нажмите на название пресета рядом с{" "}
            <mark className="select">«Output Module»</mark>, чтобы открыть его настройки.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/render_queue.png"
              type="image"
            />
          </li>
          <li>
            В параметре <mark className="select">«Format»</mark> выберите формат с
            припиской <mark>Sequence</mark> в названии, например{" "}
            <mark className="select">«PNG Sequence»</mark> или{" "}
            <mark className="select">«JPG Sequence»</mark>. В разделе{" "}
            <mark className="select">«Format Options»</mark> можно настроить параметры
            изображения, например качество или сжатие.
            <Addition type="info">
              Если вы хотите экспортировать кадры с прозрачностью, не забудьте установить
              для параметра <mark className="select">«Channels»</mark> значение{" "}
              <mark className="select">«RGB + Alpha»</mark>.
            </Addition>
            <ArticleMedia
              caption="Output Module Settings"
              src="legacy/aftereffects/selecting_png_sequence.png"
              type="image"
            />
          </li>
          <li>
            Укажите путь и имя файла в <mark className="select">«Output To»</mark>, а
            затем запустите экспорт кнопкой <mark className="select">«Render»</mark> или
            клавишей <mark className="key">Enter</mark>.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/start_render_button.png"
              type="image"
            />
            <Addition type="info">
              При экспорте секвенции <mark className="app">Adobe After Effects</mark> по
              умолчанию создаёт отдельную подпапку для изображений. Это поведение можно
              отключить, убрав флажок <mark className="select">«Save in subfolder»</mark>{" "}
              при выборе пути сохранения.
            </Addition>
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-only-work-area"
        tag="рабочая область, настройки рендера, длина композиции, таймлайн"
        title="Как экспортировать всю длину композиции или только её часть?"
      >
        <p>
          По умолчанию <mark className="app">Adobe After Effects</mark> рендерит только
          выделенную рабочую область. Её начало и конец задаются клавишами{" "}
          <mark className="key">B</mark> и <mark className="key">N</mark> или
          перетаскиванием соответствующих маркеров на таймлайне.
        </p>
        <Divider>А как тогда экспортировать всю композицию целиком?</Divider>
        <p>
          Если вы хотите, чтобы композиция всегда экспортировалась целиком, независимо от
          заданной рабочей области, нужно изменить один параметр в{" "}
          <mark className="select">«Render Settings»</mark>. Удобнее всего создать для
          этого отдельный шаблон.
        </p>
        <ul>
          <li>
            Добавьте композицию в очередь рендеринга с помощью комбинации клавиш{" "}
            <mark className="key">Ctrl + M</mark> или через меню{" "}
            <mark className="select">«File» → «Export» → «Add to Render Queue»</mark>.
          </li>
          <li>
            Нажмите на стрелку рядом с <mark className="select">«Render Settings»</mark> и
            выберите <mark className="select">«Make Template»</mark>.
            <ArticleMedia
              caption="Render Queue"
              src="legacy/aftereffects/make_template_render_settings.png"
              type="image"
            />
          </li>
          <li>
            В открывшемся окне появится пресет <mark>Untitled</mark>, который можно
            переименовать. Чтобы сделать его шаблоном по умолчанию, выберите его в разделе{" "}
            <mark className="select">«Defaults»</mark>. Для редактирования шаблона нажмите{" "}
            <mark className="select">«Edit»</mark>.
            <ArticleMedia
              caption="Render Settings Templates"
              src="legacy/aftereffects/render_settings_templates.png"
              type="image"
            />
            <Addition type="info">
              Окно управления шаблонами также открывается через{" "}
              <mark className="select">«Edit» → «Templates» → «Render Settings»</mark>.
            </Addition>
          </li>
          <li>
            В открывшемся окне <mark className="select">«Render Settings»</mark> для
            параметра <mark className="select">«Time Span»</mark> установите значение{" "}
            <mark className="select">«Length of Comp»</mark> (длина всей композиции)
            вместо <mark className="select">«Work Area Only»</mark> (только рабочая
            область).
            <ArticleMedia
              caption="Render Settings"
              src="legacy/aftereffects/change_render_time_span.png"
              type="image"
            />
          </li>
          <li>Закройте все окна и проверьте работу нового шаблона.</li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-with-layer-controls"
        tag="границы слоёв, пути движения, направляющие, демонстрация анимации"
        title="Как экспортировать видео с отображением границ слоёв и путей движения?"
      >
        <p>
          Для экспорта композиции с наложенными направляющими, границами слоёв и путями
          анимации можно воспользоваться сторонним плагином{" "}
          <mark className="plugin">Cyclops</mark>. Он позволяет отрендерить видео со всеми
          этими визуальными элементами, что упрощает демонстрацию и анализ вашей работы.
        </p>
        <ArticleMedia
          src="vNH3d9YqLo4"
          type="youtube"
        />
      </DetailsSummary>
      <DetailsSummary
        anchor="collect-files"
        tag="сбор проекта, collect files"
        title="Как передать проект со всеми исходниками другому человеку?"
      >
        <p>
          В <mark className="app">Adobe After Effects</mark> есть функция сбора проекта,
          которая сохраняет в отдельную папку сам файл проекта{" "}
          <mark className="file">AEP</mark> и все используемые в нём исходники (видео,
          аудио, изображения). Это гарантирует, что при переносе проекта на другой
          компьютер или передаче другому человеку ничего не потеряется.
        </p>
        <Addition type="warning">
          Эта функция не собирает файлы плагинов, пресетов и шрифтов. Предупредите
          человека, которому передаёте проект, о необходимости установить их отдельно.
          Информация об используемых шрифтах, эффектах и исходниках будет сохранена в
          текстовый файл отчёта рядом с файлом проекта.
        </Addition>
        <ul>
          <li>
            Чтобы запустить сбор, перейдите в{" "}
            <mark className="select">«File» → «Dependencies» → «Collect Files»</mark>.
            Если проект не сохранён, программа предложит это сделать.
            <ArticleMedia
              caption="Открываем окно сборщика проекта"
              src="legacy/aftereffects/select_collect_files.png"
              type="image"
            />
          </li>
          <li>
            Появится окно, где в параметре{" "}
            <mark className="select">«Collect Source Files»</mark> можно выбрать, что
            именно собирать: <mark className="select">«All»</mark> — все файлы из проекта
            или <mark className="select">«For All Comps»</mark> — только те, что
            используются в композициях. Второй вариант поможет уменьшить размер архива.
            <ArticleMedia
              caption="Окно «Collect Files»"
              src="legacy/aftereffects/collect_files_settings.png"
              type="image"
            />
          </li>
          <li>
            После нажатия на кнопку <mark className="select">«Collect»</mark> программа
            предложит указать, куда сохранить папку с проектом.
          </li>
          <li>
            <ContentFilter
              macContent={
                <div>
                  <p>
                    После завершения сбора перейдите в папку с проектом и создайте архив с
                    помощью утилиты вроде <a href="https://www.keka.io/ru/">Keka</a>. Если
                    нужно отправить большой проект, а площадка для обмена файлами имеет
                    ограничения на размер, вы можете разделить архив на части. После
                    создания архива отправьте его любым удобным способом.
                  </p>
                  <div
                    style={{
                      alignItems: "center",
                      display: "grid",
                      gap: "10px",
                      gridTemplateColumns: "repeat(auto-fit, minmax(275px, 1fr))",
                    }}
                  >
                    <ArticleMedia
                      caption="Выбор формата архива"
                      src="https://github.com/aonez/Keka/raw/master/Wiki/Images/Animated/main-window-format.gif"
                      type="image"
                    />
                    <ArticleMedia
                      caption="Разделение архива на части"
                      src="https://github.com/aonez/Keka/raw/master/Wiki/Images/Animated/main-window-split.gif"
                      type="image"
                    />
                  </div>
                  <Addition type="info">
                    Подробнее о создании архивов через{" "}
                    <a href="https://www.keka.io/ru/">Keka</a> можно прочитать на{" "}
                    <a href="https://github.com/aonez/Keka/wiki/Compressing-with-Keka">
                      этой странице
                    </a>
                    .
                  </Addition>
                </div>
              }
              windowsContent={
                <div>
                  <p>
                    После завершения сбора перейдите в папку с проектом и создайте архив с
                    помощью архиватора, например{" "}
                    <a href="https://www.rarlab.com/download.htm">WinRAR</a> или{" "}
                    <a href="https://www.7-zip.org/">7-Zip</a>. Если площадка для обмена
                    файлами имеет ограничения на размер, вы можете разделить архив на
                    части и отправить его по кускам. После создания архива отправьте его
                    любым удобным способом.
                  </p>
                  <ArticleMedia
                    src="6KumGS0EyUQ"
                    type="youtube"
                  />
                </div>
              }
            />
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        anchor="save-ffx"
        tag="presets, ffx"
        title="Как создать свой пресет с эффектами и передать его другому человеку?"
      >
        <p>
          <mark className="word">Пресеты</mark> — это готовые наборы эффектов формата{" "}
          <mark className="file">FFX</mark> с заданными настройками. Их можно сохранять,
          применять к другим слоям и передавать другим пользователям.
        </p>
        <p>
          Чтобы создать пресет, примените и настройте нужные эффекты на любом слое,
          выделите их в окне <mark className="select">«Effect Controls»</mark>, перейдите
          на панель <mark className="select">«Effects & Presets»</mark>, нажмите на иконку
          меню и выберите <mark className="select">«Save Animation Preset»</mark>. В
          открывшемся окне останется указать название и путь для сохранения файла.
        </p>
        <ArticleMedia
          caption="Создание пресета анимации"
          src="legacy/aftereffects/save_animation_preset.mp4"
          type="video"
        />
        <p>
          Теперь вы можете поделиться сохранённым файлом <mark className="file">FFX</mark>{" "}
          с другими пользователями. Получателю нужно будет импортировать его, следуя{" "}
          <a href="#how-to-install">инструкции по установке</a>. После этого пресет
          появится в папке <mark className="path">Animation Presets</mark> на панели{" "}
          <mark className="select">«Effects & Presets»</mark> и будет готов к применению.
        </p>
        <Addition type="warning">
          Прежде чем делиться пресетами, сообщите получателю, для какой версии{" "}
          <mark className="app">Adobe After Effects</mark> и для какого разрешения
          композиции они предназначены. Если используются сторонние эффекты, обязательно
          укажите их названия и точные версии для корректной работы.
        </Addition>
      </DetailsSummary>
      <DetailsSummary
        anchor="export-with-command-line"
        tag="командная строка, aerender, автоматизация, пакетный рендер, скриптинг, экспорт, очередь рендера"
        title="Как экспортировать композицию с помощью командной строки?"
      ></DetailsSummary>
      <DetailsSummary
        anchor="lottie-supported-effects"
        tag="лотти"
        title="Какие эффекты можно использовать при использовании Lottie?"
      >
        <p>
          <mark className="file">LOTTIE</mark> не поддерживает все функции{" "}
          <mark className="app">Adobe After Effects</mark>, особенно сторонние плагины и
          сложные эффекты. На сайте <mark className="company">LottieFiles</mark> есть
          подробная{" "}
          <a href="https://lottiefiles.com/supported-features">таблица совместимости</a>,
          где показано, какие свойства и эффекты поддерживаются на разных платформах.
          Чтобы проверить свою анимацию, вы можете загрузить экспортированный файл{" "}
          <mark className="file">JSON</mark> в{" "}
          <a href="https://app.lottiefiles.com/preview">
            инструмент предпросмотра от Lottie
          </a>{" "}
          или <a href="https://www.svgsprite.com/tools/lottie-player/">Lottie Player</a>.
        </p>
      </DetailsSummary>
    </div>
  );
};

export default AeExport;
