import {Divider} from "antd";

import React from "react";

import Addition from "../../../components/Addition";

import {ContentFigure} from "../../../components/ContentFigure";

import DetailsSummary from "../../../components/DetailsSummary";

import ContentFilter from "../../../components/features/ContentFilter";

const AEPerformance: React.FC = () => {
  return (
    <div className="faq-content">
      <DetailsSummary
        tag="pc, железо, выбор пк, сборка, системные требования, hardware recommendations"
        title="Какой компьютер или ноутбук нужен для работы в программе?"
      >
        <p>
          Иногда мощности текущего устройства оказывается недостаточно для комфортной
          работы в <mark className="app">Adobe After Effects</mark>. В таких случаях
          возникает логичный вопрос — какое устройство подойдёт лучше всего, чтобы
          работать с композициями без особых проблем?
        </p>
        <Addition type="danger">
          <ul>
            <li>
              В статье приведены лишь общие советы по подбору «железа» для работы в
              творческих программах. Это не руководство к покупке конкретного устройства.
              Окончательное решение остаётся за вами. Если сомневаетесь — спросите совета
              у специалистов или в технических чатах, ссылки на которые есть на{" "}
              <a href="/">главной странице сайта</a>.
            </li>
            <li>
              Тема выбора блоков питания, накопителей, мониторов и другой периферии в этой
              статье не затрагивается.
            </li>
          </ul>
        </Addition>
        <Addition type="info">
          Системные требования для <mark className="app">Adobe After Effects</mark> вы
          можете найти на{" "}
          <a href="https://helpx.adobe.com/after-effects/system-requirements.html">
            официальном сайте Adobe
          </a>
          .
        </Addition>
        <p>
          Прежде чем искать или приобретать новое устройство, определитесь с вашими
          задачами, подумайте, что вам больше подходит — ноутбук<sup>1</sup> или
          стационарный ПК, и выберите удобную для себя операционную систему. Версии{" "}
          <mark className="app">Adobe After Effects</mark> для <mark>Windows</mark> и{" "}
          <mark>macOS</mark> практически не отличаются по функциональности, поэтому
          проекты, созданные в версии для <mark>Windows</mark>, можно спокойно открыть на{" "}
          <mark>macOS</mark>. Однако на <mark>Windows</mark> обычно проще найти «народные»
          версии плагинов и дополнительных инструментов, чем на <mark>macOS</mark>.
        </p>
        <Addition type="info">
          <sup>1</sup> При выборе ноутбука обращайте внимание на диагональ дисплея:
          работать в <mark className="app">Adobe After Effects</mark> на 16 дюймах и
          больше заметно удобнее, чем на 14 и меньше.{" "}
          <i style={{opacity: "0.5"}}>
            Однако большие ноутбуки не всегда удобно носить с собой.
          </i>
        </Addition>
        <p>
          Для быстрой работы в <mark className="app">Adobe After Effects</mark> важно
          обратить внимание на три с половиной ключевых компонента устройства — мощный
          процессор, достаточный объём оперативной памяти и быстрый накопитель. Оставшаяся
          половинка — видеокарта: она также влияет на производительность, но не всегда.{" "}
          <i style={{opacity: "0.5"}}>
            О ней ещё поговорим в отдельной статье про производительность программы.
          </i>
        </p>
        <Divider>Рекомендации по комплектующим для стационарного ПК на Windows</Divider>
        <ul>
          <li>
            Для начала стоит определиться с вашими предпочтениями в мире процессоров —{" "}
            <mark>Intel Core</mark> или <mark>AMD Ryzen</mark>. Существенной разницы между
            ними нет: оба «лагеря» подходят для работы в{" "}
            <mark className="app">Adobe After Effects</mark>. Но важно помнить: процессор
            является ключевым комплектующим в сборке для{" "}
            <mark className="app">Adobe After Effects</mark>, поэтому выбирайте не самый
            «овощной» вариант. Чем он мощнее, тем быстрее будет рендериться кадры в
            программе.
            <ul>
              <li>
                <p>
                  Процессоры от <mark className="company">Intel</mark> лучше подходят для
                  работы с видеоисходниками в кодеках <mark className="video">H.264</mark>{" "}
                  и <mark className="video">H.265</mark> за счёт встроенного видеоядра,
                  которое отвечает за декодирование. Если вы собираете новый стационарный
                  ПК — лучше собрать на актуальных сокетах <mark>LGA 1700</mark> или{" "}
                  <mark>LGA 1851</mark>.
                </p>
                <p>
                  В качестве бюджетного варианта можно выбрать{" "}
                  <mark className="copy">Intel Core i5-13600K</mark> или{" "}
                  <mark className="copy">Intel Core i5-14600K</mark>. В качестве
                  оптимального варианта подойдёт{" "}
                  <mark className="copy">Intel Core Ultra 265K</mark> или{" "}
                  <mark className="copy">Intel Core i7-14700K</mark>.
                </p>
                <Addition type="warning">
                  <ul>
                    <li>
                      Процессоры <mark>Intel Core</mark> 13-го и 14-го поколений известны
                      низкой долговечностью в ранних версиях процессоров. Это связано с
                      повышенным рабочим напряжением, которое процессор сам запрашивает,
                      что может приводить к быстрому износу и даже деградации до
                      неработоспособного состояния. <mark className="company">Intel</mark>{" "}
                      выпустила несколько обновлений прошивок для производителей
                      материнских плат и утверждает, что проблема с деградацией
                      исправлена.
                    </li>
                    <li>
                      Не рекомендуется брать процессоры{" "}
                      <mark className="company">Intel</mark> без встроенного видеоядра, с
                      суффиксом <mark>F</mark> или <mark>KF</mark>, даже если кто-то
                      убеждает обратное.
                      <a href="https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D1%80%D0%BA%D0%B8%D1%80%D0%BE%D0%B2%D0%BA%D0%B0_%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D1%80%D0%BE%D0%B2_%D1%84%D0%B8%D1%80%D0%BC%D1%8B_Intel">
                        Подробнее о маркировке процессоров Intel...
                      </a>
                    </li>
                  </ul>
                </Addition>
              </li>
              <li>
                <p>
                  Процессоры от <mark className="company">AMD</mark> тоже хороши за счёт
                  отличного соотношения цены и производительности по ядрам, если вы
                  создаёте композиции с нуля без частого использования видеоисходников. На
                  сегодняшний день платформа <mark>AM4</mark> уже неактуальна, поэтому,
                  если вы собираете новый системный блок на{" "}
                  <mark className="company">AMD</mark> — собирайте сразу на платформе{" "}
                  <mark>AM5</mark>.
                </p>
                <p>
                  В качестве бюджетного варианта можно взять практически любой процессор с
                  6 ядрами или больше, например{" "}
                  <mark className="copy">AMD Ryzen 7500F</mark> или{" "}
                  <mark className="copy">AMD Ryzen 7 7700</mark>. Оптимальным выбором
                  будет <mark className="copy">AMD Ryzen 9 7900X</mark> или мощнее.
                </p>
              </li>
            </ul>
          </li>
          <li>
            Поговорим и про оперативную память. Многие пользователи{" "}
            <mark className="app">Adobe After Effects</mark> знают, что программа любит
            потреблять много оперативной памяти, поэтому для комфортной работы потребуется
            как минимум <mark>32 ГБ</mark> оперативной памяти типа <mark>DDR5</mark>, а
            ещё лучше — <mark>64 ГБ</mark> или больше.
            <Addition type="info">
              Рекомендуется <a href="#6.5">настроить файл подкачки</a>, даже если у вас
              установлено достаточно много оперативной памяти. Это позволит вам реже
              видеть ошибки о его нехватке, например{" "}
              <mark className="warning">«Out of Memory»</mark>.
            </Addition>
          </li>
          <li>
            Что касается видеокарты, <mark className="app">Adobe After Effects</mark>{" "}
            может задействовать его не во всех сценариях, даже если везде включено
            аппаратное ускорение. А вот выбор ускорителя уже зависит от вашего бюджета:
            для старта подойдёт <mark className="copy">NVIDIA RTX 4060 Ti</mark> или{" "}
            <mark className="copy">NVIDIA RTX 5060 Ti</mark> с <mark>16 ГБ</mark>{" "}
            видеопамяти или, если средств совсем мало —{" "}
            <mark className="copy">NVIDIA RTX 3060</mark> с <mark>12 ГБ</mark>. На момент
            написания статьи оптимальным вариантом по соотношению
            «цена–производительность» для работы в программах, требующие видеокарту, можно
            считать <mark className="copy">NVIDIA RTX 5070 Ti</mark>.
            <Addition type="danger">
              <p>
                Видеокарты от <mark className="company">AMD</mark> не лучший вариант для
                серьёзной работы в <mark className="company">Adobe</mark> и других
                творческих программах. Поддержка у них слабее, и многие эффекты с
                поддержкой аппаратного ускорения могут работать нестабильно.
              </p>
              <p>
                В последние годы разработчики начали адаптировать свои эффекты под{" "}
                <mark className="company">AMD</mark> — например,{" "}
                <mark className="company">Boris FX</mark> с пакетом{" "}
                <mark className="plugin">Sapphire</mark>. Но общее положение всё ещё в
                пользу <mark className="company">NVIDIA</mark>: под их видеокарты
                оптимизировано значительно больше плагинов.
              </p>
            </Addition>
          </li>
        </ul>
        <Divider>Рекомендации по ноутбукам на Windows</Divider>
        <ul>
          <li>
            Если у вас нет стационарного компьютера и вы не планируете его покупать, так
            как часто работаете с серьёзными проектами вне дома или много переезжаете, при
            этом располагаете солидным бюджетом — стоит обратить внимание на мощные
            портативные модели с дискретными видеокартами от{" "}
            <mark className="company">NVIDIA</mark>, например{" "}
            <mark className="copy">Lenovo ThinkBook 16p</mark>,{" "}
            <mark className="copy">ASUS Zephyrus</mark> или{" "}
            <mark className="copy">Honor MagicBook Pro 16</mark>.
            <Addition type="warning">
              <ul>
                <li>
                  Модели с дискретными видеокартами{" "}
                  <mark className="company">NVIDIA</mark> вроде{" "}
                  <mark className="copy">RTX 5060</mark> или{" "}
                  <mark className="copy">RTX 4050</mark> стоит выбирать с осторожностью: в
                  некоторых бюджетных ноутбуках процессор может быть слабым, а теплопакет
                  для комплектующих урезан, вследствие чего реальная мощность может
                  оказаться ниже потенциальной.
                </li>
                <li>
                  Производительные ноутбуки могут быть тяжелее и быстрее разряжаться, чем
                  среднебюджетные ультрабуки.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            Если у вас уже есть мощный стационарный компьютер, но иногда требуется внести
            правки «на ходу» или быстро собрать проект, а финальный рендер всё равно
            выполняется на основной машине, можно рассмотреть ноутбук без дискретной
            видеокарты. Для таких задач не обязательно покупать «игровую» модель.
            Подойдут, например, <mark className="copy">ASUS Vivobook Pro</mark> или{" "}
            <mark className="copy">Lenovo ThinkBook 16+</mark> в комплектации с{" "}
            <mark>32 ГБ</mark> оперативной памяти на <mark>AMD Ryzen</mark> или{" "}
            <mark>Intel Core</mark>
            <sup>1</sup>.
            <Addition type="warning">
              <ul>
                <li>
                  <sup>1</sup> Некоторые сторонние эффекты, например{" "}
                  <mark className="plugin">Element 3D</mark> или{" "}
                  <mark className="plugin">Dehancer Pro</mark> могут некорректно работать
                  на встроенных в процессор видеочипах <mark>Intel HD Graphics</mark> и{" "}
                  <mark>Intel Arc</mark> из-за отсутствия их поддержки со стороны
                  разработчиков этих эффектов. Встроенные видеочипы от{" "}
                  <mark className="company">AMD</mark> в плане поддержки некоторых
                  сторонних эффектов смотрится выигрышнее.
                </li>
                <li>
                  Если вам важна точность цветопередачи, внимательно изучайте
                  характеристики экрана. В бюджетных моделях матрицы могут показывать
                  ограниченный цветовой диапазон и не покрывать{" "}
                  <mark className="copy">100% sRGB</mark>. Также обратите внимание на
                  максимальную яркость: для комфортной работы в условиях яркого освещения
                  она должна быть не ниже <mark>400 кд/м²</mark>.
                </li>
                <li>
                  Не стоит брать ноутбуки на <mark>Windows</mark> с процессорами{" "}
                  <mark>Snapdragon X Elite</mark>, которых пока немного в продаже. Это
                  архитектура <mark>ARM</mark>, а не привычная <mark>X86-64</mark>, и
                  далеко не все творческие программы под неё адаптированы. Хоть и
                  существует прослойка <mark className="app">Windows Prism</mark>,
                  позволяющая запускать приложения для <mark>X86-64</mark> на{" "}
                  <mark>ARM</mark>, но стабильность и скорость через неё заметно уступают
                  нативной работе программ.
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <Divider>Рекомендации по устройствам на macOS</Divider>
        <ul>
          <li>
            Если вы хотите взять первый ноутбук от <mark>Apple</mark> или переехать с{" "}
            <mark>MacBook</mark> на базе <mark className="company">Intel</mark> —
            посмотрите в сторону <mark className="copy">MacBook Air</mark> на процессоре{" "}
            <mark>Apple M4</mark> или <mark className="copy">MacBook Pro</mark> на
            процессоре <mark>Apple M1 Pro</mark> или мощнее. В качестве комплектации стоит
            взять минимум <mark>16 ГБ</mark> оперативной и <mark>512 ГБ</mark> постоянной
            памяти.
            <Addition type="warning">
              <ul>
                <li>
                  Работа в <mark className="app">Adobe After Effects</mark> и подобных
                  программах с <mark>8 ГБ</mark> оперативной памяти будет тяжеловатой,
                  несмотря на то, что <mark>macOS</mark> старается эффективно распределять
                  память с помощью собственного кэша.
                </li>
                <li>
                  Современные <mark className="copy">MacBook Air</mark> не имеют
                  вентиляторов и охлаждаются лишь пассивным охлаждением, поэтому при
                  долгом рендере или при работе со сложными проектами ноутбук начнёт
                  сбрасывать мощность для того, чтобы не перегреться.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            Если вы нечасто путешествуете, хотите миниатюрный компьютер или ноутбуки{" "}
            <mark>MacBook</mark> оказались для вас слишком дорогими или бессмысленными —
            вам может подойти <mark className="copy">Mac Mini</mark> на процессоре{" "}
            <mark>Apple M4</mark> или мощнее или <mark className="copy">Mac Studio</mark>{" "}
            с <mark>Apple M1 Max</mark> или мощнее. Их стоит приобретать, если у вас уже
            имеется на рабочем столе хороший монитор, клавиатура и мышь. Из комплектации
            также рекомендуется брать минимум <mark>16–24 ГБ</mark> оперативной и{" "}
            <mark>512 ГБ</mark> постоянной памяти.
          </li>
        </ul>
        <Divider>Дополнительная информация для самостоятельных размышлений</Divider>
        <div className="flexible-links">
          <a href="https://www.pugetsystems.com/solutions/video-editing-workstations/adobe-after-effects/hardware-recommendations/">
            Рекомендации по железу от Puget Systems
          </a>
          <a href="https://helpx.adobe.com/premiere-pro/kb/hardware-recommendations.html">
            Рекомендации по оборудованию от Adobe
          </a>
          <a href="https://www.pugetsystems.com/labs/articles/what-h-264-and-h-265-hardware-decoding-is-supported-in-premiere-pro-2120/">
            Какое «железо» поддерживает аппаратное ускорение H.264 и H.265?
          </a>
        </div>
        <ContentFigure
          caption="Лучшее «железо» для моушн-дизайна"
          src="x0YNsn4TtGM"
          type="youtube"
        />
        <ContentFigure
          caption="Производительность Adobe After Effects: речь не о мощных компьютерах"
          src="sjxG4clyMEs"
          type="youtube"
        />
        <ContentFigure
          caption="Как выбрать ноутбук или ПК для After Effects?"
          src="wdXf4ngU4fM"
          type="youtube"
        />
        <ContentFigure
          caption="M4 Max / Pro против всех поколений - что взять в 2025?"
          src="bbcnEiu02uc"
          type="youtube"
        />
      </DetailsSummary>
      <DetailsSummary
        tag="версия программы для старых устройств"
        title="Какая версия программы считается самой стабильной и какую лучше установить?"
      >
        <p>
          Этот вопрос останется предметом вечных дебатов в чатах и на форумах по{" "}
          <mark className="app">Adobe After Effects</mark> без единого правильного ответа.
          Причина — в огромном разбросе мнений пользователей, которые работают с
          программой в разных сценариях, на разном «железе» и с различными сторонними
          плагинами, за стабильность которых <mark className="company">Adobe</mark>{" "}
          ответственности не несёт. У кого-то программа работает прекрасно, а у кого-то
          тормозит в простых действиях даже со всеми «оптимизациями» в настройках.
        </p>
        <p>
          Если вы надеетесь найти в этой статье «чудо-версию», которая будет «летать» на
          любом устройстве, то вынужден вас разочаровать — такой версии просто нет. Сам по
          себе выбор версии <mark className="app">Adobe After Effects</mark> почти не
          влияет на производительность. Устанавливая слишком старую версию вместо
          актуальной, вы лишаете себя новых функций, улучшений и исправлений багов,
          получая взамен ничтожное «преимущество» непонятно над чем, которое в реальной
          работе мало что даёт.
        </p>
        <Divider>Ссылки на патчноуты от Adobe</Divider>
        <p>
          К слову, список обновлений, нововведений и исправлений в последних версиях{" "}
          <mark className="app">Adobe After Effects</mark> вы всегда можете посмотреть на
          официальном сайте <mark className="company">Adobe</mark> для того, чтобы не
          спрашивать <mark className="quote">«А что нового появилось?»</mark> в чатах и на
          форумах.
        </p>
        <div className="flexible-links">
          <a href="https://helpx.adobe.com/after-effects/using/whats-new.html">
            Что нового в последних выпусках
          </a>
          <a href="https://helpx.adobe.com/after-effects/kb/fixed-issues.html">
            Список исправленных ошибок
          </a>
          <a href="https://helpx.adobe.com/after-effects/kb/known-issues-after-effects.html">
            Выявленные неполадки
          </a>
          <a href="https://helpx.adobe.com/after-effects/system-requirements.html">
            Системные требования для программы
          </a>
        </div>
        <Divider>Рекомендации по выбору версии</Divider>
        <ul>
          <li>
            Если вы нечасто работаете в программе, любите новые функции или стабильность
            работы для вас не в приоритете — попробуйте воспользоваться{" "}
            <a href="https://helpx.adobe.com/after-effects/using/whats-new.html">
              последней
            </a>{" "}
            версией <mark className="app">Adobe After Effects</mark>, особенно если вы
            хотите перейти с предыдущих версий.
          </li>
          <li>
            Если вам нужна более проверенная пользователями и относительно современная
            версия — попробуйте <mark>24.6</mark> (2024) или <mark>23.6</mark> (2023).
            <Addition type="info">
              Современное оборудование требует более свежей версии{" "}
              <mark className="app">Adobe After Effects</mark>. Если вы установите на
              новое устройство старую версию программы, вы можете столкнуться с проблемами
              аппаратного ускорения или непредвиденными сбоями.
            </Addition>
          </li>
          <li>
            Если процессор вашего устройства не поддерживает{" "}
            <a href="https://www.youtube.com/watch?v=1IAwkEdRZZw">инструкции AVX2</a> — вы
            можете установить версию <mark>23.6</mark> (2023) или <mark>24.0</mark>{" "}
            (2024).
            <Addition type="warning">
              Если вы попытаетесь обойти требования к установке версии <mark>24.1</mark>{" "}
              или новее на неподдерживаемом процессоре, скорее всего, вы столкнётесь с
              ошибкой <mark className="code">0xc0000142</mark> при запуске программы.
              Обойти это нельзя — придётся раскошелиться на новый процессор с поддержкой
              инструкций <mark>AVX2</mark>.
            </Addition>
          </li>
          <li>
            Если вы используете устройство на <mark>Windows 7</mark> или{" "}
            <mark>Windows 8.1</mark> — установите версию <mark>16.1</mark> (2019) или{" "}
            <mark>15.1</mark> (2018). Более свежую версию установить не получится из-за
            окончания официальной поддержки этих операционных систем компаниями{" "}
            <mark className="company">Adobe</mark> и <mark>Microsoft</mark>.
            <Addition type="danger">
              <ul>
                <li>
                  Если вы попытаетесь обойти требования к установке или запустить
                  программу на старой операционной системе, вероятность успешного запуска
                  крайне мала, так как, скорее всего, вы столкнётесь с различными
                  ошибками, которые решаются только установкой более свежей версии{" "}
                  <mark>Windows</mark>.
                </li>
                <li>
                  Если программа более свежей версии, чем <mark>16.1</mark>, всё же
                  запустилась на неподдерживаемой операционной системе — её стабильная
                  работа не гарантируется!
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <Divider>Как переехать с одной версии на другую?</Divider>
        <Addition type="danger">
          Не стоит спешить с обновлением программы, если вы на момент чтения этой статьи
          работаете над большим проектом. При установке новой версии{" "}
          <mark className="app">Adobe After Effects</mark> есть риск, что что-то сломается
          или начнёт работать иначе. Обновление лучше выполнять в том случае, когда у вас
          сроки для сдачи не «горят» или вы на данный момент не работаете над серьёзным
          проектом.
        </Addition>
        <p>
          При переходе с одной версии <mark className="app">Adobe After Effects</mark> на
          другую в пределах «одного года», например с <mark>24.1</mark> на{" "}
          <mark>24.6</mark> — переносить какие-то файлы и выполнять лишние телодвижения не
          нужно. Установщик в таком случае перезапишет старые файлы программы, не затронув
          пользовательские данные, в том числе установленные плагины, а при запуске
          обновлённой версии <mark className="app">Adobe After Effects</mark> вам
          предложат перенести настройки со старой версии в новую.
        </p>
        <p>
          Но если вы решили обновить программу, переходя на «другой год» например, с{" "}
          <mark>23.6</mark> на <mark>25.2</mark>, потребуется ручной перенос
          пользовательских файлов в новую версию, включая сторонние эффекты и пресеты. При
          установке версии «другого года» старая версия программы останется на вашем
          устройстве и не будет автоматически удалена.{" "}
          <a href="#2.24">Подробнее о переносе...</a>
        </p>
        <Addition type="info">
          Не забывайте своевременно обновлять сторонние плагины и поддерживать
          операционную систему в хорошем состоянии, периодически очищая её от мусора и
          устанавливая свежие драйвера на «железо». Устанавливая свежие версии{" "}
          <mark className="app">Adobe After Effects</mark>, но не обновляя различные
          дополнения для него, вы рискуете столкнуться с необъяснимыми проблемами.{" "}
          <i style={{opacity: "0.5"}}>
            Именно такие несостыковки часто становятся причиной путаницы в обсуждениях на
            форумах или в чатах, когда один говорит, что всё работает, а у другого — всё
            разваливается.
          </i>
        </Addition>
        <Divider>
          Проверяем миф о производительности, зависящей от версии программы
        </Divider>
        <p>
          Проверим самый популярный миф, который гласит, что старые версии{" "}
          <mark className="app">Adobe After Effects</mark> рендерят быстрее и работают
          стабильнее, чем новые. Что до стабильности — тут ещё можно поспорить, всё
          зависит от проекта. А вот с производительностью — я категорически не согласен,
          даже если меня пытаются с пеной у рта убедить меня в обратном.
        </p>
        <p>
          Чтобы это доказать, проведём эксперимент на виртуальной машине с «облегчённой»
          сборкой <mark>Windows 11 24H2</mark>. Выделим ей <mark>16 ГБ</mark> оперативной
          памяти и 8 ядер процессора <mark>Intel Core Ultra 7 255H</mark>
          <sup>1</sup> без аппаратного ускорения. Затем установим разные версии{" "}
          <mark className="app">Adobe After Effects</mark>, на которых и будем проверять
          скорость рендера: <mark>13.2</mark> (CC 2014), <mark>15.1.2</mark> (CC 2018),{" "}
          <mark>17.7</mark> (2020), <mark>23.6</mark> (2023) и <mark>25.4</mark> (2025).
        </p>
        <Addition type="info">
          <sup>1</sup> Не смотря на то, что это процессор для ноутбуков, для чистоты
          эксперимента на хост-системе были сняты все лимиты энергопотребления и включён
          режим максимальной производительности. Ноутбук работал от сети, а его система
          охлаждения — на полную мощность, без препятствий для потока воздуха. На
          виртуальной машине частота процессора составила стабильные <mark>3,69 ГГц</mark>{" "}
          без резких скачков и «троттлинга» во время тестов рендеринга, хотя хостовая
          система могла выдать и больше производительности. Но это наоборот сыграет на
          руку, чтобы результаты сильно не отличались друг от друга.
        </Addition>
        <p>
          Тестировать будем на{" "}
          <a href="https://aeplug.ru/forum/viewtopic.php?t=818">старом проекте</a> от{" "}
          <mark className="user">AEPlug</mark>, который одинаково хорошо подходит и для
          старых, и для новых версий. Его ключевая особенность — он почти не задействует
          аппаратное ускорение, нагружая в основном процессор и оперативную память. К тому
          же в нём — только стандартные эффекты. Поэтому, к сожалению, миф о
          производительности сторонних плагинов этим тестом мы не развеем.
        </p>
        <p>
          Для «честного» сравнения в первом раунде в версии <mark>13.2</mark> (CC 2014)
          отключим <mark className="select">«Multiprocessing»</mark>, а в{" "}
          <mark>23.6</mark> (2023) и <mark>25.4</mark> (2025) —{" "}
          <mark className="select">«Multi-Frame Rendering»</mark>. Также во всех версиях
          отключим дисковый кэш. В настройках каждой программы выделим <mark>12 ГБ</mark>{" "}
          оперативной памяти, а остальные параметры оставим по умолчанию.
        </p>
        <ContentFigure
          caption="Виртуальная машина"
          src="images/aftereffects/ae_version_test.png"
          theme="light"
          type="image"
          variant="windows"
        />
        <p>
          Почему эксперимент идёт не на реальном «железе»? Во-первых, мне просто влом
          потом вычищать основную систему от «хвостов». А во-вторых — так мы минимизируем
          расхождения в результатах из-за разницы в «железе», драйверах и поддержке тех
          или иных функций аппаратного ускорения. Экспортировать будем через{" "}
          <mark className="plugin">Quicktime</mark> в кодеке{" "}
          <mark className="video">GoPro Cineform</mark>.
        </p>
        <ul>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>13.2</mark> (CC 2014) —
            7 минут 33 секунды. С включённым{" "}
            <mark className="select">«Multiprocessing»</mark> — 6 минут 3 секунды.
            <ContentFigure
              caption="Время экспорта"
              src="images/aftereffects/render_time_cc2014.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>15.1.2</mark> (CC 2018)
            — 7 минут 27 секунд.
            <ContentFigure
              caption="Время экспорта"
              src="images/aftereffects/render_time_cc2018.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>17.7</mark> (2020) — 8
            минут 34 секунды.
            <ContentFigure
              caption="Время экспорта"
              src="images/aftereffects/render_time_2020.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>23.6</mark> (2023) — 8
            минут 15 секунд без <mark className="select">«Multi-Frame Rendering»</mark>.
            <ContentFigure
              caption="Время экспорта"
              src="images/aftereffects/render_time_2023.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>25.4</mark> (2025) — 8
            минут 18 секунд без <mark className="select">«Multi-Frame Rendering»</mark>.
            <ContentFigure
              caption="Время экспорта"
              src="images/aftereffects/render_time_2025.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
        </ul>
        <p>
          После долгих рендеров результат поразил: версии <mark>13.2</mark> и{" "}
          <mark>15.1.2</mark> действительно уделали более свежие. Казалось бы, всё, вопрос
          можно закрывать: старые версии реально быстрее, а автора нужно посадить на кол
          за то, что он ничего не понимает в производительности{" "}
          <mark className="app">Adobe After Effects</mark>. Но есть один нюанс: как я и
          говорил, первые тесты шли без мультикадрового рендера.
        </p>
        <p>
          Стоит почистить кэш, перезапустить программу, включить{" "}
          <mark className="select">«Multi-Frame Rendering»</mark> в версиях{" "}
          <mark>23.6</mark> и <mark>25.4</mark> и запустить экспорт заново, как результат
          снова поражает, но уже не в пользу старичков: 4 минуты 53 секунды и 3 минуты 49
          секунд соответственно. Версия <mark>13.2</mark> (CC 2014) даже с включенным{" "}
          <mark className="select">«Multiprocessing»</mark> и рядом не стояла со своими 6
          минутами и 3 секундами.
        </p>
        <p>
          И что удивительно, потребление оперативной памяти во всех версиях было примерно
          одинаковым и не выходило за пределы ограничения оперативной памяти в{" "}
          <mark>12 ГБ</mark>. Так что даже настроенный файл подкачки за кадром в этом
          тесте на скорость рендера особой роли не сыграл.
        </p>
        <p>
          Какой вывод можно сделать из этого «странного» теста? По-моему, все эти
          разговоры о том, что старые версии{" "}
          <mark className="app">Adobe After Effects</mark> рендерят композиции быстрее
          новых, — не более чем эффект плацебо. Впрочем, такие мнения имеют место быть, но
          лишь в одном случае: если ваше железо просто не соответствует системным
          требованиям свежих версий программы или морально устарело.
        </p>
      </DetailsSummary>
      <DetailsSummary
        tag="тормозит, ускорить работу, оптимизация, увеличить скорость рендера, лаги, медленно работает, низкая скорость, производительность, применение эффектов, системные требования, артефакты, искажения"
        title="Почему у меня, б%@#ь, лагает е&#!%й Adobe After Effects, с$%а?"
      >
        <p>
          Да, это тот самый риторический вопрос, который успел всем поднадоесть, но всё
          равно не даёт покоя некоторым пользователям, особенно новичкам.
          Производительность проекта в <mark className="app">Adobe After Effects</mark>{" "}
          чаще всего зависит от двух факторов — мощности устройства, на котором работает
          пользователь, и самого пользователя.
        </p>
        <p>
          Пользователь программы, как бы странно это ни звучало, часто сам становится
          причиной медленной работы проекта. При обсуждении подобных вопросов сложно найти
          грань, где всё упирается в «железо», а где — в завышенные ожидания, связанные с
          особенностями <mark className="app">Adobe After Effects</mark>.{" "}
          <i style={{opacity: "0.5"}}>
            Надеюсь, эта статья поможет вам вынести что-то полезное из советов по
            оптимизации программы и проекта.
          </i>
        </p>
        <Divider>Проверяем готовность устройства к комфортной работе</Divider>
        <ContentFilter
          macContent={
            <div>
              <p>
                Для начала, пожалуйста, проверьте ваше устройство на соответствие{" "}
                <a href="https://helpx.adobe.com/after-effects/system-requirements.html">
                  системным требованиям
                </a>{" "}
                для <mark className="app">Adobe After Effects</mark>. Для запуска
                программы подойдет относительно современный Mac, поддерживающий инструкции{" "}
                <mark>AVX2</mark>, современную версию <mark>macOS</mark> (от
                <mark>Monterey 12.0</mark> или новее) и любое количество оперативной
                памяти. А вот с системными требованиями для комфортной работы в{" "}
                <mark className="app">Adobe After Effects</mark> всё уже не так просто,
                поэтому забудьте о том, что я написал чуть ранее.
              </p>
              <p>{/* TODO: дописать под маки!!!! */}</p>
              {/* <p>
                Для комфортной работы в <mark className="app">Adobe After Effects</mark>{" "}
                на Mac рекомендуется использовать устройство с <mark>Apple Silicon</mark>{" "}
                - минимум <mark>M1</mark>, предпочтительно <mark>M1 Pro</mark> или мощнее.
                Конфигурации устройств с <mark>16 ГБ</mark> оперативной памяти
                или выше позволит реже встречаться с предупреждениями о нехватке
                оперативной памяти.
              </p> */}
              <Divider>Разбираемся с вашей операционной системой</Divider>
              <p>
                Даже если всё с проектом хорошо, а системные требования подходят под
                комфортную работу в <mark className="app">Adobe After Effects</mark> - в
                некоторых случаях программа может тормозить из-за хлама на устройстве. А
                всё потому что пользователи часто забывают про гигиену операционной
                системы и дискового пространства. Под гигиеной я подразумеваю то, что
                любое устройство со временем начинает медленее работать из-за забитого
                мусора во временных файлах и ненужных приложений в фоне.
              </p>
              {/* TODO: про захламленность, переполненность ссд и хдд мол некуда девать файлы, драйвера, очистку мусора и прочее */}
            </div>
          }
          windowsContent={
            <div>
              <p>
                Для начала, пожалуйста, проверьте ваше устройство на соответствие{" "}
                <a href="https://helpx.adobe.com/after-effects/system-requirements.html">
                  системным требованиям
                </a>{" "}
                для <mark className="app">Adobe After Effects</mark>. Для запуска
                программы подойдёт любой процессор, поддерживающий инструкции{" "}
                <mark>AVX2</mark>, любое количество оперативной памяти, любая современная
                видеокарта любого бренда, а также последние обновления{" "}
                <mark>
                  Windows 10<sup>1</sup>
                </mark>
                или <mark>Windows 11</mark>. А вот с{" "}
                <a href="https://www.pugetsystems.com/solutions/video-editing-workstations/adobe-after-effects/hardware-recommendations/">
                  системными требованиями для комфортной работы
                </a>{" "}
                в <mark className="app">Adobe After Effects</mark> всё уже не так просто,
                поэтому забудьте о том, что я написал чуть ранее.
              </p>
              <AdditionWarning>
                <ul>
                  <li>
                    <sup>1</sup> С ноября 2025 года основная поддержка{" "}
                    <mark>Windows 10</mark> версии <mark>22H2</mark> закончится. Скорее
                    всего, <mark className="app">Adobe After Effects</mark> версий{" "}
                    <mark>2026</mark> и новее на неё уже не встанут.{" "}
                    <i style={{opacity: 0.5}}>
                      Почему &quot;скорее всего&quot;? Потому что <mark>Adobe</mark>{" "}
                      прекратила выпуск новых версий{" "}
                      <mark className="app">Adobe After Effects</mark> под{" "}
                      <mark>Windows 7</mark> и <mark>Windows 8.1</mark> почти сразу после
                      того, как <mark>Microsoft</mark> закончила их официальную поддержку.
                      Такая судьба может произойти и с <mark>Windows 10</mark>.
                    </i>
                  </li>
                  <li>
                    На <mark>Windows 10</mark> версии <mark>21H2</mark> и ниже вы не
                    сможете установить <mark className="app">Adobe After Effects</mark>{" "}
                    версии <mark>24.1</mark> или новее, если требования к установке не
                    были вырезаны в исполняемом файле установщика. Для решения проблемы -
                    обновите систему до более свежего билда. Если у вас редакция{" "}
                    <mark>LTSC</mark>, то без полной переустановки не обойтись. В этом
                    случае можно поставить последнюю доступную для вас версию -{" "}
                    <mark>23.6</mark> или <mark>24.0</mark>.
                  </li>
                </ul>
              </AdditionWarning>
              <Divider>Какой процессор нужен программе?</Divider>
              <p>
                Так как <mark className="app">Adobe After Effects</mark> в основном
                нагружает процессор, особенно при работе с эффектами и рендере - его выбор
                играет крайне важную роль. Для комфортной работы подойдёт минимум{" "}
                <mark>Intel</mark> 7-й серии 11-го поколения, например{" "}
                <mark>i7-11700</mark>, или <mark>AMD</mark> 5-й серии 3-го поколения,
                например <mark>Ryzen 5 3600</mark>. Хотите работать шустрее - умножайте
                свои требования к процессору в два, три или даже шесть раз.
              </p>
              <AdditionInfo>
                <ul>
                  <li>
                    Если вы хотите приобрести новый стационарный компьютер -
                    предпочтительнее его собирать на более свежих сокетах - для
                    возможности обновления железа при необходимости: <mark>LGA 1700</mark>{" "}
                    или <mark>LGA 1851</mark> для сборок на <mark>Intel</mark>, или{" "}
                    <mark>AM5</mark> для сборок на <mark>AMD</mark>.
                  </li>
                  <li>
                    Начиная с версии <mark>2022</mark>, в{" "}
                    <mark className="app">Adobe After Effects</mark> появилась поддержка
                    мультикадрового рендера, которая включена по умолчанию. Если в
                    настройках{" "}
                    <mark className="ui">
                      Edit &gt; Preferences &gt; Memory & Performance
                    </mark>{" "}
                    эта функция активна, а все эффекты в композиции её поддерживают -
                    программа начнёт использовать несколько ядер процессора для
                    параллельного рендера кадров. Это может заметно ускорить экспорт,
                    особенно на мощных системах, но также может увеличить потребление
                    оперативной памяти и видеопамяти вашей видеокарты.
                  </li>
                </ul>
              </AdditionInfo>
              <AdditionWarning>
                Если на вашем устройстве установлен процессор, который не поддерживает
                инструкции <mark>AVX2</mark> - вы не сможете корректно запустить{" "}
                <mark className="app">Adobe After Effects</mark> версии <mark>24.1</mark>{" "}
                или новее, так как при успешной установке и запуске программы - вам будут
                выдавать ошибку <mark className="code">0xc0000142</mark>. Если у вас нет
                возможности обновить процессор - установите версию программы{" "}
                <mark>23.6</mark> или <mark>24.0</mark>.
              </AdditionWarning>
              <Divider>Сколько оперативной памяти необходимо?</Divider>
              <p>
                Оперативной памяти может потребоваться минимум <mark>16-32 ГБ</mark>. Его
                потребление зависит по большей части от только от вас, вашего проекта и
                применённых в нём эффектов. Если у вас есть возможность для установки
                большего объёма оперативной памяти в ваше устройство - берите сразу{" "}
                <mark>64 ГБ</mark> или больший объём, не прогадаете.
              </p>
              <AdditionInfo>
                <ul>
                  <li>
                    Иногда, даже при большом количестве установленной оперативной памяти
                    на вашем устройстве, вы можете столкнуться с{" "}
                    <mark>Out of Memory</mark>. Обычно это решается{" "}
                    <a href="#4.5">настройкой файла подкачки</a>.
                  </li>
                  <li>
                    В <mark className="app">Adobe After Effects</mark>, начиная с версии{" "}
                    <mark>25.2</mark> и новее, появилась возможность воспроизведения
                    предпросмотра напрямую из дискового кэша, не загружая кадры оттуда в
                    оперативную память. Это может помочь, если вы хотите посмотреть
                    длинную и нагруженную композицию, а количества оперативной памяти у
                    вас не хватает для долгого предпросмотра. Данная опция уже включена по
                    умолчанию, если у вас включен дисковый кэш. Включить или выключить
                    функцию предпросмотра напрямую из дискового кэша вы можете в{" "}
                    <mark className="ui">
                      Edit &gt; Preferences &gt; Media & Disk Cache &gt; Enable Preview
                      from Disk Cache
                    </mark>
                    . При использовании данной опции желательно использовать быстрый
                    твердотельный накопитель.
                  </li>
                </ul>
              </AdditionInfo>
              <Divider>А по видеокарте что?</Divider>
              <p>
                Для работы с эффектами, которые используют <mark>GPU-ускорение</mark>,
                подойдёт видеокарта <mark>NVIDIA</mark> как минимум{" "}
                <mark>GTX 1000 серии</mark> с <mark>4 ГБ</mark> видеопамяти, например{" "}
                <mark>GTX 1660 Super</mark>. Но лучше смотреть в сторону как минимум{" "}
                <mark>RTX 3000 серии</mark> или выше - хотя бы{" "}
                <mark>RTX 3060 на 12 ГБ</mark> или <mark>RTX 4060 Ti на 16 ГБ</mark>. Если
                бюджет для апгрейда ограничен, а хорошая видеокарта у вас уже есть -
                разумнее вложиться в более мощный процессор или увеличить объём
                оперативки.
              </p>
              <AdditionInfo>
                Для более стабильной работы с программами для композитинга и монтажа -
                рекомендуется установить драйвера редакции{" "}
                <mark>NVIDIA Studio Driver</mark>. Загрузить драйвера{" "}
                <mark>NVIDIA Studio</mark> вы можете на{" "}
                <a href="https://www.nvidia.com/en-us/geforce/drivers/">
                  официальной странице загрузки драйверов
                </a>
                . На странице укажите текущую модель вашей видеокарты, операционную
                систему и не забудьте указать в <mark className="ui">Download Type</mark>{" "}
                значение <mark>Studio Driver</mark>.
              </AdditionInfo>
              <AdditionDanger>
                <ul>
                  <li>
                    Несмотря на то, что <mark>Adobe</mark> и производители сторонних
                    плагинов стараются добавлять поддержку видеокарты для эффектов в новых
                    версиях своих продуктов,{" "}
                    <mark className="app">Adobe After Effects</mark> до сих пор не очень
                    рассчитан на использование видеокарты и использует его ресурсы только
                    тогда, когда это действительно требуется в контексте той или иной
                    ситуации. Программа больше всего ориентирована на использование
                    процессора, а также не обязана использовать все ресурсы вашего
                    устройства.
                  </li>
                  <li>
                    Видеокарты от <mark>AMD</mark> не очень хорошо подходят для серьёзной
                    работы в программах <mark>Adobe</mark> из-за отсутствия внятной
                    поддержки аппаратного ускорения у этих видеокарт - далеко не все
                    сторонние плагины с поддержкой <mark>GPU-ускорения</mark> поддерживают
                    работу с видеокартами этого бренда. Только с недавних пор некоторые
                    разработчики начали адаптировать эффекты для видеокарт{" "}
                    <mark>AMD</mark> - привет, <mark>BorisFX</mark> с их{" "}
                    <mark className="plugin">Sapphire</mark>. Соотношение количества
                    плагинов, адаптированных под видеокарты <mark>NVIDIA</mark> явно
                    больше, чем тех, что адаптированы под видеокарты <mark>AMD</mark>.
                  </li>
                </ul>
              </AdditionDanger>
              <Divider>Что с остальными комплектующими?</Divider>
              <p>
                Скорость работы <mark className="app">Adobe After Effects</mark>, включая
                запуск программы, загрузку проектов, плагинов и медиафайлов, во многом
                зависит от скорости дискового накопителя. Если операционная система,
                программа, проект и исходники расположены на медленном <mark>HDD</mark>,
                это может сказаться на общей производительности. В таких случаях переход
                на <mark>SSD</mark> или <mark>NVMe</mark> может помочь сократить время
                отклика, ускорить загрузку дополнительных материалов и уменьшить
                вероятность непонятных зависаний при работе с проектом.
              </p>
              <AdditionWarning>
                Не стоит устанавливать <mark className="app">Adobe After Effects</mark> на
                другой раздел или на другое расположение программ.{" "}
                <a href="#2.6">Почему?</a>
              </AdditionWarning>
              <AdditionInfo>
                Если вы закончили работу с проектом, отрендерили и экспортировали его - вы
                можете его перенести на более медленный накопитель для освобождения
                пространства на более быстром, предварительно собрав его в одну папку с
                помощью <a href="#10.15">Collect Files</a>.
              </AdditionInfo>
              <p>
                Ещё не забывайте периодически чистить рабочую станцию от пыли и проверять
                систему охлаждения. Перегрев может привести к{" "}
                <mark className="word">троттлингу</mark> процессора и видеокарты во время
                рендера.
              </p>
              <AdditionInfo>
                <mark className="word">Троттлинг</mark> - сброс частот, когда железо
                начинает перегреваться. Система специально снижает производительность,
                чтобы не сгореть.
              </AdditionInfo>
              <Divider>Разбираемся с вашей операционной системой</Divider>
              <p>
                Даже если всё с проектом хорошо, а системные требования подходят под
                комфортную работу в <mark className="app">Adobe After Effects</mark> - в
                некоторых случаях программа может тормозить из-за хлама на устройстве. А
                всё потому что пользователи часто забывают про гигиену операционной
                системы и дискового пространства. Под гигиеной я подразумеваю то, что
                любое устройство со временем начинает медленее работать из-за забитого
                мусора во временных файлах, ненужных приложений в фоне и старых драйверов
                на некоторые комплектующие.
              </p>
              <p>
                Чтобы быстро почистить вашу систему от ненужного кэша - откройте
                стандартные папки <mark className="path">%TEMP%</mark> и{" "}
                <mark className="path">%LOCALAPPDATA%/Temp</mark>, очистите в них
                содержимое. Далее вы можете открыть стандартную утилиту{" "}
                <mark className="app">cleanmgr</mark> для очистки неиспользуемых
                операционной системы файлов, а также удалить старые точки восстановления.
              </p>
              <AdditionInfo>
                Рекомендую перенести все доступные системные кэши в одну папку, например{" "}
                <mark className="path">C:\Temp</mark> с помощью изменения переменных сред.{" "}
                <a href="https://remontka.pro/move-temporary-files-folder-windows/">
                  Как?
                </a>
              </AdditionInfo>
              <p>
                Если вы хотите почистить систему ещё лучше - попробуйте пройтись утилитами{" "}
                <mark className="app">Dism++</mark>, <mark className="app">CCleaner</mark>
                , <mark className="app">Kerish Doctor</mark> или{" "}
                <mark className="app">Auslogics BoostSpeed</mark>. Некоторые утилиты
                предлагают комплексные действия для оптимизации вашей операционной
                системы.
              </p>
              <AdditionDanger>
                Используйте эти утилиты только в том случае, если вы знаете что делаете.
                Если вы являетесь неопытным пользователем компьютера - лучше не лезьте и
                используйте стандартные средства <mark>Windows</mark>.
              </AdditionDanger>
              {/* TODO: про захламленность, переполненность ссд и хдд мол некуда девать файлы, драйвера, очистку мусора и прочее */}
            </div>
          }
        />
        <Divider />
        <p>
          Ну а теперь перейдем к основным проблемам плохой производительности проекта
          из-за действий и халатности пользователя. Да, их немного, но если переделать
          проект как надо - ситуация со скоростью рендера и стабильностью работы может
          заметно улучшиться.
        </p>
        <Divider>Проблемы из-за исходников в проекте</Divider>
        <p>
          В качестве первой проблемы сразу стоит обсудить импорт материалов в проект.
          Довольно часто пользователи скачивают различные материалы из интернета,
          импортируют в композиции, а потом через некоторые время замечают странности -
          артефакты, кривую работу с эффектами или вообще резкое снижение
          производительности всего проекта. Да, такое может быть из-за какого-то
          импортированного видео, картинки, аудио или даже кривого шрифта, используемый в
          текстовом слое.
        </p>
        <p>
          Прежде чем импортировать в проект различные материалы - их стоит конвертировать
          в более совместимые для <mark className="app">Adobe After Effects</mark>{" "}
          форматы. Если выработаете себе привычку так делать - вы будете меньше
          сталкиваться с проблемами именно из-за исходников.
          {/* TODO: перепроверить!! */}
        </p>
        <ul>
          <li>
            Наиболее проблемными для редактирования считаются видео, закодированные с
            помощью кодеков, ориентированных на стриминг и онлайн-платформы, например{" "}
            <mark className="video">H.264</mark> и <mark className="video">H.265</mark>.
            Такие файлы часто используют агрессивное сжатие, имеют нестабильную структуру
            кадров и переменный <mark>FPS</mark>. Совокупность этих факторов может
            вызывать баги, артефакты и нестабильную работу{" "}
            <mark className="app">Adobe After Effects</mark>. Чтобы избежать подобных
            проблем - стоит перекодировать такие исходники в{" "}
            <mark className="word">монтажный кодек</mark> с помощью одной из следующих
            утилит: <mark className="app">Adobe Media Encoder</mark>,{" "}
            <mark className="app">Shutter Encoder</mark>,{" "}
            <mark className="app">Handbrake</mark> или{" "}
            <mark className="app">MKVToolNix</mark>. После конвертации, если файл уже был
            импортирован - замените его в проекте через{" "}
            <mark className="ui">Replace Footage</mark>.{" "}
            <a href="#5.1">Подробнее про рекомендуемый пайплайн импорта...</a>.
            <AdditionInfo>
              <ul>
                <li>
                  <mark className="word">Монтажный кодек</mark> - это тип видеокодека,
                  рассчитанный на комфортную работу с видео во время редактирования. В
                  отличие от сильно сжатых форматов вроде{" "}
                  <mark className="video">H.264</mark>, которые оптимизированы под
                  финальный просмотр, монтажные кодеки сохраняют больше визуальных данных
                  и используют куда меньший фактор сжатия. Такие файлы занимают больше
                  пространства на диске, но зато программа работает с ними стабильнее -
                  меньше лагов, меньше артефактов, меньше головной боли при рендере.
                  Подробнее о типах кодеков и их области применения вы можете посмотреть в{" "}
                  <a href="https://www.youtube.com/watch?v=MprgQSTqL9E">
                    видео от VideoSmile
                  </a>
                  .
                </li>
                <li>
                  <mark className="video">H.264</mark>,{" "}
                  <mark className="video">H.265</mark> или похожие кодеки, полученные с
                  онлайн-платформ, нередко имеют отклонения от стандартной реализации этих
                  кодеков. Если вам важно сохранить свободное место на диске - вы можете
                  перекодировать &quot;кривой&quot; <mark className="video">H.264</mark>{" "}
                  или <mark className="video">H.265</mark> в &quot;корректный&quot; с
                  указанием такого же кодека с помощью <mark className="app">FFmpeg</mark>{" "}
                  или его оболочек, таких как <mark className="app">Shutter Encoder</mark>
                  .
                </li>
                <li>
                  Чтобы посмотреть метаданные исходников видео - воспользуйтесь{" "}
                  <a href="https://mediaarea.net/MediaInfoOnline">
                    онлайн-версией MediaInfo Online
                  </a>{" "}
                  или локальным <a href="https://mediaarea.net/en/MediaInfo">MediaInfo</a>
                  , которая доступна для многих операционных систем. В{" "}
                  <mark className="app">MediaInfo</mark> можно узнать многое о ваших
                  исходниках. Если ваш видеоисходник не скачан из какой-нибудь видео
                  площадки, например из <mark>YouTube</mark>, записан с{" "}
                  <mark>Constant FPS</mark>, а цветовое пространство -{" "}
                  <mark>Rec.709</mark>, то такой исходник можно спокойно использовать для
                  работы без предварительной конвертации.{" "}
                  <i style={{opacity: "0.5"}}>
                    Надеемся, что с такими исходниками вы не будете сталкиваться с
                    различными проблемами.
                  </i>
                </li>
                <li>
                  В редких случаях ваш пайплайн может подразумевать работу с видео в
                  цветовом пространстве с широким динамическим диапазоном, например,{" "}
                  <mark>S-Log</mark>, <mark>V-Log</mark>, <mark>Canon Log</mark> и прочие.
                  В таком случае вы можете импортировать в проект оригинальный файл,
                  создать прокси для него, а затем работать с ним как обычно. По умолчанию
                  при финальном экспорте - файлы, для которых был указан прокси, обратно
                  заменятся оригиналом.
                </li>
              </ul>
            </AdditionInfo>
          </li>
          <li>
            То же самое касается и аудиофайлов, если вы импортируете их в проект отдельно.
            Звук, скачанный из <mark>VK</mark>, <mark>SoundCloud</mark> или других
            стриминговых платформ, тоже может быть пережат как попало - результатом будет
            растянутый, искажённый или &quot;пожёванный&quot; звук в{" "}
            <mark className="app">Adobe After Effects</mark>, даже если настройки в окне{" "}
            <mark className="ui">Preview</mark> верные. Угадайте, как это лечится?
            Правильно - снова конвертацией, только в <mark className="audio">WAV</mark>.
            Это можно сделать через <mark className="app">Shutter Encoder</mark>,{" "}
            <mark className="app">Adobe Media Encoder</mark>,{" "}
            <mark className="app">EZ CD Audio Converter</mark> или{" "}
            <mark className="app">Adobe Audition</mark>.
          </li>
          <li>
            С изображениями проблемы встречаются редко, но и они тоже могут быть.{" "}
            <mark className="app">Adobe After Effects</mark> не особо любит изображения с
            большим разрешением, а также если они...
            {/* TODO: они что? */}
          </li>
          <li>
            Иногда проблемы с производительностью программы могут возникнуть из-за шрифтов
            в проекте. Да, такое бывает, когда вы используете кривой шрифт и даже не
            догадываетесь об этом. Для решения этой проблемы достаточно заменить шрифт на
            аналогичный или скачать его из другого источника.
          </li>
        </ul>
        <Divider>Важна ли свежая версия программы и сторонних плагинов?</Divider>
        <p>{/* TODO: */}</p>
        <p>
          Смотря с какой стороны подойти к этому вопросу. Если вы недавно приобрели свежее
          устройство и решите поставить на него устаревшую версию{" "}
          <mark className="app">Adobe After Effects</mark> - в большинстве случаев она
          будет работать не очень из-за того что она не адаптирована под свежие
          комплектующие вашего нового устройства. Также и наоборот, установив свежую
          версию программы на очень старое устройство - вы можете столкнуться с кривой
          работой некоторых функций или отсутствием аппаратного ускорения.
        </p>
        <Divider>Проблемы при чрезмерном использовании эффектов</Divider>
        <p>
          Минздрав обычно предупреждает, что чрезмерное употребление алкоголя вредит
          вашему здоровью. Только вот он забыл предупредить, что чрезмерное употребление
          эффектов в <mark className="app">Adobe After Effects</mark> часто вредит
          скорости и стабильности рендера. Я не шучу - некоторые увлекаются эффектами до
          абсурда: лепят три вида свечения, кучу <mark className="word">шейков</mark>,
          цветокоррекцию несколькими эффектами, а сверху - мелкие самодельные частицы,
          грейны, блюры из разных пакетов плагинов и ещё десяток слоёв. В результате
          пользователь получает медленный рендер, фризы и часто нестабильную работу
          проекта.{" "}
          <i style={{opacity: "0.5"}}>
            Зато клёвый и красивый <mark className="word">эдит</mark> для{" "}
            <mark className="app">тиктока</mark> получился, да?
          </i>
        </p>
        <p>
          Если проблемы с исходниками как-то ещё можно оперативно решить перекодировкой,
          то в данном случае решить проблемы с эффектами не так уж и просто. Поэтому на
          помощь приходит функция <mark>Render Time</mark>, добавленная в{" "}
          <mark className="app">Adobe After Effects</mark> версии <mark>2022</mark> и
          новее. Он работает как профайлер композиции - анализирует, сколько времени
          занимает рендер каждого эффекта на каждом слое. В нижней части таймлайна в{" "}
          <mark className="ui">Frame Render Time</mark> можно увидеть общее время рендера
          текущего кадра, а в колонке <mark className="ui">Render Time</mark> - время
          рендера каждого слоя и эффекта. С этим инструментом можно выследить самые
          тяжёлые эффекты и, при необходимости, заменить их на аналоги полегче или убрать
          вообще.
        </p>
        <AdditionInfo>
          Чтобы включить отображение времени рендера - нажмите на иконку улитки в левом
          нижнем углу таймлайна или включите колонку{" "}
          <mark className="ui">Render Time</mark> через{" "}
          <mark className="ui">Columns</mark>.
        </AdditionInfo>
        <ImageFigure
          caption="Timeline"
          imgSrc="images/aftereffects/view_render_time.png"
          imgTitle="Смотрим время рендера слоя"
          styleClass="figure_windows-dark"
        />
        <p>
          Ну а теперь приступим к советам по эффектам. Первым делом, пожалуйста, не
          превращайте <mark className="app">Adobe After Effects</mark> в свалку плагинов.
          Прежде чем ставить очередной пакет плагинов или шаблонов - подумайте, а точно ли
          он вам нужен в повседневном использовании и уверены ли вы в том, что он будет
          хорошо работать с вашими проектами? Чем больше эффектов используется в проекте,
          тем труднее понять, какой из них вызывает проблемы с производительностью.
        </p>
        <p>
          Также бывают случаи, когда при применении некоторых эффектов похожих действий,
          например <mark className="word">шейки</mark> из двух разных пакетов плагинов на
          одном слое, могут некорректно взаимодействовать друг с другом или нарушен
          порядок их применения.
        </p>
        <AdditionInfo>
          Эффекты в окне <mark className="ui">Effect Controls</mark> применяются сверху
          вниз, и каждый следующий работает с результатом предыдущего. Порядок эффектов на
          слое часто влияет на финальную картинку. Например, если сначала наложить
          размытие, а потом <mark className="word">шейк</mark>, по краям слоя может
          появиться неприятная &quot;плитка&quot;. А вот если сделать наоборот - слой
          будет выглядеть нормально.
        </AdditionInfo>
        <Divider>А что насчёт количества слоёв?</Divider>
        <p>
          {/* TODO: афтер при количестве слоёв больше чем 1000 начинает неистово лагать и криво рендерить таймлайн  */}
        </p>
        <Divider>Кэшируем предпросмотр для более плавного просмотра</Divider>
        <p>
          Некоторые новички, которые ещё не в курсе всех нюансов воспроизведения
          предпросмотра, часто воспроизводят его в реальном времени. Почему? А потому что
          они ни разу не смотрели в параметры предпросмотра в окне{" "}
          <mark className="ui">Preview</mark>. Чтобы устранить такое стандартное поведение
          программы - вам нужно включить параметр, который говорит программе команду{" "}
          <mark>закэшировать предпросмотр, прежде чем его воспроизводить</mark>. Чтобы
          включить кэширование предпросмотра перед его воспроизведением - нужно открыть
          окно <mark className="ui">Preview</mark> и прожать в ней две опции -{" "}
          <mark className="ui">Cache Before Playback</mark> и{" "}
          <mark className="ui">If caching, play caching frames</mark>.
        </p>
        <ImageFigure
          caption="Preview"
          imgSrc="images/aftereffects/preview_caching.png"
          imgTitle="Включение кэширования предпросмотра"
          styleClass="figure_windows-dark"
        />
        <AdditionInfo>
          <ul>
            <li>
              Включение чекбокса у <mark className="ui">Cache Before Playback</mark>{" "}
              позволит программе закэшировать предпросмотр, прежде чем воспроизвести его.
              Повторное нажатие на кнопку воспроизведения остановит кэширование.
            </li>
            <li>
              Включение чекбокса у{" "}
              <mark className="ui">If caching, play caching frames</mark> позволит
              остановить кэширование предпросмотра и проиграть те кадры, которые уже
              закэшировались при повторном нажатии на кнопку воспроизведения.
            </li>
          </ul>
        </AdditionInfo>
        <AdditionInfo>
          Подробнее о причинах замедленного предпросмотра вы можете посмотреть в{" "}
          <a href="#3.11">этой статье</a>.
        </AdditionInfo>
        {/* TODO:  дописать про кэширование как в статье про замделенное или ускоренное превью*/}
        <Divider>Отключаем кэширование в простое для снижения нагрузки</Divider>
        <p>
          Если выполнять действия в программе вам стало сложнее из-за непонятных тормозов,
          то возможно, вы не заметили, что по умолчанию в{" "}
          <mark className="app">Adobe After Effects</mark> версии <mark>2022</mark> и
          новее появилась функция <mark className="ui">Cache Frames When Idle</mark>. Она
          включена по умолчанию и начинает кэшировать композицию, когда вы ничего не
          делаете в течение 8 секунд. Часто на слабых устройствах эта функция заставляет
          тормозить программу и систему, особенно если у вас много эффектов, поэтому
          рекомендую его отключить. Для этого достаточно прожать комбинацию клавиш{" "}
          <mark className="key">Alt + Shift + I</mark> или выключить его в{" "}
          <mark className="ui">Composition &gt; Preview</mark>.
        </p>
        <ImageFigure
          caption="Adobe After Effects"
          imgSrc="images/aftereffects/disable_idle_cache.png"
          imgTitle="Отключение автоматического кэширования предпросмотра при бездействии"
          styleClass="figure_windows-light"
        />
      </DetailsSummary>
      <DetailsSummary
        tag="ускорить работу, оптимизация, увеличить скорость рендера, про использование видеокарты, процессор или видеокарта простаивает"
        title="Как заставить программу использовать всю мощь моего устройства?"
      >
        <p>
          При чтении подобных вопросов сразу вспоминается мем про оплату за полный
          спидометр автомобиля.
          {/* , только вот к{" "}
          <mark className="app">Adobe After Effects</mark> его вряд ли применишь */}
          {/* Почему?
          Потому что вся производительность проекта часто упирается в действия пользователя. */}{" "}
          {/* Но в программе есть некоторые параметры, которые если правильно настроить - могут помочь ускорить работу с программой. */}
        </p>
        <ImageFigure
          caption="Я заплатил за весь спидометр, я буду использовать весь спидометр"
          imgSrc="images/car_speedometer.jpg"
          imgTitle="Изображение спидометра на панели приборов в ВАЗ-2190 (Priora)"
          styleClass="figure_windows-dark"
        />
        <p>{/* FIXME: */}</p>
        <Divider>Почему процессор или видеокарта в моем проекте простаивает?</Divider>
        {/*   <p>
          Предположим, что вы только-только купили новое устройство и вы хотите его
          отжарить по полной в <mark className="app">Adobe After Effects</mark>. Наша с вами
          любимая программа обычно работает не в полную силу, так как потребляет некоторые
          ресурсы тогда, когда ему это действительно необходимо, и это абсолютно
          нормально. Но всё же есть несколько способов, как немного ускорить работу
          программы и позволить программе использовать ресурсы вашего устройства по
          полной.
        </p>
        <Divider>Настраиваем Multi-frame Render</Divider>
        <p>
          С помощью функции <mark className="ui">Multi-Frame Rendering</mark> вы сможете
          приказать программе использовать весь потенциал процессора за счёт рендера
          нескольких кадров одновременно. В новых версиях{" "}
          <mark className="app">Adobe After Effects</mark> функция{" "}
          <mark className="ui">Multi-Frame Rendering</mark> включена по умолчанию. В{" "}
          <mark className="ui">Edit &gt; Preferences &gt; Memory & Performance</mark>
          можно ограничить использование процессора на вашем компьютере, для того, чтобы
          дать другим программам на вашем компе немного мощности при многокадровом
          рендере.
        </p>
        <ImageFigure
          caption="Preferences"
          imgSrc="images/aftereffects/mfr_settings.png"
          imgTitle="Настройка ограничения процессора при многокадровом рендере"
          styleClass="figure_windows-dark"
        />
        <AdditionWarning>
          <ul>
            <li>
              Использование <mark className="ui">Multi-Frame Rendering</mark> может
              привести к увеличению потребления оперативной памяти и есть риск чаще видеть
              ошибку <mark>Out of Memory</mark>. Для этого либо отключите{" "}
              <mark className="ui">Multi-Frame Rendering</mark>, либо ограничьте
              использование оперативной памяти, увеличив значение{" "}
              <mark className="ui">RAM reserved for other applications</mark> в
              настройках. Также Если у вас устройство на <mark>Windows</mark> -{" "}
              <a href="#4.5">настройте файл подачки</a> и установите программу{" "}
              <a href="https://github.com/henrypp/memreduct/releases">Mem Reduct</a> для
              периодической очистки оперативной памяти.
            </li>
            <li>
              Пожалуйста,{" "}
              <b>
                <u>не путайте значения</u>
              </b>{" "}
              и{" "}
              <b>
                <u>внимательно прочтите параметр настройки</u>
              </b>
              . Значение <mark>10%</mark> означает, что{" "}
              <mark className="app">Adobe After Effects</mark> будет использовать{" "}
              <mark>90%</mark> использования процессора и оставит <mark>10%</mark> для
              остальных программ. Если вы установите значение <mark>70%</mark>, то вы
              отдадите программе всего лишь <mark>30%</mark> мощности.
            </li>
          </ul>
        </AdditionWarning>
        <Divider>Про использование видеокарты</Divider>
        <p>
          Поговорим про видеокарту. Даже если вы и купили условный <mark>RTX 5090</mark> и
          прям акцентируете на это внимание при описании вашей проблемы с
          производительностью, то программе будет на это пофиг. Абсолютно. Всем по
          барабану насколько у вас мощная видеокарта, пока у{" "}
          <mark className="app">Adobe After Effects</mark> до сих пор отсутствует полная
          поддержка <mark>GPU-ускорения</mark>.
        </p>
        <AdditionWarning>
          Вы, конечно, можете использовать встроенные и сторонние эффекты с поддержкой{" "}
          <mark>GPU-ускорения</mark>, например из пакета{" "}
          <mark className="plugin">Boris FX Sapphire</mark> или{" "}
          <mark className="plugin">Red Giant</mark>. Если вы примените эффект, который не
          поддерживает <mark>GPU-ускорение</mark>, то толк от видеокарты начнёт пропадать,
          так как сначала будет рендериться несколько эффектов через <mark>GPU</mark>, а
          потом уже на <mark>CPU</mark> и увеличит время рендера. Или программа вовсе
          начнёт рендерить эффекты принудительно через <mark>CPU</mark>, если{" "}
          <mark>GPU-эффекту</mark> мешает какой-то другой эффект.
        </AdditionWarning>
        <p>
          Для того, чтобы посмотреть только те эффекты, которые поддерживают{" "}
          <mark>GPU-ускорение</mark>, нужно с помощью контекстного меню в окне{" "}
          <mark className="ui">Effects & Presets</mark>, включить параметр{" "}
          <mark className="ui">Show GPU Capable Effects Only</mark>. После включения этого
          параметра вы заметите, насколько сильно сократится список ваших эффектов.
        </p>
        <ImageFigure
          caption="Adobe After Effects"
          imgSrc="images/aftereffects/show_gpu_capable_effects_only.png"
          imgTitle="Включение отображение только тех эффектов, которые поддерживают GPU-ускорение"
          styleClass="figure_windows-dark"
        />
        <p>
          Рядом с названием плагинов обычно отображаются значки, которые показывают
          максимальную поддержку битности цветов (8, 16 или 32 бит) и иногда показывается
          вторая иконка рядом с битностью, которая показывает, что этот эффект
          поддерживает <mark>GPU-ускорение</mark>.
        </p>
        <AdditionInfo>
          Если эффект поддерживает только 8 бит на цветовой канал, а в менеджере проекта
          вы выставите 16 или 32 бита, то при применении такого эффекта выскочит
          предупреждение, показывающая что при использовании большей битности в проекте -
          эффект может сократить вам цветовой охват и может некорректно работать с HDR
          исходниками.
        </AdditionInfo>
        <ImageFigure
          caption="Effects & Presets"
          imgSrc="images/aftereffects/effect_icons.png"
          imgTitle="Иконки рядом с эффектами"
          styleClass="figure_windows-dark"
        />
        <Divider>Различия в работе между After Effects и Premiere Pro</Divider>
        <p>
          У некоторых людей возникает ещё странный вопрос, мол почему видеокарта в{" "}
          <mark className="app">Adobe Premiere Pro</mark> используется чаще, чем в{" "}
          <mark className="app">Adobe After Effects</mark>? Ответ прост,{" "}
          <mark className="app">Adobe Premiere Pro</mark> является программой для нелинейного
          монтажа и обычно от него ожидают больше производительность и работу с
          исходниками в режиме реального времени, порой забивая на качество результата. А{" "}
          <mark className="app">Adobe After Effects</mark> в первую очередь - программа для
          композитинга и создания эффектов, от него ожидают качество, пусть и с маленькой
          производительностью. Да, <mark className="app">Adobe After Effects</mark> стараются
          время от времени как-то оптимизировать и где-то улучшить производительность, но
          высокой скорости работы от программы ждать не надо. Программы хоть и схожи по
          задаче редактирования видео, но подходы их реализации разительно отличаются.
        </p> */}
      </DetailsSummary>
      <DetailsSummary
        tag="mercury gpu acceleration, software only, video rendering, рендер только на процессоре, ракета"
        title="Как переключить тип рендеринга и зачем это нужно делать?"
      >
        <p>
          В <mark className="app">Adobe After Effects</mark> существует два типа ускорения
          — аппаратное и программное, — и каждый из них работает с конкретным проектом
          по-разному. В некоторых случаях пользователю может понадобиться переключение с
          аппаратного ускорения на программное, чтобы избавиться от проблем, связанных с{" "}
          <mark className="select">«Mercury GPU Acceleration»</mark>: например, от
          переполнения видеопамяти, различных артефактов или остановки рендеринга без
          внятной причины. Или наоборот, когда стандартный эффект, например{" "}
          <mark className="plugin">VR Chromatic Aberration</mark>, требует включить
          аппаратное ускорение, если у вас выбран режим{" "}
          <mark className="select">«Mercury Software Only»</mark>.
        </p>
        <p>
          Чтобы изменить тип ускорения, откройте окно{" "}
          <mark className="select">«Project Settings»</mark> с помощью комбинации клавиш{" "}
          <mark className="key">Ctrl + Alt + Shift + K</mark> или через меню{" "}
          <mark className="select">«File» → «Project Settings»</mark>. По умолчанию вы
          попадёте на вкладку{" "}
          <mark className="select">«Video Rendering and Effects»</mark>, где параметр{" "}
          <mark className="select">«Use»</mark>, который нужно изменить, отвечает за тип
          ускорения рендеринга.
        </p>
        <Addition type="info">
          Окно <mark className="select">«Project Settings»</mark> часто называют
          «ракетой», так как иконка космической ракеты в окне{" "}
          <mark className="select">«Project»</mark> открывает именно его.
        </Addition>
        <ContentFigure
          caption="Project Settings"
          imgTitle="Переключение типа рендеринга"
          src="images/aftereffects/project_manager_mercury.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <ul>
          <li>
            <mark className="select">«Mercury Software Only»</mark>, или{" "}
            <mark className="word">программное ускорение</mark>, позволит{" "}
            <mark className="app">Adobe After Effects</mark> реже обращаться к видеокарте
            и выполнять рендеринг в большинстве случаев на процессоре. Рендеринг на
            процессоре обычно стабильнее, чем при использовании видеокарты.
            <Addition type="info">
              <ul>
                <li>
                  Даже если выбран этот параметр, некоторые сторонние эффекты всё равно
                  могут обрабатываться видеокартой, например{" "}
                  <mark className="plugin">Depth Scanner</mark>. Обычно это поведение
                  можно изменить в настройках самого эффекта.
                </li>
                <li>
                  С этим параметром время просчёта композиций может измениться как в
                  худшую, так и в лучшую сторону — это зависит от «железа», но в сложных
                  композициях время зачастую остаётся неизменным. Иногда рендеринг на
                  процессоре может пройти даже быстрее, чем с{" "}
                  <mark className="select">«Mercury GPU Acceleration»</mark>.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            <mark className="select">«Mercury GPU Acceleration»</mark>, или{" "}
            <mark className="word">аппаратное ускорение</mark>, позволит программе
            использовать при рендеринге и процессор, и видеокарту. Видеокарта будет
            задействована в тех случаях, когда применённый эффект её поддерживает. Иногда
            это значение может быть продублировано с указанием технологии вашей
            видеокарты, например <mark>CUDA (NVIDIA)</mark>, <mark>OpenCL (AMD)</mark>,{" "}
            <mark>OpenGL (Intel)</mark> или <mark>Metal (Apple Silicon)</mark>.
            <Addition type="warning">
              На видеокартах с малым объёмом видеопамяти вы можете часто сталкиваться с
              ошибкой{" "}
              <mark className="warning">
                «After Effects has encountered a failure related to GPU-enabled effects
                from this frame»
              </mark>
              . Это происходит из-за переполнения видеопамяти. В таком случае{" "}
              <mark className="app">Adobe After Effects</mark> предложит переключиться на{" "}
              <mark className="select">«Mercury Software Only»</mark>.
            </Addition>
            <Addition type="danger">
              <ul>
                <li>
                  Если на одном слое смешать эффект, который поддерживает аппаратное
                  ускорение, и тот, который не поддерживает, то скорость рендеринга
                  упрётся в скорость обработки эффекта, выполняемого на процессоре.
                </li>
                <li>
                  Часто бытует мнение, что при включённом{" "}
                  <mark className="select">«Mercury GPU Acceleration»</mark> видеокарта
                  якобы обязана использоваться во всех случаях. Это не так — программа
                  будет задействовать её только при необходимости, а не по вашей прихоти.{" "}
                  <mark className="app">Adobe After Effects</mark> по большей части
                  использует процессор, но разработчики стандартных и сторонних эффектов
                  всё чаще добавляют поддержку ускорения с помощью видеокарты.
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <Divider>Какие эффекты поддерживают аппаратное ускорение?</Divider>
        <p>
          Чтобы посмотреть список эффектов, которые поддерживают ускорение с помощью
          видеокарты, откройте окно <mark className="select">«Effects & Presets»</mark> и
          в его контекстном меню включите параметр{" "}
          <mark className="select">«Show GPU Capable Effects Only»</mark>. После этого вы
          заметите, насколько сильно сократится список ваших эффектов.
        </p>
        <ContentFigure
          caption="Adobe After Effects"
          imgTitle="Включение отображения только тех эффектов, которые поддерживают GPU-ускорение"
          src="images/aftereffects/show_gpu_capable_effects_only.png"
          theme="dark"
          type="image"
          variant="windows"
        />
      </DetailsSummary>
      <DetailsSummary
        tag="файл подкачки, виртуальная память, swapfile, paging file, virtual memory"
        title="Для чего нужен файл подкачки и почему его не стоит отключать?"
      >
        <ContentFilter
          windowsContent={
            <div>
              <p>
                <mark className="file">Файл подкачки</mark>, или{" "}
                <mark className="file">pagefile.sys</mark>, — это специальный файл,
                который служит виртуальным расширением оперативной памяти. Когда системе
                не хватает физической оперативной памяти для выполнения ресурсоёмких
                задач, она начинает использовать файл подкачки для временного хранения
                данных. По умолчанию, если <mark className="file">pagefile.sys</mark> не
                отключён в вашей сборке <mark>Windows</mark>, система автоматически
                управляет его размером, однако часто делает это неэффективно. Поэтому
                рекомендуется настроить его параметры вручную.
              </p>
              <p>
                В интернете и от горе-сборщиков самодельных образов <mark>Windows</mark>{" "}
                нередко можно встретить мнение, что файл подкачки лучше отключить — мол,
                он «вредит» вашему твёрдотельному накопителю. Отчасти в этом есть смысл,
                однако современные накопители рассчитаны на такие нагрузки, и, скорее
                всего, вы смените свой «рабочий инструмент» на новый гораздо раньше, чем
                диск начнёт выходить из строя.
              </p>
              <p>
                С отключённым файлом подкачки в{" "}
                <mark className="app">Adobe After Effects</mark> или других творческих
                программах вы можете столкнуться с различными ошибками, например:{" "}
                <mark className="select">
                  «After Effects has unexpectedly run out of memory and cannot complete
                  this export»
                </mark>
                , <mark className="select">«Out of Memory»</mark> или{" "}
                <mark className="select">
                  «Low memory warning. RAM use has been extended for previews»
                </mark>
                . Кроме того, при нехватке оперативной памяти и отсутствии файла подкачки
                возможны вылеты приложений, появление сообщения{" "}
                <mark className="select">«В системе недостаточно памяти»</mark>, различные
                подвисания или даже чёрный экран, который устраняется только перезагрузкой
                устройства.
              </p>
              <p>
                Чтобы настроить размер файла подкачки в <mark>Windows</mark> или включить
                его, следуйте приведённой ниже пошаговой инструкции.
              </p>
              <Divider>Инструкция для Windows 10 и 11</Divider>
              <ul>
                <li>
                  Откройте окно <mark className="app">Выполнить</mark> с помощью
                  комбинации клавиш <mark className="key">Win + R</mark> и введите в поле{" "}
                  <mark className="select">«Открыть»</mark> команду{" "}
                  <mark className="code">SystemPropertiesAdvanced.exe</mark>, а затем
                  нажмите <mark className="key">Enter</mark> дважды. Таким образом вы
                  откроете окно <mark className="select">«Свойства системы»</mark> и сразу
                  попадёте в <mark className="select">«Параметры быстродействия»</mark>.
                  <ContentFigure
                    caption="Выполнить"
                    src="images/run_systempropertiesadvanced.png"
                    theme="dark"
                    type="image"
                    variant="windows"
                  />
                </li>
                <li>
                  В окне <mark className="select">«Параметры быстродействия»</mark>{" "}
                  перейдите на вкладку <mark className="select">«Дополнительно»</mark>.
                  <ContentFigure
                    caption="Параметры быстродействия"
                    src="images/systempropertiesadvanced_select_advanced.png"
                    theme="light"
                    type="image"
                    variant="windows"
                  />
                </li>
                <li>
                  Во вкладке <mark className="select">«Дополнительно»</mark> нажмите
                  кнопку <mark className="select">«Изменить»</mark> в разделе{" "}
                  <mark className="select">«Виртуальная память»</mark>.
                  <ContentFigure
                    caption="Параметры быстродействия"
                    src="images/systempropertiesadvanced_open_change_size.png"
                    theme="light"
                    type="image"
                    variant="windows"
                  />
                </li>
                <li>
                  Если у вас установлен флажок у параметра{" "}
                  <mark className="select">
                    «Автоматически выбирать объем файла подкачки»
                  </mark>
                  , снимите его.
                  <ContentFigure
                    caption="Виртуальная память"
                    src="images/systempropertiesadvanced_disable_auto_size.png"
                    theme="light"
                    type="image"
                    variant="windows"
                  />
                </li>
                <li>
                  <p>
                    Выберите раздел, на котором у вас установлена система. Если для
                    выбранного раздела установлено значение{" "}
                    <mark className="select">«Без файла подкачки»</mark> или{" "}
                    <mark className="select">«Размер по выбору системы»</mark>, измените
                    его на <mark className="select">«Указать размер»</mark>.
                  </p>
                  <p>
                    Далее укажите исходный и максимальный размер файла подкачки. После
                    ввода значений не забудьте нажать кнопку{" "}
                    <mark className="select">«Задать»</mark> для сохранения, а затем —{" "}
                    <mark className="select">«ОК»</mark> внизу окна.
                  </p>
                  <ContentFigure
                    caption="Виртуальная память"
                    src="images/systempropertiesadvanced_set_swap_size.png"
                    theme="light"
                    type="image"
                    variant="windows"
                  />
                  <Addition type="info">
                    <ul>
                      <li>
                        Для файла подкачки нужно выбрать раздел с самым производительным
                        диском на вашем устройстве. Размещение файла подкачки на медленном
                        диске может ухудшить работу как с{" "}
                        <mark className="app">Adobe After Effects</mark>, так и с{" "}
                        <mark>Windows</mark> в целом.
                      </li>
                      <li>
                        <mark className="select">«Исходный размер»</mark> — это начальный
                        размер файла подкачки, который всегда будет зарезервирован в
                        системе.
                      </li>
                      <li>
                        <mark className="select">«Максимальный размер»</mark> — это
                        граница, до которой <mark>Windows</mark> будет автоматически
                        расширять файл при необходимости. Если система достигнет этой
                        границы, файл больше расширяться не будет.
                      </li>
                      <li>
                        В качестве <mark className="select">«исходного размера»</mark> вы
                        можете установить значение от <mark>1024 МБ</mark> до любого
                        числа. <mark>Windows</mark> позволяет задать и более низкое
                        значение, но делать это не всегда рекомендуется, особенно если у
                        вас установлен медленный накопитель.
                      </li>
                      <li>
                        В качестве <mark className="select">«максимального размера»</mark>{" "}
                        для повседневных задач можно установить значение по формуле{" "}
                        <mark>
                          «текущий объём оперативной памяти, умноженный на 3 или 4»
                        </mark>{" "}
                        или сразу задать своё максимальное значение, например{" "}
                        <mark className="copy">65536</mark> (64 ГБ) или{" "}
                        <mark className="copy">131072</mark> (128 ГБ). Убедитесь, что на
                        выбранном разделе будет достаточно свободного места для файла
                        подкачки!
                      </li>
                    </ul>
                  </Addition>
                </li>
                <li>
                  После того как вы задали нужный размер файла подкачки, перезагрузите
                  устройство. Теперь <mark className="file">pagefile.sys</mark> будет
                  работать в соответствии с выбранными параметрами, и проблемы с нехваткой
                  оперативной памяти будут напоминать о себе заметно реже.
                </li>
              </ul>
            </div>
          }
        />
      </DetailsSummary>
    </div>
  );
};

export default AEPerformance;
