import React from "react";

import {Divider} from "antd";

import Addition from "../../../components/content/Addition";
import {ContentFigure} from "../../../components/content/ContentFigure";
import ContentFilter from "../../../components/content/ContentFilter";
import DetailsSummary from "../../../components/content/DetailsSummary";

const AEPerformance: React.FC = () => {
  return (
    <div className="faq-content">
      <DetailsSummary
        tag="pc, железо, выбор пк, сборка, системные требования, hardware recommendations"
        title="Какой компьютер или ноутбук нужен для работы в программе?"
      >
        <p>
          Иногда мощности текущего устройства оказывается недостаточно для комфортной
          работы в <mark className="app">Adobe After Effects</mark>. В таких случаях
          возникает вопрос — какое устройство подойдёт, чтобы работать с композициями без
          особых проблем?
        </p>
        <Addition type="danger">
          <ul>
            <li>
              В статье приведены лишь общие советы по подбору «железа» для работы в
              творческих программах. Это не руководство к покупке конкретного устройства.
              Окончательное решение — за вами. Если сомневаетесь — спросите совета у
              специалистов или в технических чатах, ссылки на которые есть на{" "}
              <a href="/">главной странице сайта</a>.
            </li>
            <li>
              Тема выбора блоков питания, накопителей, мониторов и другой периферии в этой
              статье не затрагивается.
            </li>
          </ul>
        </Addition>
        <Addition type="info">
          Системные требования для <mark className="app">Adobe After Effects</mark> вы
          можете найти на{" "}
          <a href="https://helpx.adobe.com/after-effects/system-requirements.html">
            официальном сайте Adobe
          </a>
          .
        </Addition>
        <p>
          Прежде чем искать или приобретать новое устройство, определитесь с вашими
          задачами, подумайте, что вам больше подходит — ноутбук<sup>1</sup> или
          стационарный ПК, и выберите удобную для себя операционную систему. Версии{" "}
          <mark className="app">Adobe After Effects</mark> для <mark>Windows</mark> и{" "}
          <mark>macOS</mark> практически не отличаются по функциональности, поэтому
          проекты, созданные в версии для <mark>Windows</mark>, можно спокойно открыть на{" "}
          <mark>macOS</mark>. Однако на <mark>Windows</mark> обычно проще найти «народные»
          версии плагинов и дополнительных инструментов, чем на <mark>macOS</mark>.
        </p>
        <Addition type="info">
          <sup>1</sup> При выборе ноутбука обращайте внимание на диагональ дисплея:
          работать в <mark className="app">Adobe After Effects</mark> на 16 дюймах и
          больше значительно удобнее, чем на 14 и меньше.{" "}
          <i style={{opacity: "0.5"}}>
            Однако большие ноутбуки не всегда удобно носить с собой.
          </i>
        </Addition>
        <p>
          Для быстрой работы в <mark className="app">Adobe After Effects</mark> важно
          обратить внимание на три с половиной ключевых компонента устройства — мощный
          процессор, достаточный объём оперативной памяти и быстрый накопитель. Оставшаяся
          половинка — видеокарта. Она также влияет на производительность, но не всегда.{" "}
          <i style={{opacity: "0.5"}}>
            О ней подробнее поговорим в отдельной статье о производительности программы.
          </i>
        </p>
        <Divider>Рекомендации по комплектующим для стационарного ПК на Windows</Divider>
        <ul>
          <li>
            Для начала стоит определиться с вашими предпочтениями в мире процессоров —{" "}
            <mark>Intel Core</mark> или <mark>AMD Ryzen</mark>. Существенной разницы между
            ними нет: оба «лагеря» подходят для работы в творческих программах. Но важно
            помнить: процессор является ключевым комплектующим в сборке для{" "}
            <mark className="app">Adobe After Effects</mark>, поэтому выбирайте достаточно
            производительный вариант. Чем он мощнее, тем быстрее будут рендериться кадры в
            программе.
            <ul>
              <li>
                <p>
                  Процессоры от <mark className="company">Intel</mark> лучше подходят для
                  работы с видеоисходниками в кодеках <mark className="video">H.264</mark>{" "}
                  и <mark className="video">H.265</mark> за счёт встроенного видеоядра,
                  отвечающего за декодирование. Если вы собираете новый стационарный ПК —
                  лучше собирать на актуальных сокетах <mark>LGA 1700</mark> или{" "}
                  <mark>LGA 1851</mark>.
                </p>
                <p>
                  В качестве бюджетного варианта можно выбрать{" "}
                  <mark className="copy">Intel Core i5-13600K</mark> или{" "}
                  <mark className="copy">Intel Core i5-14600K</mark>. В качестве
                  оптимального варианта подойдёт{" "}
                  <mark className="copy">Intel Core Ultra 265K</mark> или{" "}
                  <mark className="copy">Intel Core i7-14700K</mark>.
                </p>
                <Addition type="warning">
                  <ul>
                    <li>
                      Процессоры <mark>Intel Core</mark> 13-го и 14-го поколений были
                      известны проблемами со стабильностью, возникавшими в ранних партиях.
                      Это связано с повышенным рабочим напряжением, которое процессор сам
                      запрашивает, что может приводить к быстрому износу и даже деградации
                      до неработоспособного состояния.{" "}
                      <mark className="company">Intel</mark> выпустила несколько
                      обновлений прошивок для производителей материнских плат и
                      утверждает, что проблема деградации исправлена.
                    </li>
                    <li>
                      Не рекомендуется брать процессоры{" "}
                      <mark className="company">Intel</mark> без встроенного видеоядра, с
                      суффиксом <mark>F</mark> или <mark>KF</mark>, даже если кто-то
                      убеждает обратное.
                      <a href="https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D1%80%D0%BA%D0%B8%D1%80%D0%BE%D0%B2%D0%BA%D0%B0_%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D1%80%D0%BE%D0%B2_%D1%84%D0%B8%D1%80%D0%BC%D1%8B_Intel">
                        Подробнее о маркировке процессоров Intel...
                      </a>
                    </li>
                  </ul>
                </Addition>
              </li>
              <li>
                <p>
                  Процессоры от <mark className="company">AMD</mark> тоже хороши за счёт
                  отличного соотношения цены и производительности на ядро, если вы
                  создаёте композиции с нуля без частого использования видеоисходников. На
                  сегодняшний день платформа <mark>AM4</mark> уже неактуальна, поэтому,
                  если вы собираете новый системный блок на{" "}
                  <mark className="company">AMD</mark>, собирайте сразу на платформе{" "}
                  <mark>AM5</mark>.
                </p>
                <p>
                  В качестве бюджетного варианта можно взять практически любой процессор с
                  6 ядрами или больше, например{" "}
                  <mark className="copy">AMD Ryzen 5 7500F</mark> или{" "}
                  <mark className="copy">AMD Ryzen 7 7700</mark>. Оптимальным выбором
                  будет <mark className="copy">AMD Ryzen 9 7900X</mark> или мощнее.
                </p>
              </li>
            </ul>
          </li>
          <li>
            Теперь об оперативной памяти. Многие пользователи{" "}
            <mark className="app">Adobe After Effects</mark> знают, что программа любит
            потреблять много оперативной памяти, поэтому для комфортной работы потребуется
            как минимум <mark>32 ГБ</mark> оперативной памяти типа <mark>DDR5</mark>, а
            ещё лучше — <mark>64 ГБ</mark> или больше.
            <Addition type="info">
              Рекомендуется <a href="#configure-swapfile">настроить файл подкачки</a>,
              даже если у вас установлено достаточно много оперативной памяти. Это
              позволит вам реже видеть ошибки о его нехватке, например{" "}
              <mark className="warning">«Out of Memory»</mark>.
            </Addition>
          </li>
          <li>
            Что касается видеокарты, <mark className="app">Adobe After Effects</mark>{" "}
            может задействовать её не во всех сценариях, даже если везде включено
            аппаратное ускорение. А вот выбор ускорителя уже зависит от вашего бюджета:
            для старта подойдёт <mark className="copy">NVIDIA RTX 4060 Ti</mark> или{" "}
            <mark className="copy">NVIDIA RTX 5060 Ti</mark> с <mark>16 ГБ</mark>{" "}
            видеопамяти или, при ограниченном бюджете —{" "}
            <mark className="copy">NVIDIA RTX 3060</mark> с <mark>12 ГБ</mark>. На момент
            написания статьи оптимальным вариантом по соотношению
            «цена–производительность» для работы в программах, требующих видеокарту, можно
            считать <mark className="copy">NVIDIA RTX 5070 Ti</mark>.
            <Addition type="danger">
              <p>
                Видеокарты от <mark className="company">AMD</mark> считаются не лучшим
                вариантом для серьёзной работы в <mark className="company">Adobe</mark> и
                других творческих программах. Поддержка у них слабее, и многие эффекты с
                поддержкой аппаратного ускорения могут работать нестабильно.
              </p>
              <p>
                В последние годы разработчики начали адаптировать свои эффекты под{" "}
                <mark className="company">AMD</mark> — например,{" "}
                <mark className="company">Boris FX</mark> с пакетом{" "}
                <mark className="plugin">Sapphire</mark>. Но общее положение всё ещё в
                пользу <mark className="company">NVIDIA</mark>: под их видеокарты
                оптимизировано значительно больше плагинов.
              </p>
            </Addition>
          </li>
        </ul>
        <Divider>Рекомендации по ноутбукам на Windows</Divider>
        <ul>
          <li>
            Если у вас нет стационарного компьютера и вы не планируете его покупать, так
            как часто работаете с серьёзными проектами вне дома или много переезжаете, при
            наличии солидного бюджета — стоит обратить внимание на мощные портативные
            модели с дискретными видеокартами от <mark className="company">NVIDIA</mark>,
            например <mark className="copy">Lenovo ThinkBook 16p</mark>,{" "}
            <mark className="copy">ASUS Zephyrus</mark> или{" "}
            <mark className="copy">Honor MagicBook Pro 16</mark>.
            <Addition type="warning">
              <ul>
                <li>
                  Модели с дискретными видеокартами{" "}
                  <mark className="company">NVIDIA</mark> вроде{" "}
                  <mark className="copy">RTX 5060</mark> или{" "}
                  <mark className="copy">RTX 4050</mark> стоит выбирать с осторожностью: в
                  некоторых бюджетных ноутбуках процессор может быть слабым, а теплопакет
                  для комплектующих урезан, из-за чего реальная мощность может оказаться
                  ниже потенциальной.
                </li>
                <li>
                  Производительные ноутбуки могут быть тяжелее и быстрее разряжаться, чем
                  среднебюджетные ультрабуки.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            Если у вас уже есть мощный стационарный компьютер, но иногда требуется внести
            правки «на ходу» или быстро собрать проект, а финальный рендер всё равно
            выполняется на основной машине, можно рассмотреть ноутбук без дискретной
            видеокарты. Для таких задач не обязательно покупать «игровую» модель.
            Подойдут, например, <mark className="copy">ASUS Vivobook Pro</mark> или{" "}
            <mark className="copy">Lenovo ThinkBook 16+</mark> в комплектации с{" "}
            <mark>32 ГБ</mark> оперативной памяти на <mark>AMD Ryzen</mark> или{" "}
            <mark>Intel Core</mark>
            <sup>1</sup>.
            <Addition type="warning">
              <ul>
                <li>
                  <sup>1</sup> Некоторые сторонние эффекты, например{" "}
                  <mark className="plugin">Element 3D</mark> или{" "}
                  <mark className="plugin">Dehancer Pro</mark> могут некорректно работать
                  на встроенных в процессор видеочипах <mark>Intel HD Graphics</mark> и{" "}
                  <mark>Intel Arc</mark> из-за отсутствия их поддержки со стороны
                  разработчиков этих эффектов. Встроенные видеочипы от{" "}
                  <mark className="company">AMD</mark> в плане поддержки некоторых
                  сторонних эффектов выглядят выигрышнее.
                </li>
                <li>
                  Если вам важна точность цветопередачи, внимательно изучайте
                  характеристики экрана. В бюджетных моделях матрицы могут показывать
                  ограниченный цветовой диапазон и не покрывать{" "}
                  <mark className="copy">100% sRGB</mark>. Также обратите внимание на
                  максимальную яркость: для комфортной работы в условиях яркого освещения
                  она должна быть не ниже <mark>400 кд/м²</mark>.
                </li>
                <li>
                  Не стоит брать ноутбуки на <mark>Windows</mark> с процессорами{" "}
                  <mark>Snapdragon X Elite</mark>, которых пока мало в продаже. Это
                  архитектура <mark>ARM</mark>, а не привычная <mark>X86-64</mark> — и
                  далеко не все творческие программы под неё адаптированы. Хоть и
                  существует прослойка <mark className="app">Windows Prism</mark>,
                  позволяющая запускать приложения для <mark>X86-64</mark> на{" "}
                  <mark>ARM</mark>, но стабильность и скорость через неё заметно уступают
                  нативной производительности программ.
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <Divider>Рекомендации по устройствам на macOS</Divider>
        <ul>
          <li>
            Если вы хотите взять первый ноутбук от <mark>Apple</mark> или переехать с{" "}
            <mark>MacBook</mark> на базе <mark className="company">Intel</mark> —
            посмотрите в сторону <mark className="copy">MacBook Air</mark> на процессоре{" "}
            <mark>Apple M4</mark> или <mark className="copy">MacBook Pro</mark> на
            процессоре <mark>Apple M1 Pro</mark> или мощнее. Рекомендуется выбрать
            комплектацию с минимум <mark>16 ГБ</mark> оперативной и <mark>512 ГБ</mark>{" "}
            постоянной памяти.
            <Addition type="warning">
              <ul>
                <li>
                  Работа в <mark className="app">Adobe After Effects</mark> и подобных
                  программах с <mark>8 ГБ</mark> оперативной памяти будет тяжеловатой,
                  несмотря на то, что <mark>macOS</mark> старается эффективно распределять
                  память с помощью собственного кэша.
                </li>
                <li>
                  Современные <mark className="copy">MacBook Air</mark> не имеют
                  вентиляторов и охлаждаются лишь пассивным охлаждением, поэтому при
                  долгом рендере или при работе со сложными проектами ноутбук начнёт
                  сбрасывать мощность, чтобы избежать перегрева.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            Если вы нечасто путешествуете, хотите миниатюрный компьютер или ноутбуки{" "}
            <mark>MacBook</mark> оказались для вас слишком дорогими или бессмысленными —
            вам может подойти <mark className="copy">Mac Mini</mark> на процессоре{" "}
            <mark>Apple M4</mark> или мощнее или <mark className="copy">Mac Studio</mark>{" "}
            с <mark>Apple M1 Max</mark> или мощнее. Их стоит приобретать, если у вас уже
            имеется на рабочем столе хороший монитор, клавиатура и мышь. Из комплектации
            также рекомендуется брать минимум <mark>16–24 ГБ</mark> оперативной и{" "}
            <mark>512 ГБ</mark> постоянной памяти.
          </li>
        </ul>
        <Divider>Дополнительная информация для самостоятельных размышлений</Divider>
        <div className="flexible-links">
          <a href="https://www.pugetsystems.com/solutions/video-editing-workstations/adobe-after-effects/hardware-recommendations/">
            Рекомендации по железу от Puget Systems
          </a>
          <a href="https://helpx.adobe.com/premiere-pro/kb/hardware-recommendations.html">
            Рекомендации по оборудованию от Adobe
          </a>
          <a href="https://www.pugetsystems.com/labs/articles/what-h-264-and-h-265-hardware-decoding-is-supported-in-premiere-pro-2120/">
            Какое «железо» поддерживает аппаратное ускорение H.264 и H.265?
          </a>
        </div>
        <ContentFigure
          caption="Лучшее «железо» для моушн-дизайна"
          src="x0YNsn4TtGM"
          type="youtube"
        />
        <ContentFigure
          caption="Производительность Adobe After Effects: речь не о мощных компьютерах"
          src="sjxG4clyMEs"
          type="youtube"
        />
        <ContentFigure
          caption="Как выбрать ноутбук или ПК для Adobe After Effects?"
          src="wdXf4ngU4fM"
          type="youtube"
        />
        <ContentFigure
          caption="Собираем самый быстрый компьютер (НА МОМЕНТ 2019 ГОДА) для Adobe After Effects"
          src="8_xmXM_XMS4"
          type="youtube"
        />
        <ContentFigure
          caption="M4 Max / Pro против всех поколений - что взять в 2025?"
          src="bbcnEiu02uc"
          type="youtube"
        />
      </DetailsSummary>
      <DetailsSummary
        anchor="choose-ae-version"
        tag="версия программы для старых устройств"
        title="Какая версия программы считается самой стабильной и какую лучше установить?"
      >
        <Addition type="tldr">
          <ul>
            <li>
              «Самой стабильной» версии <mark className="app">Adobe After Effects</mark>{" "}
              не существует. Если последние версии вас не устраивают, в качестве отправной
              точки можно рассмотреть <mark>24.6</mark> или <mark>23.6</mark>, но не более
              ранние. В то же время не стоит спешить с обновлением сразу после выхода
              крупного релиза — в нём могут встречаться проблемы, которые исправляют в
              последующих обновлениях.
            </li>
            <li>
              Аналогично, нет и «самой быстрой» версии. Скорость работы зависит от
              сложности проекта и «железа» устройства, однако на одном и том же проекте
              новые версии программы могут рендерить композицию быстрее за счёт{" "}
              <mark className="select">«Multi-Frame Rendering»</mark>.
            </li>
          </ul>
        </Addition>
        <p>
          На этот вопрос нет однозначного ответа, и он останется предметом вечных дебатов
          в чатах и на форумах. Причина — в огромном разбросе мнений пользователей,
          которые работают в разных сценариях, на разном «железе» и с кучей сторонних
          плагинов, за которые <mark className="company">Adobe</mark> не отвечает. У
          кого-то программа летает, а у кого-то тормозит на ровном месте даже со всеми
          «оптимизациями».
        </p>
        <p>
          Если вы надеетесь найти здесь «чудо-версию», которая будет работать идеально на
          любом устройстве, то вынужден вас разочаровать — такой просто нет. Сам по себе
          выбор сборки почти не влияет на производительность. Устанавливая старую версию,
          вы лишаете себя новых функций и исправлений багов ради сомнительного
          «преимущества», которое на практике ничего не даёт. Единственный реальный повод
          ставить старую версию — это необходимость открыть проект, созданный в ней. Во
          всех остальных случаях основывайте выбор на своём опыте, а не на советах с
          форумов.
        </p>
        <Divider>Ссылки на патчноуты от Adobe</Divider>
        <p>
          К слову, список обновлений, нововведений и исправлений в последних версиях{" "}
          <mark className="app">Adobe After Effects</mark> вы всегда можете посмотреть на
          официальном сайте <mark className="company">Adobe</mark> для того, чтобы не
          спрашивать <mark className="quote">«А что нового появилось?»</mark> в чатах и на
          форумах.
        </p>
        <div className="flexible-links">
          <a href="https://helpx.adobe.com/after-effects/using/whats-new.html">
            Что нового в последних выпусках
          </a>
          <a href="https://helpx.adobe.com/after-effects/kb/fixed-issues.html">
            Список исправленных ошибок
          </a>
          <a href="https://helpx.adobe.com/after-effects/kb/known-issues-after-effects.html">
            Выявленные неполадки
          </a>
          <a href="https://helpx.adobe.com/after-effects/system-requirements.html">
            Системные требования для программы
          </a>
        </div>
        <Divider>Рекомендации по выбору версии</Divider>
        <p>
          Несмотря на то, что «идеальной» версии не существует, вот несколько рекомендаций
          для тех, кто по каким-либо причинам не может сделать выбор.
        </p>
        <ul>
          <li>
            Если вы нечасто работаете в программе, любите новые функции или стабильность
            работы для вас не в приоритете — попробуйте воспользоваться{" "}
            <a href="https://helpx.adobe.com/after-effects/using/whats-new.html">
              последней
            </a>{" "}
            версией <mark className="app">Adobe After Effects</mark>, особенно если вы
            хотите перейти с предыдущих версий.
            <Addition type="warning">
              Имейте в виду, что для установки последних версий{" "}
              <mark className="app">Adobe After Effects</mark> требуется{" "}
              <mark>Windows 10</mark> версии <mark>22H2</mark> или <mark>Windows 11</mark>{" "}
              — на более ранние сборки программа просто не установится или будет работать
              некорректно. Узнать текущую версию вашей ОС можно с помощью{" "}
              <mark className="app">winver</mark>.
            </Addition>
          </li>
          <li>
            Если вам нужна более проверенная пользователями и относительно современная
            версия — попробуйте <mark>24.6</mark> (2024) или <mark>23.6</mark> (2023).
            <Addition type="info">
              Современное оборудование требует более свежей версии{" "}
              <mark className="app">Adobe After Effects</mark>. Если вы установите на
              новое устройство старую версию программы, вы можете столкнуться с проблемами
              аппаратного ускорения или непредвиденными сбоями.
            </Addition>
          </li>
          <li>
            Если процессор вашего устройства не поддерживает{" "}
            <a href="https://www.youtube.com/watch?v=1IAwkEdRZZw">инструкции AVX2</a> — вы
            можете установить версию <mark>23.6</mark> (2023) или <mark>24.0</mark>{" "}
            (2024).
            <Addition type="warning">
              Если вы попытаетесь обойти требования к установке версии <mark>24.1</mark>{" "}
              или новее на неподдерживаемом процессоре, скорее всего, вы столкнётесь с
              ошибкой <mark className="code">0xc0000142</mark> при запуске программы.
              Обойти это нельзя — придётся раскошелиться на новый процессор с поддержкой
              инструкций <mark>AVX2</mark>.
            </Addition>
          </li>
          <li>
            Если вы используете устройство на <mark>Windows 7</mark> или{" "}
            <mark>Windows 8.1</mark> — установите версию <mark>16.1</mark> (2019) или{" "}
            <mark>15.1</mark> (2018). Более свежую версию установить не получится из-за
            окончания официальной поддержки этих операционных систем компаниями{" "}
            <mark className="company">Adobe</mark> и <mark>Microsoft</mark>.
            <Addition type="danger">
              <ul>
                <li>
                  Если вы попытаетесь обойти требования к установке или запустить
                  программу на старой операционной системе, вероятность успешного запуска
                  крайне мала, так как, скорее всего, вы столкнётесь с различными
                  ошибками, которые решаются только установкой более свежей версии{" "}
                  <mark>Windows</mark>.
                </li>
                <li>
                  Если программа более свежей версии, чем <mark>16.1</mark>, всё же
                  запустилась на неподдерживаемой операционной системе — её стабильная
                  работа не гарантируется!
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <Divider>Как переехать с одной версии на другую?</Divider>
        <Addition type="danger">
          Не стоит спешить с обновлением программы, если вы на момент чтения этой статьи
          работаете над большим проектом. При установке новой версии{" "}
          <mark className="app">Adobe After Effects</mark> есть риск, что что-то сломается
          или начнёт работать иначе. Обновление лучше выполнять в том случае, когда у вас
          сроки для сдачи не «горят» или вы на данный момент не работаете над серьёзным
          проектом.
        </Addition>
        <p>
          При переходе с одной версии <mark className="app">Adobe After Effects</mark> на
          другую в пределах «одного года», например с <mark>24.1</mark> на{" "}
          <mark>24.6</mark> — переносить какие-то файлы и выполнять лишние телодвижения не
          нужно. Установщик в таком случае перезапишет старые файлы программы, не затронув
          пользовательские данные, в том числе установленные плагины, а при запуске
          обновлённой версии <mark className="app">Adobe After Effects</mark> вам
          предложат перенести настройки со старой версии в новую.
        </p>
        <p>
          Но если вы решили обновить программу, переходя на «другой год», например, с{" "}
          <mark>23.6</mark> на <mark>25.2</mark>, потребуется ручной перенос
          пользовательских файлов в новую версию, включая сторонние эффекты и пресеты. При
          установке версии «другого года» старая версия программы останется на вашем
          устройстве и не будет автоматически удалена.{" "}
          <a href="#update-app">Подробнее о переносе...</a>
        </p>
        <Addition type="info">
          Не забывайте своевременно обновлять сторонние плагины и поддерживать
          операционную систему в хорошем состоянии, периодически очищая её от мусора и
          устанавливая свежие драйвера на «железо». Устанавливая свежие версии{" "}
          <mark className="app">Adobe After Effects</mark>, но не обновляя различные
          дополнения для него, вы рискуете столкнуться с необъяснимыми проблемами.{" "}
          <i style={{opacity: "0.5"}}>
            Именно такие несостыковки часто становятся причиной путаницы в обсуждениях на
            форумах или в чатах, когда один говорит, что всё работает, а у другого — всё
            разваливается.
          </i>
        </Addition>
        <Divider>
          Проверяем миф о производительности, зависящей от версии программы
        </Divider>
        <p>
          Проверим самый популярный миф, который гласит, что старые версии{" "}
          <mark className="app">Adobe After Effects</mark> рендерят быстрее и работают
          стабильнее, чем новые. Что до стабильности — тут ещё можно поспорить, всё
          зависит от проекта. А вот с производительностью — я категорически не согласен,
          даже если меня пытаются убедить с пеной у рта в обратном.
        </p>
        <p>
          Чтобы это доказать, проведём эксперимент на виртуальной машине с «облегчённой»
          сборкой <mark>Windows 11 24H2</mark>. Выделим ей <mark>16 ГБ</mark> оперативной
          памяти и 8 ядер процессора <mark>Intel Core Ultra 7 255H</mark>
          <sup>1</sup> без аппаратного ускорения. Затем установим разные версии{" "}
          <mark className="app">Adobe After Effects</mark>, на которых и будем проверять
          скорость рендера: <mark>13.2</mark> (CC 2014), <mark>15.1.2</mark> (CC 2018),{" "}
          <mark>17.7</mark> (2020), <mark>23.6</mark> (2023) и <mark>25.4</mark> (2025).
        </p>
        <Addition type="info">
          <sup>1</sup> Несмотря на то, что это процессор для ноутбуков, для чистоты
          эксперимента на хост-системе были сняты все лимиты энергопотребления и включён
          режим максимальной производительности. Ноутбук работал от сети, а его система
          охлаждения — на полную мощность, без препятствий для потока воздуха. На
          виртуальной машине частота процессора составила стабильные <mark>3,69 ГГц</mark>{" "}
          без резких скачков и «троттлинга» во время тестов рендеринга, хотя хостовая
          система могла выдать и больше производительности. Но это наоборот сыграет на
          руку, чтобы результаты не сильно отличались друг от друга.
        </Addition>
        <p>
          Тестировать будем на{" "}
          <a href="https://aeplug.ru/forum/viewtopic.php?t=818">старом проекте</a> от{" "}
          <mark className="user">AEPlug</mark>, который одинаково хорошо подходит и для
          старых, и для новых версий. Его ключевая особенность — он почти не задействует
          аппаратное ускорение, нагружая в основном процессор и оперативную память. К тому
          же в нём — только стандартные эффекты. Поэтому, к сожалению, миф о
          производительности сторонних плагинов, а также быстродействие интерфейса и общую
          отзывчивость программы этим тестом мы не развеем.
        </p>
        <p>
          Для «честного» сравнения в первом раунде в версии <mark>13.2</mark> (CC 2014)
          отключим <mark className="select">«Multiprocessing»</mark>, а в{" "}
          <mark>23.6</mark> (2023) и <mark>25.4</mark> (2025) —{" "}
          <mark className="select">«Multi-Frame Rendering»</mark>. Также во всех версиях
          отключим дисковый кэш. В настройках каждой программы выделим <mark>12 ГБ</mark>{" "}
          оперативной памяти, а остальные параметры оставим по умолчанию.
        </p>
        <ContentFigure
          caption="Виртуальная машина"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/ae_version_test.png"
          theme="light"
          type="image"
          variant="windows"
        />
        <p>
          Почему эксперимент идёт не на реальном «железе»? Во-первых, мне просто влом
          потом вычищать основную систему от «хвостов». А во-вторых — так мы минимизируем
          расхождения в результатах из-за разницы в «железе», драйверах и поддержке тех
          или иных функций аппаратного ускорения. Экспортировать будем через{" "}
          <mark className="plugin">Quicktime</mark> в кодеке{" "}
          <mark className="video">GoPro Cineform</mark>.
        </p>
        <ul>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>13.2</mark> (CC 2014) —
            7 минут 33 секунды. С включённым{" "}
            <mark className="select">«Multiprocessing»</mark> — 6 минут 3 секунды.
            <ContentFigure
              caption="Время экспорта"
              // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
              src="images/legacy/aftereffects/render_time_cc2014.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>15.1.2</mark> (CC 2018)
            — 7 минут 27 секунд.
            <ContentFigure
              caption="Время экспорта"
              // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
              src="images/legacy/aftereffects/render_time_cc2018.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>17.7</mark> (2020) — 8
            минут 34 секунды.
            <ContentFigure
              caption="Время экспорта"
              // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
              src="images/legacy/aftereffects/render_time_2020.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>23.6</mark> (2023) — 8
            минут 15 секунд без <mark className="select">«Multi-Frame Rendering»</mark>.
            <ContentFigure
              caption="Время экспорта"
              // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
              src="images/legacy/aftereffects/render_time_2023.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
          <li>
            <mark className="app">Adobe After Effects</mark> <mark>25.4</mark> (2025) — 8
            минут 18 секунд без <mark className="select">«Multi-Frame Rendering»</mark>.
            <ContentFigure
              caption="Время экспорта"
              // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
              src="images/legacy/aftereffects/render_time_2025.png"
              theme="light"
              type="image"
              variant="windows"
            />
          </li>
        </ul>
        <p>
          После долгих рендеров результат поразил: версии <mark>13.2</mark> и{" "}
          <mark>15.1.2</mark> действительно превзошли более свежие. Казалось бы, всё,
          вопрос можно закрывать: старые версии реально быстрее, а автора нужно посадить
          на кол за то, что он не разбирается в производительности{" "}
          <mark className="app">Adobe After Effects</mark>. Но есть один нюанс: как я и
          говорил, первые тесты шли без многокадрового рендеринга.
        </p>
        <p>
          Стоит почистить кэш, перезапустить программу, включить{" "}
          <mark className="select">«Multi-Frame Rendering»</mark> в версиях{" "}
          <mark>23.6</mark> и <mark>25.4</mark> и запустить экспорт заново, как результат
          снова поражает, но уже не в пользу старичков: 4 минуты 53 секунды и 3 минуты 49
          секунд соответственно. Версия <mark>13.2</mark> (CC 2014) даже с включенным{" "}
          <mark className="select">«Multiprocessing»</mark> и рядом не стояла со своими 6
          минутами и 3 секундами.
        </p>
        <p>
          И что удивительно, потребление оперативной памяти во всех версиях было примерно
          одинаковым и не выходило за пределы ограничения оперативной памяти в{" "}
          <mark>12 ГБ</mark>. Так что даже настроенный файл подкачки за кадром в этом
          тесте на скорость рендера особой роли не сыграл.
        </p>
        <p>
          Какой вывод можно сделать из этого «странного» теста? По-моему, все эти
          разговоры о том, что старые версии{" "}
          <mark className="app">Adobe After Effects</mark> рендерят композиции быстрее
          новых, — не более чем эффект плацебо. Впрочем, такие мнения имеют место быть, но
          лишь в одном случае: если ваше железо просто не соответствует системным
          требованиям свежих версий программы или морально устарело.
        </p>
      </DetailsSummary>
      <DetailsSummary
        anchor="about-app-performance"
        tag="тормозит, ускорить работу, оптимизация, увеличить скорость рендера, лаги, медленно работает, низкая скорость, производительность, применение эффектов, системные требования, артефакты, искажения, потребление оперативной памяти"
        title="Почему у меня, б%@#ь, лагает е&#!%й Adobe After Effects, с$%а?"
      >
        <Addition type="tldr">
          Эта статья — чек-лист для диагностики «тормозов» в{" "}
          <mark className="app">Adobe After Effects</mark>. Здесь вы не найдёте
          «чудо-кнопку», устраняющую все проблемы с производительностью, но
          последовательная проверка по пунктам поможет выявить и устранить их причину.
        </Addition>
        <p>
          Да, это тот самый риторический вопрос, который успел всем поднадоесть, но всё
          равно не даёт покоя некоторым пользователям, особенно новичкам.
          Производительность проекта в <mark className="app">Adobe After Effects</mark>{" "}
          чаще всего зависит от двух факторов — мощности устройства и действий самого
          пользователя.
        </p>
        <p>
          В этой статье разберём обе категории и посмотрим, как снизить риск всевозможных
          «тормозов» и лагов. Надеюсь, вы вынесете из неё что-то полезное для оптимизации
          программы и проекта.
        </p>
        <Divider>Раздел 1: Быстрые проверки и настройки программы</Divider>
        <p>
          Начнём с самых простых и популярных действий, которые иногда помогают быстро
          избавиться от «тормозов» и переполнения оперативной памяти, не внося серьёзных
          правок в проект.
        </p>
        <Divider>Кэшируем предпросмотр, прежде чем его проиграть</Divider>
        <p>
          Часто предпросмотр тормозит, потому что{" "}
          <mark className="app">Adobe After Effects</mark> по умолчанию пытается
          воспроизводить видео в реальном времени и не успевает просчитывать эффекты. Это
          и вводит в ступор некоторых пользователей, особенно новичков.
        </p>
        <p>
          В отличие от классических нелинейных редакторов, таких как{" "}
          <mark className="app">Adobe Premiere Pro</mark> или{" "}
          <mark className="app">DaVinci Resolve</mark>,{" "}
          <mark className="app">Adobe After Effects</mark> изначально не рассчитан на
          предпросмотр в реальном времени, особенно если у вас применено много эффектов в
          композиции. Поэтому кадры следует кэшировать заранее, даже если вы просто
          проигрываете слой с видео. Программа всё равно преобразует кадры вашей
          композиции в внутренний формат для воспроизведения.
        </p>
        <p>
          Чтобы проиграть предпросмотр без «тормозов», включите кэширование перед
          воспроизведением. Для этого откройте окно{" "}
          <mark className="select">«Window» → «Preview»</mark> и установите в нём чекбоксы{" "}
          <mark className="select">«Cache Before Playback»</mark> и{" "}
          <mark className="select">«If caching, play cached frames»</mark>.
        </p>
        <ContentFigure
          caption="Preview"
          imgTitle="Включение кэширования предпросмотра"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/preview_caching.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <p>
          После этого при первом нажатии на <mark className="key">Space</mark> программа
          сначала просчитает кадры, а затем воспроизведёт их из кэша. Повторное нажатие{" "}
          <mark className="key">Space</mark> прервёт кэширование и сразу запустит
          воспроизведение уже закэшированных кадров.
        </p>
        <Divider>Снижаем качество предпросмотра</Divider>
        <p>
          Для дополнительного ускорения работы можно временно снизить качество картинки в
          окне композиции или на панели <mark className="select">«Preview»</mark>.
          Переключение разрешения на <mark className="select">«Half»</mark>,{" "}
          <mark className="select">«Third»</mark> или{" "}
          <mark className="select">«Quarter»</mark> снизит нагрузку на систему и ускорит
          отзывчивость интерфейса.
        </p>
        <ContentFigure
          caption="Изменение разрешения предпросмотра"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/change_preview_resolution.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <p>
          Также не стоит оставлять режим <mark className="select">«Auto»</mark>: из-за
          него постоянно «скачет» и качество предпросмотра, и скорость рендера кадров.
        </p>
        <Addition type="warning">
          Учтите, что при пониженном разрешении некоторые эффекты могут отображаться
          иначе, чем в полном качестве — например,{" "}
          <mark className="plugin">CC Particle World</mark> или{" "}
          <mark className="plugin">S_LensFlare</mark>.
        </Addition>
        <Divider>Настраиваем адаптивное разрешение</Divider>
        <p>
          По умолчанию в <mark className="app">Adobe After Effects</mark> включена функция
          адаптивного разрешения: при перемещении плейхеда или слоя качество предпросмотра
          временно снижается для быстрого рендера кадра. Если эта функция вас раздражает
          или, по-вашему, снижает отзывчивость программы, её можно отключить — для этого
          нажмите на <mark className="select">«Fast Previews»</mark> под окном
          предпросмотра и выберите <mark className="select">«Off (Final Quality)»</mark>.
        </p>
        <ContentFigure
          caption="Timeline"
          imgTitle="Отключение адаптивного разрешения"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/disable_adaptive_resolution.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <Divider>Очищаем кэш предпросмотра</Divider>
        <p>
          Часто во время работы над проектом можно заметить, что оперативная память почти
          закончилась или дисковый кэш забит. В этот момент программе становится тяжелее
          обрабатывать кадры — ей просто не хватает ресурсов.
        </p>
        <p>
          Зелёная полоса над таймлайном показывает кэш, загруженный в оперативную память,
          а синяя — сохранённый на диске. Благодаря дисковому кэшу программа не
          пересчитывает кадры заново, если они уже были просчитаны и выгружены из памяти.
          Для быстрой работы этого кэша особенно важен быстрый накопитель.
        </p>
        <ContentFigure
          caption="Timeline"
          imgTitle="Демонстрация таймлайна"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/green-blue_lines.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <p>
          Со временем кэш стоит очищать, чтобы освободить место для новых вычислений.
          Сделать это можно через{" "}
          <mark className="select">«Edit» → «Purge» → «All Memory & Disk Cache»</mark>.
          После очистки предпросмотр придётся закэшировать заново.
        </p>
        <ContentFigure
          caption="Очистка кэша и оперативной памяти"
          imgTitle="Очистка кэша и оперативной памяти"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/edit_purge_all-memory-and-disk-cache.png"
          theme="light"
          type="image"
          variant="windows"
        />
        <Divider>Отключаем кэширование при простое</Divider>
        <p>
          Если вам стало сложнее выполнять действия в программе из-за непонятных тормозов,
          возможно, вы не заметили, что в <mark className="app">Adobe After Effects</mark>{" "}
          версии <mark>22.0</mark> (2022) и новее по умолчанию включена функция{" "}
          <mark className="select">«Cache Frames When Idle»</mark>. Она начинает
          кэшировать композицию и заполнять оперативную память и дисковый кэш, когда вы
          ничего не делаете в течение 8 секунд.
        </p>
        <p>
          На слабых устройствах эта функция часто заставляет тормозить программу и
          систему, особенно при большом количестве эффектов, поэтому рекомендую её
          отключить. Для этого достаточно нажать комбинацию клавиш{" "}
          <mark className="key">Alt + Shift + I</mark> или выключить её в меню{" "}
          <mark className="select">«Composition» → «Preview»</mark>.
        </p>
        <ContentFigure
          caption="Adobe After Effects"
          imgTitle="Отключение автоматического кэширования предпросмотра при бездействии"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/disable_idle_cache.png"
          theme="light"
          type="image"
          variant="windows"
        />
        <Divider>Про потребление оперативной памяти</Divider>
        <p>
          Каждый, кто хоть раз работал в <mark className="app">Adobe After Effects</mark>,
          знает не понаслышке: программа обожает оперативную память. Её потребление
          зависит от множества факторов, главные из которых — разрешение композиции и
          глубина цвета. Например, кадр <mark>1920×1080</mark> при <mark>8 битах</mark> на
          канал требует <mark>7,9 МБ</mark>, а кадр <mark>7680×4320</mark> при{" "}
          <mark>16 битах</mark> — уже <mark>253 МБ</mark>. Поэтому при работе с
          композициями высокого разрешения даже <mark>128 ГБ</mark> ОЗУ могут быстро
          закончиться.
        </p>
        <p>
          Но это — всего лишь вес готового кадра в кэше, без учёта его рендера. Чтобы этот
          кадр создать, требуется куда больше ресурсов, а итоговая нагрузка зависит от
          множества деталей: применённых эффектов, типов слоёв, масок, режимов наложения и
          настроек управления цветом. А если у вас ещё и включена функция{" "}
          <mark className="select">«Multi-Frame Rendering»</mark>, которая обрабатывает
          несколько кадров параллельно, то готовьтесь к ещё большему расходу памяти.
        </p>
        <p>
          Кроме того, <mark className="app">Adobe After Effects</mark> делит общий пул
          памяти с другими приложениями <mark className="company">Adobe</mark>. Например,
          запущенный
          <mark className="app">Adobe Premiere Pro</mark> или{" "}
          <mark className="app">Adobe Media Encoder</mark> «откусит» часть ресурсов у{" "}
          <mark className="app">Adobe After Effects</mark>, а их закрытие вернёт её
          обратно.
        </p>
        <Addition type="info">
          Изменить размер общего пула можно в настройках{" "}
          <mark className="select">«Edit» → «Preferences» → «Memory & Performance»</mark>{" "}
          через параметр{" "}
          <mark className="select">«RAM reserved for other applications»</mark>. Главное —
          не путать его назначение: он отвечает не за то, сколько памяти получат программы{" "}
          <mark className="company">Adobe</mark>, а за то, сколько останется для сторонних
          приложений.
        </Addition>
        <p>
          Когда оперативной памяти начинает не хватать,{" "}
          <mark className="app">Adobe After Effects</mark> выгружает старые кэшированные
          кадры, а при включённом дисковом кэше — сохраняет их на диск. Причём начиная с
          версии <mark>25.2</mark>, опция{" "}
          <mark className="select">«Enable Preview from Disk Cache»</mark> позволяет
          воспроизводить предпросмотр напрямую с диска, не загружая кадры в ОЗУ, что
          особенно полезно для проигрывания предпросмотра длинных композиций.
        </p>
        <Addition type="warning">
          При использовании дискового кэша есть шанс появления визуальных артефактов,
          таких как перемешанные или чёрные кадры.
        </Addition>
        <Addition type="info">
          <ul>
            <li>
              <sup>1</sup> Для эффективной работы с дисковым кэшем необходим быстрый SSD.
            </li>
            <li>
              Настроить параметры дискового кэша можно в{" "}
              <mark className="select">
                «Edit» → «Preferences» → «Media & Disk Cache»
              </mark>
              .
            </li>
          </ul>
        </Addition>
        <ContentFilter
          windowsContent={
            <div>
              <p>
                Также для стабильной работы в{" "}
                <mark className="app">Adobe After Effects</mark> рекомендуется включить и
                настроить <a href="#configure-swapfile">файл подкачки</a>. Некоторые
                горе-сборщики образов <mark>Windows</mark> и «оптимизаторы» системы
                зачем-то отключают эту функцию, из-за чего рядовые пользователи
                сталкиваются с ошибками нехватки памяти, даже когда её вроде бы
                достаточно.
              </p>
              <p>
                Всё дело в том, что программа требует для каждого кадра непрерывный блок
                ОЗУ и не умеет хранить данные фрагментами. Именно эта особенность работы с
                памятью и провоцирует ошибки вроде{" "}
                <mark className="warning">«Out of Memory»</mark> при отключённом файле
                подкачки, а также объясняет резкий рост потребления ресурсов в сложных
                проектах.
              </p>
            </div>
          }
        />
        <Divider>Настраиваем мультикадровый рендер</Divider>
        <p>
          С помощью функции <mark className="select">«Multi-Frame Rendering»</mark> вы
          сможете «приказать» программе использовать весь потенциал процессора за счёт
          рендера нескольких кадров одновременно. В новых версиях{" "}
          <mark className="app">Adobe After Effects</mark> функция{" "}
          <mark className="select">«Multi-Frame Rendering»</mark> включена по умолчанию.
        </p>
        <p>
          Чтобы включить <mark className="select">«Multi-Frame Rendering»</mark>,
          установите чекбокс{" "}
          <mark className="select">«Enable Multi-Frame Rendering»</mark>, а чтобы оставить
          другим программам часть мощности, измените значение{" "}
          <mark className="select">«CPU reserved for other applications»</mark>
          <sup>1</sup> в{" "}
          <mark className="select">«Edit» → «Preferences» → «Memory & Performance»</mark>.
        </p>
        <Addition type="warning">
          <sup>1</sup> Пожалуйста,{" "}
          <b>
            <u>не путайте значения</u>
          </b>{" "}
          и{" "}
          <b>
            <u>внимательно прочтите параметр настройки</u>
          </b>
          . Значение <mark>10%</mark> означает, что{" "}
          <mark className="app">Adobe After Effects</mark> будет использовать{" "}
          <mark>90%</mark> процессора и оставит <mark>10%</mark> для остальных программ.
          Если вы установите значение <mark>70%</mark>, то отдадите программе всего лишь{" "}
          <mark>30%</mark> мощности.
        </Addition>
        <ContentFigure
          caption="Preferences"
          imgTitle="Настройка ограничения процессора при многокадровом рендере"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/mfr_settings.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <p>
          Однако есть случаи, когда эта функция наоборот может мешать стабильному рендеру
          кадров и приводит к увеличению потребления оперативной памяти, что приводит к
          риску чаще видеть ошибку <mark className="warning">«Out of Memory»</mark>. Если
          это ваш случай — можно отключить{" "}
          <mark className="select">«Multi-Frame Rendering»</mark>, либо ограничьте
          использование оперативной памяти, увеличив значение{" "}
          <mark className="select">«RAM reserved for other applications»</mark>.
        </p>
        <Divider>Разбираемся с рабочим пространством</Divider>
        <p>
          Если у вас открыто слишком много окон со сторонними расширениями или скриптами,
          интерфейс <mark className="app">Adobe After Effects</mark> может начать заметно
          «тормозить». Попробуйте закрыть лишние панели с помощью{" "}
          <mark className="select">«Close Panel»</mark> в контекстном меню окна и
          проверьте, какая из них замедляет работу программы.
        </p>
        <ContentFigure
          caption="Закрываем панель стороннего расширения"
          imgTitle="Закрываем панель стороннего расширения"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/close_panel.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <p>
          Чтобы сбросить текущее рабочее пространство, откройте{" "}
          <mark className="select">«Window» → «Workspaces»</mark> и выберите{" "}
          <mark className="select">«Reset to Saved Layout»</mark>. Если сброс не вариант —
          сохраните текущую конфигурацию как новое рабочее пространство или просто
          переключитесь на другое.
        </p>
        <Divider>Раздел 2: Оптимизация проекта и исходников</Divider>
        <p>
          Если быстрая профилактика не помогла, пора заглянуть в сам проект. Проблемы с
          производительностью часто кроются в «кривых» исходниках или перегруженных
          эффектами композициях. И виноват в этом обычно сам пользователь, даже если у
          него мощное «железо».
        </p>
        <p>
          Отсюда и берутся вечные жалобы в духе{" "}
          <mark className="quote">«вчера работало хорошо, а сегодня тормозит»</mark>:
          скорее всего, предыдущий проект «летал» за счет грамотной оптимизации (даже если
          вы над ней не работали), а текущий «ползёт» из-за неподходящих исходников и
          чрезмерного усложнения сцен.
        </p>
        <Divider>Проверяем исходники в проекте</Divider>
        <p>
          В первую очередь стоит обсудить импорт материалов. Довольно часто пользователи
          скачивают файлы из интернета, закидывают их в композиции, а через некоторое
          время замечают странности: появляются артефакты, эффекты работают некорректно
          или резко снижается производительность программы. Да, виновником может быть
          видео, картинка, аудио или даже «кривой» шрифт. Всё дело в том, что не все
          скачанные материалы могут стабильно работать в монтажных программах.
        </p>
        <p>
          Именно в этом кроется причина 90% жалоб: сталкиваясь с «тормозами», пользователи
          часто приводят «железный» аргумент —{" "}
          <mark className="quote">
            «В проигрывателе моё видео нормально играет! Чё программе не нравится?»
          </mark>
          , однако это сравнение не решает проблему. В отличие от «всеядных» плееров,
          например <mark className="app">VLC</mark> или{" "}
          <mark className="app">MPC-HC</mark>,{" "}
          <mark className="app">Adobe After Effects</mark> вынужден «распаковывать» ваш
          исходник и преобразовывать его в свой буфер, похожий на{" "}
          <mark className="video">Lossless</mark>, для хранения в оперативной памяти и
          отображения в предпросмотре.
        </p>
        <p>
          Из-за этого программа может долго обрабатывать видео, запутаться в нестабильном{" "}
          <a href="https://aws.amazon.com/ru/blogs/rus/media-part-1-back-to-basics-gops-explained/">
            потоке кадров
          </a>{" "}
          и выдать артефакты при частом перемещении{" "}
          <mark className="select">«Current Time Indicator»</mark> по таймлайну или
          привести к ситуации{" "}
          <mark className="quote">«вчера работало — сегодня виснет»</mark>.
        </p>
        <p>
          Больше всего проблем вызывают видео, сжатые кодеками для стриминга — например,{" "}
          <mark className="video">H.264</mark> и <mark className="video">H.265</mark>,
          скачанные с <mark className="app">YouTube</mark>,{" "}
          <mark className="app">VK Видео</mark> и похожих платформ. У них часто нет
          «стандарта», гарантирующего стабильность в проекте, поэтому они пережимаются
          по-своему. Их кодируют так, чтобы вы спокойно смотрели видео под пледиком на
          телефоне, а не монтировали его, из-за чего агрессивное межкадровое сжатие вполне
          может привести к багам и нестабильной работе.
        </p>
        <ContentFigure
          caption="Почему некоторые футажи так сложны в редактировании"
          src="cfz3jwdo1v0"
          type="youtube"
        />
        <p>
          Эта проблема решается, как ни странно,{" "}
          <a href="#import-pipeline">конвертацией</a> исходников через{" "}
          <mark className="app">Shutter Encoder</mark>,{" "}
          <mark className="app">Handbrake</mark> или{" "}
          <mark className="app">MKVToolNix</mark> в монтажный кодек вроде{" "}
          <mark className="video">Apple ProRes</mark> или{" "}
          <mark className="video">DNxHD</mark>.
        </p>
        <p>
          Почему в этом списке нет <mark className="app">Adobe Media Encoder</mark>? Дело
          в том, что он использует тот же движок, что и{" "}
          <mark className="app">Adobe After Effects</mark>, и при конвертации вы рискуете
          получить те же артефакты, от которых пытались избавиться.
        </p>
        <p>
          А что такое <mark className="video">монтажный кодек</mark>? Это тип кодеков,
          созданных специально для работы в программах монтажа и композитинга. В отличие
          от кодеков для доставки типа <mark className="video">H.264</mark>, он использует
          внутрикадровое сжатие: каждый кадр в нём — ключевой и независимый. Это избавляет
          процессор от необходимости просчитывать инструкции по перемещению между кадрами
          и сильно снижает нагрузку на систему. Да, после конвертации файлы станут
          тяжелее, зато софт с ними будет работать стабильнее, без лагов
          <sup>1</sup> и внезапных ошибок рендера.
        </p>
        <Addition type="warning">
          <sup>1</sup> Видеофайлы, закодированные в монтажный кодек, лучше хранить на
          скоростном SSD, так как у них обычно очень высокий битрейт и большой размер, что
          требует быстрого накопителя. Иначе даже конвертация от «тормозов» не спасёт.
        </Addition>
        <p>
          Если же размер файла для вас критичен или нужен именно{" "}
          <mark className="video">H.264</mark>, то перекодируйте его через ранее названные
          утилиты — даже если исходник уже был в этом кодеке. Это поможет исправить
          «кривую» структуру <mark>GOP</mark>, характерную для многих видео из интернета.
          Но учтите: без поддержки аппаратного ускорения декодирования{" "}
          <mark className="video">H.264</mark> на вашем процессоре или видеокарте вы вряд
          ли ускорите работу с проектом.
        </p>
        <p>
          А что будет с качеством изображения после конвертации? Если подойти к{" "}
          <a href="#import-pipeline">настройкам кодирования</a> с умом, то разница между
          оригиналом и итоговым файлом будет незаметна при обычном просмотре.
        </p>
        <p>
          Если файл уже был в проекте, после конвертации исходников просто{" "}
          <a href="#replace-footage">замените</a> его через команду{" "}
          <mark className="select">«Replace Footage»</mark>.
        </p>
        <p>Помимо видео, подвох может ждать и в других файлах.</p>
        <ul>
          <li>
            Звук из <mark className="app">VK</mark>,{" "}
            <mark className="app">SoundCloud</mark> или даже аудиодорожка внутри видео
            тоже может быть «криво» пережата. Это проявляется в виде искажений, треска или
            рассинхрона в <mark className="app">Adobe After Effects</mark>, даже если
            внешний проигрыватель играет нормально. Лечится это конвертацией аудиодорожки
            в формат <mark className="audio">WAV</mark> через{" "}
            <mark className="app">Shutter Encoder</mark> или{" "}
            <mark className="app">EZ CD Audio Converter</mark>.
          </li>
          <li>
            С изображениями проблемы возникают реже, но тоже бывают.{" "}
            <mark className="app">Adobe After Effects</mark> «не любит» картинки с
            огромным разрешением, цветовым профилем <mark>CMYK</mark> или слишком
            агрессивным сжатием. В таком случае может помочь конвертация в{" "}
            <mark className="image">PNG</mark> через{" "}
            <mark className="app">FastStone Image Viewer</mark> или{" "}
            <mark className="app">Adobe Photoshop</mark>, а ещё лучше — в формат{" "}
            <mark className="image">TIFF</mark>, так как он легче «переваривается»
            программой.
          </li>
          <li>
            Иногда проект может тормозить из-за «кривых» файлов шрифтов. Если работа с
            текстовыми слоями вызывает лаги, попробуйте переустановить шрифт, скачав его
            из другого источника, или сменить начертание на похожий.
          </li>
        </ul>
        <Divider>Оптимизируем композицию</Divider>
        <p>
          Минздрав обычно предупреждает, что чрезмерное употребление алкоголя вредит
          вашему здоровью. Только вот он забыл упомянуть, что избыточное использование
          эффектов в <mark className="app">Adobe After Effects</mark> также часто
          негативно сказывается на скорости и стабильности рендеринга.
        </p>
        <p>
          Я не шучу: некоторые порой увлекаются эффектами до абсурда — применяют три вида
          свечения, множество «шейков», цветокоррекцию несколькими слоями, а сверху —
          мелкие самодельные частицы, зернистость и размытие из разных пакетов. В
          результате вы получаете «конфликты» эффектов, медленный рендеринг, «фризы» и
          «вылеты».{" "}
          <i style={{opacity: "0.5"}}>
            Зато классный и красивый «эдит» для <mark className="app">TikTok</mark>{" "}
            получился, да?
          </i>
        </p>
        <p>
          Чтобы хоть как-то облегчить «раздутый» проект, воспользуйтесь следующими
          советами.
        </p>
        <ul>
          <li>
            Удалите неиспользуемые элементы из проекта. Это можно сделать с помощью
            функциий <mark className="select">«Remove Unused Footage»</mark> и{" "}
            <mark className="select">«Reduce Project»</mark> в{" "}
            <mark className="select">«File» → «Dependencies»</mark>.
          </li>
          <li>
            <p>
              Не используйте эффекты ради эффектов, чем часто грешат «эдиторы». Перед
              добавлением задайте себе вопрос:{" "}
              <mark className="quote">«Действительно ли он здесь нужен?»</mark>, а затем
              подумайте:{" "}
              <mark className="quote">«Не сломает ли это производительность?»</mark>.
              Иначе вам же потом будет сложнее понять, кто именно вызывает «тормоза».
            </p>
            <Addition type="info">
              Эффекты в окне <mark className="select">«Effect Controls»</mark> применяются
              сверху вниз, и каждый следующий работает с результатом предыдущего. Порядок
              эффектов на слое часто влияет на финальную картинку. Например, если сначала
              наложить размытие, а потом «шейк», по краям слоя может появиться неприятная
              «плитка». А вот если сделать наоборот — слой будет выглядеть нормально.
            </Addition>
          </li>
          <li>
            Используйте менее ресурсоёмкие аналоги или попробуйте пересобрать цепочку
            эффектов. Например, вместо «тяжёлого»{" "}
            <mark className="plugin">Gaussian Blur</mark> попробуйте{" "}
            <mark className="plugin">Fast Box Blur</mark>: он даёт похожий результат, но
            рендерится значительно быстрее.
          </li>
          <li>
            Если один и тот же эффект с одинаковыми настройками нужен нескольким слоям,
            применяйте его к корректирующему слою, а не к каждому по отдельности. Эффект
            подействует на все слои ниже, что упростит управление и сэкономит ресурсы.
          </li>
          <li>
            Если вы не можете избавиться от «тяжёлых» эффектов, например от условного{" "}
            <mark className="plugin">Deep Glow</mark> или размытия в движении, отключайте
            их на время работы над анимацией. Для этого нажмите на иконку{" "}
            <mark className="select">«FX»</mark> рядом с названием эффекта в окне{" "}
            <mark className="select">«Effect Controls»</mark> или на таймлайне.
          </li>
          <li>
            Следите за актуальностью установленных сторонних плагинов. Устаревшие версии
            могут быть не оптимизированы под новые сборки{" "}
            <mark className="app">Adobe After Effects</mark>, что может привести к
            ошибкам, медленному рендеру или даже утечкам оперативной памяти.
          </li>
        </ul>
        <Divider>Анализируем время рендера</Divider>
        <p>
          Если вы не понимаете, какой эффект замедляет рендеринг, вам может помочь функция{" "}
          <mark className="select">«Render Time»</mark>, добавленная в{" "}
          <mark className="app">Adobe After Effects</mark> версии <mark>22.0</mark> (2022)
          и выше. Она работает как профайлер композиции — анализирует, сколько времени
          занимает просчёт каждого эффекта на каждом слое.
        </p>
        <p>
          В нижней части таймлайна, в поле{" "}
          <mark className="select">«Frame Render Time»</mark>, отображается общее время
          рендеринга текущего кадра, а в колонке{" "}
          <mark className="select">«Render Time»</mark> — время просчёта каждого слоя и
          эффекта. Этот инструмент поможет найти самые «тяжёлые» эффекты, которые при
          необходимости можно заменить на более лёгкие аналоги или вовсе удалить.
        </p>
        <ContentFigure
          caption="Timeline"
          imgTitle="Смотрим время рендера слоя"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/view_render_time.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <Addition type="info">
          <ul>
            <li>
              Чтобы включить отображение времени рендеринга, нажмите на иконку улитки в
              левом нижнем углу таймлайна или включите колонку{" "}
              <mark className="select">«Render Time»</mark> через меню{" "}
              <mark className="select">«Columns»</mark>.
            </li>
            <li>
              Для получения точных данных рекомендуется очистить кэш через{" "}
              <mark className="select">«Edit» → «Purge» → «All Memory & Disk Cache»</mark>
              . Иначе для уже отрендеренных кадров вы увидите околонулевые значения.
            </li>
          </ul>
        </Addition>
        <Divider>Проверяем количество слоёв</Divider>
        <p>
          Если на таймлайне в композиции собрано слишком много слоёв, например больше{" "}
          <mark>800</mark>, программа может начать ощутимо тормозить, некорректно
          отрисовывая интерфейс и реагируя на действия с задержкой. Чтобы этого избежать,
          сгруппируйте слои в <mark className="select">«Pre-compose»</mark>: выделите
          нужные и нажмите <mark className="key">Ctrl + Shift + C</mark>.
        </p>
        <p>
          Если же вариант с прекомпозицией вам не подходит, можно скрыть ненужные слои на
          таймлайне кнопкой <mark className="select">«Shy»</mark> — это разгрузит
          интерфейс. Также не забывайте обрезать слои, как только они исчезают из кадра:
          это тоже помогает ускорить просчёт.
        </p>
        <ContentFigure
          caption="Работа со скрытыми слоями"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/toggle_shy.mp4"
          theme="dark"
          type="video"
          variant="windows"
        />
        <p>
          А если в композиции много текстовых слоёв, например для субтитров, лучше
          объединить их в один, а текст менять в нужные моменты с помощью маркеров.
        </p>
        <ContentFigure
          caption="Анимация текста маркерами в Adobe After Effects"
          src="3CHUvo6bWfM"
          type="youtube"
        />
        <Divider>Разбираемся с выражениями</Divider>
        <p>
          Выражения для свойств слоя также могут нагружать систему, даже такие банальные,
          как <mark className="code">wiggle(x,y)</mark> или{" "}
          <mark className="code">time</mark>. Некоторые из них бывают настолько сложными,
          что долго просчитываются и тормозят весь проект.
        </p>
        <p>
          Если результат выражения вас устраивает, и вы не планируете его дальше
          редактировать, его можно «запечь» с помощью{" "}
          <mark className="select">
            «Keyframe Assistant» → «Convert Expression to Keyframes»
          </mark>
          . В результате оно превратится в ключевые кадры.
        </p>
        <ContentFigure
          caption="«Запекание» выражения в ключевые кадры"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/convert_expression_to_keyframes.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <Addition type="info">
          Если после «запекания» вам вдруг понадобилось внести в анимацию правки, просто
          удалите все созданные ключевые кадры и снова включите выражение для нужного
          свойства.
        </Addition>
        <Divider>Создаём прокси для сложных композиций</Divider>
        <p>
          И последнее, но не менее важное:{" "}
          <mark className="app">Adobe After Effects</mark> — это программа для
          композитинга и моушн-дизайна, а не для монтажа двухчасовых фильмов. Она попросту
          не рассчитана на длинные таймлайны, но, к сожалению, не до всех это доходит.
        </p>
        <p>
          Если ваш проект длится дольше 2–5 минут, а переходить в{" "}
          <mark className="app">Adobe Premiere Pro</mark> или{" "}
          <mark className="app">DaVinci Resolve</mark> вы не хотите, разбейте его на
          отдельные, более мелкие композиции. А когда работа над одной из таких сложных
          композиций завершена и вы не планируете её дальше редактировать — создайте для
          неё <a href="#proxy-comp">прокси</a>
          <sup>1</sup>. Так вы «зафиксируете» её состояние, и программе не придётся
          просчитывать композицию заново при каждом воспроизведении на «основном»
          таймлайне.
        </p>
        <Addition type="warning">
          <p>
            <sup>1</sup> Не стоит путать создание прокси с функцией пре-рендера в{" "}
            <mark className="select">«Composition» → «Pre-Render»</mark>. Функция{" "}
            <mark className="select">«Pre-Render»</mark> может заменить вашу прекомпозицию
            видеофайлом, из-за чего вы теряете возможность быстро её редактировать, пока
            не вернёте исходный слой на таймлайн вручную.
          </p>
          <p>
            С прокси таких лишних телодвижений не требуется: после его создания исходная
            композиция остаётся на таймлайне, и вы в любой момент можете вернуться к её
            редактированию, просто отключив прокси в окне{" "}
            <mark className="select">«Project»</mark>.
          </p>
        </Addition>
        <Divider>Пара слов про сторонние шаблоны</Divider>
        <p>
          Многие шаблоны, например с <mark>Envato Elements</mark> и похожих ресурсов,
          нередко перегружены лишними эффектами и слоями, которые тормозят работу. В такой
          ситуации есть три выхода.
        </p>
        <ul>
          <li>
            Найти другой, более оптимизированный и менее «тяжёлый» шаблон, который не
            будет так сильно нагружать систему.
          </li>
          <li>
            Рендерить проект как есть. Если компьютер не справляется, экспорт затягивается
            на долгие часы или вы просто не хотите мучить своё «железо» — попросите помощи
            у коллеги с мощным ПК или воспользуйтесь услугами рендер-ферм<sup>1</sup>.
            <Addition type="warning">
              <sup>1</sup> Учтите: классические «рендер-фермы» часто не имеют в базе
              сторонних плагинов или даже самой{" "}
              <mark className="app">Adobe After Effects</mark>. Поэтому лучше искать
              услугу аренды удалённого рабочего стола. Туда можно установить собственный
              софт и плагины. По цене это может выйти как дороже, так и дешевле аренды
              «рендер-фермы» — зависит от тарифов.
            </Addition>
          </li>
          <li>
            Собрать проект с нуля, визуально повторив нужный дизайн или анимацию. В этом
            случае вы получите чистую и «контролируемую» композицию, однако потратите
            значительно больше времени на реализацию.
          </li>
        </ul>
        <Divider>Пара слов про финальный экспорт</Divider>
        <ul>
          <li>
            Если вы ранее создавали <a href="#proxy-comp">прокси</a> для композиций, не
            забудьте включить опцию <mark className="select">«Use Proxies»</mark> в{" "}
            <mark className="select">«Render Settings»</mark>. Иначе программа
            проигнорирует их, начнёт просчитывать всё заново, и вы не получите быстрый
            экспорт композиции.
          </li>
          <li>
            Во время экспорта композиции не стоит работать в других ресурсоёмких
            программах, таких как <mark className="app">Adobe Premiere Pro</mark> или{" "}
            <mark className="app">Blender</mark>. Это чревато ошибками из-за нехватки
            оперативной памяти и может привести к сбою всего процесса.
          </li>
          <li>
            Даже если вы включили аппаратное ускорение в{" "}
            <mark className="select">«Project Manager»</mark>, это не значит, что оно
            будет работать всегда. Некоторые эффекты в{" "}
            <mark className="app">Adobe After Effects</mark> его просто не поддерживают
            или в принципе не могут загрузить «железо» по полной. Поэтому программа и{" "}
            <b>
              <u>не обязана</u>
            </b>{" "}
            выжимать <mark>100%</mark> из вашего процессора и видеокарты во время рендера.
            <Addition type="info">
              <p>
                Многие эффекты, особенно старые, до сих пор обрабатываются только
                процессором, потому что программа изначально была спроектирована с упором
                на него, а видеокарта подключается лишь при возможности — и вы ничего с
                этим не поделаете.
              </p>
              <p>
                Добавим к этому ещё один нюанс: если в цепочке эффектов с поддержкой
                видеокарты окажется хоть один, который её не поддерживает, возникнет
                «бутылочное горлышко». Вся обработка упрётся в медленный просчёт этого
                одного эффекта на процессоре. Из-за этого{" "}
                <mark className="app">Adobe After Effects</mark> иногда и вовсе может
                решить, что проще переложить весь рендер на процессор, проигнорировав
                видеокарту.
              </p>
              <p>
                Чтобы понять, какие из ваших эффектов действительно используют видеокарту,
                включите опцию{" "}
                <mark className="select">«Show GPU Capable Effects Only»</mark> в окне{" "}
                <mark className="select">«Effects & Presets»</mark>. Вы удивитесь,
                насколько коротким станет список.
              </p>
            </Addition>
          </li>
          <li>
            Используйте <mark className="app">Adobe Media Encoder</mark> для экспорта
            композиций только в крайнем случае. Обычно рендер напрямую из{" "}
            <mark className="app">Adobe After Effects</mark> проходит стабильнее и
            быстрее.
          </li>
          <li>
            Экспорт в <mark className="video">H.264</mark> и другие кодеки со сжатием
            может пройти быстрее, если использовать аппаратное ускорение именно для
            кодирования видео, например через{" "}
            <mark className="select">«NVIDIA NVENC»</mark> или{" "}
            <mark className="select">«Intel Quick Sync»</mark>. На коротких композициях
            разница бывает незаметна, но при экспорте длинных проектов она становится
            ощутимой. Однако эта возможность доступна не во всех модулях экспорта. Найти
            её можно, например, в плагинах{" "}
            <mark className="plugin">Voukoder Classic</mark> и{" "}
            <mark className="plugin">Voukoder Pro</mark>.
          </li>
        </ul>
        <Divider>Раздел 3: Система, «железо» и другие нюансы</Divider>
        <p>
          Иногда проблема «тормозов» кроется не в проекте или настройках программы, а
          глубже — в конфигурации системы, самом «железе» или даже в ваших наивных
          ожиданиях. Разберёмся по порядку.
        </p>
        <Divider>Очищаем систему от «мусора»</Divider>
        <ContentFilter
          macContent={
            <div>
              <p>
                Если вы уверены на <mark>100%</mark>, что с проектом всё хорошо, а
                устройство должно его вытягивать, но не вытягивает, — в первую очередь
                проверьте систему на наличие «хлама» и почистите её.
              </p>
            </div>
          }
          windowsContent={
            <div>
              <p>
                Если вы уверены на <mark>100%</mark>, что с проектом всё хорошо, а
                устройство должно его вытягивать, но не вытягивает, в первую очередь
                проверьте систему на «хлам». Со временем она забивается «мусором»:
                временными файлами, кэшем и прочими ненужными данными. Самый простой
                способ избавиться от них — использовать стандартную утилиту{" "}
                <mark className="code">cleanmgr.exe</mark>, которую можно запустить из
                окна <mark className="app">«Выполнить»</mark>. Она проанализирует систему
                и позволит выборочно удалить накопившиеся обновления, старые точки
                восстановления и другой мусор.
              </p>
              <p>
                Для более глубокой очистки можно использовать сторонние программы, такие
                как <mark className="app">Auslogics BoostSpeed</mark>,{" "}
                <mark className="app">Reg Organizer</mark> или{" "}
                <mark className="app">CCleaner</mark>, но будьте с ними осторожны: они
                предназначены для опытных пользователей и при неосторожном использовании
                могут удалить важные файлы. А чтобы вручную найти, что именно занимает
                больше всего места на диске, воспользуйтесь анализаторами вроде{" "}
                <mark className="app">WizTree</mark> или{" "}
                <mark className="app">WinDirStat</mark>. Они просканируют все директории и
                помогут найти и удалить ненужное.
              </p>
            </div>
          }
        />
        <ContentFilter
          windowsContent={
            <div>
              <Divider>Проверяем драйвера и отключаем автообновления</Divider>
              <p>
                Иногда причина ситуации{" "}
                <mark className="quote">«вчера работало плавно, а сегодня — нет»</mark>{" "}
                кроется в автоматических обновлениях.{" "}
                <mark className="app">Центр обновлений Windows</mark> или утилиты от
                производителей «железа», такие как <mark className="app">NVIDIA App</mark>
                , <mark className="app">Intel Driver & Support Assistant</mark> или{" "}
                <mark className="app">AMD Software: Adrenalin Edition</mark>, могут
                скачивать и устанавливать драйверы в фоне, без вашего ведома. Проблема в
                том, что не каждая версия драйвера будет одинаково хорошо работать с{" "}
                <mark className="app">Adobe After Effects</mark>, и свежие драйверы могут
                легко всё сломать.
              </p>
              <p>
                Если вы не хотите разбираться, какой именно драйвер виноват, самое простое
                — откатить систему до последнего бэкапа или точки восстановления, если вы
                их создавали. Но, по моему мнению, мало у кого они есть, поэтому чаще
                всего остаётся одно — удалять или переустанавливать драйверы вручную.
                Перед этим не забудьте скачать нужные.
              </p>
              <ul>
                <li>
                  <p>
                    Для видеокарт <mark className="company">NVIDIA</mark> рекомендуется
                    использовать <mark className="app">NVIDIA Studio Driver</mark>: он
                    оптимизирован для работы в творческих приложениях и обновляется реже,
                    чем <mark className="app">NVIDIA Game Ready Driver</mark>.
                  </p>
                  <Addition type="info">
                    Загрузить драйверы <mark className="app">NVIDIA Studio</mark> можно на{" "}
                    <a href="https://www.nvidia.com/en-eu/geforce/drivers/">
                      официальном сайте NVIDIA
                    </a>
                    . На странице укажите модель видеокарты, ОС и в поле{" "}
                    <mark className="select">«Download Type»</mark> выберите{" "}
                    <mark className="select">«Studio Driver»</mark>.
                  </Addition>
                </li>
                <li>
                  Для <mark className="company">Intel</mark> скачайте подходящий драйвер{" "}
                  <a href="https://www.intel.com/content/www/us/en/search.html#sort=relevancy&f:@tabfilter=[Downloads]&f:@stm_10385_en=[Graphics]&f:downloadtype=[Drivers]">
                    на официальном сайте
                  </a>{" "}
                  или воспользуйтесь{" "}
                  <a href="https://www.intel.com/content/www/us/en/support/detect.html">
                    автоматическим установщиком
                  </a>
                  .
                  <Addition type="warning">
                    <mark className="company">Intel</mark> может блокировать доступ к
                    сайту для пользователей из Российской Федерации.
                  </Addition>
                </li>
                <li>
                  Для <mark className="company">AMD</mark> воспользуйтесь{" "}
                  <a href="https://www.amd.com/en/support/download/drivers.html">
                    автоматическим установщиком с официального сайта
                  </a>
                  .
                </li>
              </ul>
              <p>
                Текущие драйверы видеокарты можно удалить «подчистую» с помощью утилиты{" "}
                <mark className="app">Display Driver Uninstaller (DDU)</mark>. Скачать её
                можно с{" "}
                <a href="https://www.wagnardsoft.com/display-driver-uninstaller-ddu">
                  официального сайта
                </a>
                , а удаление лучше всего производить в безопасном режиме.
              </p>
              <ContentFigure
                caption="Как использовать DDU для NVIDIA, AMD или Intel"
                src="98DAgw1KcmI"
                type="youtube"
              />
              <Addition type="danger">
                Выполняйте удаление драйверов на свой страх и риск. Если вы неопытный
                пользователь, пропустите этот пункт и попробуйте просто переустановить
                драйверы поверх существующих.
              </Addition>
              <p>
                Если вы не любитель автоматических обновлений и не хотите внезапно
                столкнуться с «тормозами», их можно отключить. Правда, стандартный способ
                в <mark className="app">Центре обновлений Windows</mark> позволяет лишь
                отложить этот процесс максимум на 5 недель (35 дней) — для большинства
                пользователей этого срока вполне достаточно. Если же вы хотите избавиться
                от обновлений насовсем, то придётся лезть в реестр или редактор локальной
                групповой политики<sup>1</sup>.
              </p>
              <ContentFigure
                caption="Как отключить обновления"
                src="SgU4jB4ooQk"
                type="youtube"
              />
              <Addition type="warning">
                <ul>
                  <li>
                    <sup>1</sup>{" "}
                    <mark className="app">
                      Редактор локальной групповой политики (gpedit.msc)
                    </mark>{" "}
                    отсутствует в редакции <mark>Home</mark>, но есть в <mark>Pro</mark>,{" "}
                    <mark>Enterprise</mark> и <mark>Education</mark>.
                  </li>
                  <li>
                    Имейте в виду: полное отключение обновлений может аукнуться в будущем,
                    когда новые версии программ начнут требовать более свежую операционную
                    систему или драйверы.
                  </li>
                </ul>
              </Addition>
            </div>
          }
        />
        <Divider>Влияет ли версия программы на производительность?</Divider>
        <p>
          Всё зависит от того, на каком устройстве запускается программа. Если поставить
          устаревшую версию <mark className="app">Adobe After Effects</mark> на новый
          компьютер, она может работать нестабильно — такие сборки не рассчитаны на
          современные комплектующие. А установка самой свежей версии на слишком старый
          ноутбук или ПК нередко приводит к сбоям и отсутствию аппаратного ускорения.
        </p>
        <p>
          Универсальной «идеальной» версии{" "}
          <mark className="app">Adobe After Effects</mark> не существует, поэтому выбор
          лучше основывать на своём опыте, а не на советах с чатов и форумов. Всё слишком
          индивидуально: у кого-то «тормозит», у кого-то «летает», да и проекты у всех
          разные. Сам факт выбора сборки почти не влияет на скорость работы, но, оставаясь
          на старой, вы отказываетесь от новых функций, оптимизаций и исправлений — ради
          сомнительного преимущества, которое на практике ничего не меняет.
        </p>
        <Divider>Дополнительный материал для размышлений</Divider>
        <div className="flexible-links">
          <a href="https://www.pugetsystems.com/blog/2025/02/24/upcoming-boost-to-after-effects-preview-playback-with-ram-and-disk-cache/">
            О потреблении ОЗУ и дискового кэша от Puget Systems
          </a>
          <a href="https://helpx.adobe.com/after-effects/using/memory-storage1.html">
            Использование оперативной памяти в Adobe After Effects
          </a>
        </div>
      </DetailsSummary>
      <DetailsSummary
        anchor="mercury-acceleration"
        tag="mercury gpu acceleration, software rendering only, рендеринг на процессоре"
        title="Как переключить тип рендеринга и зачем это нужно делать?"
      >
        <p>
          В <mark className="app">Adobe After Effects</mark> существует два типа ускорения
          — аппаратное и программное, — и каждый из них работает с конкретным проектом
          по-разному. В некоторых случаях пользователю может понадобиться переключение с
          аппаратного ускорения на программное, чтобы избавиться от проблем, связанных с{" "}
          <mark className="select">«Mercury GPU Acceleration»</mark>: например, от
          переполнения видеопамяти, различных артефактов или остановки рендеринга без
          внятной причины. Или наоборот, когда стандартный эффект, например{" "}
          <mark className="plugin">VR Chromatic Aberration</mark>, требует включить
          аппаратное ускорение, если у вас выбран режим{" "}
          <mark className="select">«Mercury Software Only»</mark>.
        </p>
        <p>
          Чтобы изменить тип ускорения, откройте окно{" "}
          <mark className="select">«Project Settings»</mark> с помощью комбинации клавиш{" "}
          <mark className="key">Ctrl + Alt + Shift + K</mark> или через меню{" "}
          <mark className="select">«File» → «Project Settings»</mark>. По умолчанию вы
          попадёте на вкладку{" "}
          <mark className="select">«Video Rendering and Effects»</mark>, где параметр{" "}
          <mark className="select">«Use»</mark>, который нужно изменить, отвечает за тип
          ускорения рендеринга.
        </p>
        <Addition type="info">
          Окно <mark className="select">«Project Settings»</mark> часто называют
          «ракетой», так как иконка космической ракеты в окне{" "}
          <mark className="select">«Project»</mark> открывает именно его.
        </Addition>
        <ContentFigure
          caption="Project Settings"
          imgTitle="Переключение типа рендеринга"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/project_manager_mercury.png"
          theme="dark"
          type="image"
          variant="windows"
        />
        <ul>
          <li>
            <mark className="select">«Mercury Software Only»</mark>, или{" "}
            <mark className="word">программное ускорение</mark>, позволит{" "}
            <mark className="app">Adobe After Effects</mark> реже обращаться к видеокарте
            и выполнять рендеринг в большинстве случаев на процессоре. Рендеринг на
            процессоре обычно стабильнее, чем при использовании видеокарты.
            <Addition type="info">
              <ul>
                <li>
                  Даже если выбран этот параметр, некоторые сторонние эффекты всё равно
                  могут обрабатываться видеокартой, например{" "}
                  <mark className="plugin">Depth Scanner</mark>. Обычно это поведение
                  можно изменить в настройках самого эффекта.
                </li>
                <li>
                  С этим параметром время просчёта композиций может измениться как в
                  худшую, так и в лучшую сторону — это зависит от «железа», но в сложных
                  композициях время зачастую остаётся неизменным. Иногда рендеринг на
                  процессоре может пройти даже быстрее, чем с{" "}
                  <mark className="select">«Mercury GPU Acceleration»</mark>.
                </li>
              </ul>
            </Addition>
          </li>
          <li>
            <mark className="select">«Mercury GPU Acceleration»</mark>, или{" "}
            <mark className="word">аппаратное ускорение</mark>, позволит программе
            использовать при рендеринге и процессор, и видеокарту. Видеокарта будет
            задействована в тех случаях, когда применённый эффект её поддерживает. Иногда
            это значение может быть продублировано с указанием технологии вашей
            видеокарты, например <mark>CUDA (NVIDIA)</mark>, <mark>OpenCL (AMD)</mark>,{" "}
            <mark>OpenGL (Intel)</mark> или <mark>Metal (Apple Silicon)</mark>.
            <Addition type="warning">
              На видеокартах с малым объёмом видеопамяти вы можете часто сталкиваться с
              ошибкой{" "}
              <mark className="warning">
                «After Effects has encountered a failure related to GPU-enabled effects
                from this frame»
              </mark>
              . Это происходит из-за переполнения видеопамяти. В таком случае{" "}
              <mark className="app">Adobe After Effects</mark> предложит переключиться на{" "}
              <mark className="select">«Mercury Software Only»</mark>.
            </Addition>
            <Addition type="danger">
              <ul>
                <li>
                  Если на одном слое смешать эффект, который поддерживает аппаратное
                  ускорение, и тот, который не поддерживает, то скорость рендеринга
                  упрётся в скорость обработки эффекта, выполняемого на процессоре.
                </li>
                <li>
                  Часто бытует мнение, что при включённом{" "}
                  <mark className="select">«Mercury GPU Acceleration»</mark> видеокарта
                  якобы обязана использоваться во всех случаях. Это не так — программа
                  будет задействовать её только при необходимости, а не по вашей прихоти.{" "}
                  <mark className="app">Adobe After Effects</mark> по большей части
                  использует процессор, но разработчики стандартных и сторонних эффектов
                  всё чаще добавляют поддержку ускорения с помощью видеокарты.
                </li>
              </ul>
            </Addition>
          </li>
        </ul>
        <Divider>Какие эффекты поддерживают аппаратное ускорение?</Divider>
        <p>
          Чтобы посмотреть список эффектов, которые поддерживают ускорение с помощью
          видеокарты, откройте окно <mark className="select">«Effects & Presets»</mark> и
          в его контекстном меню включите параметр{" "}
          <mark className="select">«Show GPU Capable Effects Only»</mark>. После этого вы
          заметите, насколько сильно сократится список ваших эффектов.
        </p>
        <ContentFigure
          caption="Adobe After Effects"
          imgTitle="Включение отображения только тех эффектов, которые поддерживают GPU-ускорение"
          // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
          src="images/legacy/aftereffects/show_gpu_capable_effects_only.png"
          theme="dark"
          type="image"
          variant="windows"
        />
      </DetailsSummary>
      <DetailsSummary
        anchor="configure-swapfile"
        tag="файл подкачки, виртуальная память, swapfile, paging file, virtual memory"
        title="Для чего нужен файл подкачки и почему его не стоит отключать?"
      >
        <ContentFilter
          windowsContent={
            <div>
              <p>
                <mark className="file">Файл подкачки</mark>, или{" "}
                <mark className="file">PAGEFILE.SYS</mark>, — это специальный файл,
                который служит виртуальным расширением оперативной памяти. Когда системе
                не хватает физической оперативной памяти для выполнения ресурсоёмких
                задач, она начинает использовать файл подкачки для временного хранения
                данных. По умолчанию, если <mark className="file">PAGEFILE.SYS</mark> не
                отключён в вашей сборке <mark>Windows</mark>, система автоматически
                управляет его размером, однако часто делает это неэффективно. Поэтому
                рекомендуется настроить его параметры вручную.
              </p>
              <p>
                В интернете и от горе-сборщиков самодельных образов <mark>Windows</mark>{" "}
                нередко можно встретить мнение, что файл подкачки лучше отключить — якобы
                он «вредит» вашему твёрдотельному накопителю. Отчасти в этом есть смысл,
                однако современные накопители рассчитаны на такие нагрузки, и, скорее
                всего, вы смените своё устройство на новое гораздо раньше, чем диск выйдет
                из строя.
              </p>
              <p>
                С отключённым файлом подкачки в{" "}
                <mark className="app">Adobe After Effects</mark> или других творческих
                программах вы можете столкнуться с различными ошибками, например:{" "}
                <mark className="select">
                  «After Effects has unexpectedly run out of memory and cannot complete
                  this export»
                </mark>
                , <mark className="select">«Out of Memory»</mark> или{" "}
                <mark className="select">
                  «Low memory warning. RAM use has been extended for previews»
                </mark>
                . Кроме того, при нехватке оперативной памяти и отсутствии файла подкачки
                возможны вылеты приложений, появление сообщения{" "}
                <mark className="select">«В системе недостаточно памяти»</mark>, различные
                подвисания или даже чёрный экран, который устраняется только перезагрузкой
                устройства.
              </p>
              <p>
                Чтобы настроить размер файла подкачки в <mark>Windows</mark> или включить
                его, следуйте приведённой ниже пошаговой инструкции.
              </p>
              <Divider>Инструкция для Windows 10 и 11</Divider>
              <ul>
                <li>
                  Откройте окно <mark className="app">Выполнить</mark> с помощью
                  комбинации клавиш <mark className="key">Win + R</mark>, введите в поле{" "}
                  <mark className="select">«Открыть»</mark> команду{" "}
                  <mark className="code">SystemPropertiesAdvanced.exe</mark>, а затем
                  нажмите <mark className="key">Enter</mark> дважды. Таким образом вы
                  откроете окно <mark className="select">«Свойства системы»</mark> и сразу
                  попадёте в <mark className="select">«Параметры быстродействия»</mark>.
                  <ContentFigure
                    caption="Выполнить"
                    // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
                    src="images/legacy/run_systempropertiesadvanced.png"
                    theme="dark"
                    type="image"
                    variant="windows"
                  />
                </li>
                <li>
                  В окне <mark className="select">«Параметры быстродействия»</mark>{" "}
                  перейдите на вкладку <mark className="select">«Дополнительно»</mark>.
                  <ContentFigure
                    caption="Параметры быстродействия"
                    // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
                    src="images/legacy/systempropertiesadvanced_select_advanced.png"
                    theme="light"
                    type="image"
                    variant="windows"
                  />
                </li>
                <li>
                  Во вкладке <mark className="select">«Дополнительно»</mark> нажмите
                  кнопку <mark className="select">«Изменить»</mark> в разделе{" "}
                  <mark className="select">«Виртуальная память»</mark>.
                  <ContentFigure
                    caption="Параметры быстродействия"
                    // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
                    src="images/legacy/systempropertiesadvanced_open_change_size.png"
                    theme="light"
                    type="image"
                    variant="windows"
                  />
                </li>
                <li>
                  Если у вас установлен флажок у параметра{" "}
                  <mark className="select">
                    «Автоматически выбирать объем файла подкачки»
                  </mark>
                  , снимите его.
                  <ContentFigure
                    caption="Виртуальная память"
                    // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
                    src="images/legacy/systempropertiesadvanced_disable_auto_size.png"
                    theme="light"
                    type="image"
                    variant="windows"
                  />
                </li>
                <li>
                  <p>
                    Выберите раздел, на котором у вас установлена система. Если для
                    выбранного раздела установлено значение{" "}
                    <mark className="select">«Без файла подкачки»</mark> или{" "}
                    <mark className="select">«Размер по выбору системы»</mark>, измените
                    его на <mark className="select">«Указать размер»</mark>.
                  </p>
                  <p>
                    Далее укажите исходный и максимальный размер файла подкачки. После
                    ввода значений не забудьте нажать кнопку{" "}
                    <mark className="select">«Задать»</mark> для сохранения, а затем —{" "}
                    <mark className="select">«ОК»</mark> внизу окна.
                  </p>
                  <ContentFigure
                    caption="Виртуальная память"
                    // NOTE: заменить на новое изображение, видео или пример, желательно с бОльшим разрешением
                    src="images/legacy/systempropertiesadvanced_set_swap_size.png"
                    theme="light"
                    type="image"
                    variant="windows"
                  />
                  <Addition type="info">
                    <ul>
                      <li>
                        Для файла подкачки нужно выбрать раздел с самым производительным
                        диском на вашем устройстве. Размещение файла подкачки на медленном
                        диске может ухудшить работу как с{" "}
                        <mark className="app">Adobe After Effects</mark>, так и с{" "}
                        <mark>Windows</mark> в целом.
                      </li>
                      <li>
                        <mark className="select">«Исходный размер»</mark> — это начальный
                        размер файла подкачки, который всегда будет зарезервирован в
                        системе.
                      </li>
                      <li>
                        <mark className="select">«Максимальный размер»</mark> — это
                        граница, до которой <mark>Windows</mark> будет автоматически
                        расширять файл при необходимости. Если система достигнет этой
                        границы, файл больше расширяться не будет.
                      </li>
                      <li>
                        В качестве <mark className="select">«исходного размера»</mark> вы
                        можете установить значение от <mark>1024 МБ</mark> до любого
                        числа. <mark>Windows</mark> позволяет задать и более низкое
                        значение, но делать это не всегда рекомендуется, особенно если у
                        вас установлен медленный накопитель.
                      </li>
                      <li>
                        В качестве <mark className="select">«максимального размера»</mark>{" "}
                        для повседневных задач можно установить значение по формуле{" "}
                        <mark>
                          «текущий объём оперативной памяти, умноженный на 3 или 4»
                        </mark>{" "}
                        или сразу задать своё максимальное значение, например{" "}
                        <mark className="copy">65536</mark> (64 ГБ) или{" "}
                        <mark className="copy">131072</mark> (128 ГБ). Убедитесь, что на
                        выбранном разделе будет достаточно свободного места для файла
                        подкачки!
                      </li>
                    </ul>
                  </Addition>
                </li>
                <li>
                  После того как вы задали нужный размер файла подкачки, перезагрузите
                  устройство. Теперь <mark className="file">PAGEFILE.SYS</mark> будет
                  работать в соответствии с выбранными параметрами, и проблемы с нехваткой
                  оперативной памяти будут напоминать о себе заметно реже.
                </li>
              </ul>
            </div>
          }
        />
      </DetailsSummary>
    </div>
  );
};

export default AEPerformance;
