import React from "react";
import DetailsSummary from "../../../components/DetailsSummary";
import GithubUpdateInfo from "../../../components/features/GithubUpdateInfo";
import {AdditionDanger, AdditionInfo, AdditionWarning} from "../../../components/Additions";
import {ImageFigure, YouTubeVideo} from "../../../components/ContentFigure";
import ContentSwitcher from "../../../components/features/ContentFilter";
import {Divider} from "antd";

const AEPerformance: React.FC = () => {
  return (
    <div className="faq-content">
      <GithubUpdateInfo filePath="src/pages/sections/aefaq/Performance.tsx" />
      <DetailsSummary
        tag="тормозит, жуткие лаги, медленно работает, низкая скорость работы программы, оптимизация, производительность, применение эффектов, системные требования, артефакты, искажения"
        title="Почему у меня, б%@#ь, лагает е&#!%й After Effects, с$%а?"
      >
        <p>
          Здесь по этому вопросу можно рассуждать долго и бесконечно. Тут нельзя назвать
          конкретную причину этого магического явления, так как всё обычно упирается в
          действия пользователя или в железо его устройства.
        </p>
        <p>
          Для начала, пожалуйста, проверьте ваше устройство на соответствие{" "}
          <a href="https://helpx.adobe.com/ru/after-effects/system-requirements.html">
            системным требованиям
          </a>{" "}
          для <mark className="app">After Effects</mark>. На момент написания этого пункта
          рекомендации для адекватной работы программы следующие.
        </p>
        <Divider>Рекомендуемые системные требования</Divider>
        <ContentSwitcher
          macContent={
            <div>
              <ul>
                <li>
                  Для корректной установки и запуска программы требуется установленная
                  операционная система минимум <mark>macOS Monterey</mark> (12.X.X) или
                  новее.
                  <AdditionWarning>
                    <ul>
                      <li>
                        {" "}
                        Поддержка <mark>macOS Big Sur</mark> (11.X) прекращена, вы можете
                        установить последнюю версию{" "}
                        <mark className="app">After Effects</mark> для вас -{" "}
                        <mark>23.6</mark>.
                      </li>
                      <li>
                        <mark className="app">After Effects</mark> версий{" "}
                        <mark>2024</mark> и новее не поддерживают запуск через{" "}
                        <mark className="app">Rosetta</mark>. Таким образом старые версии
                        сторонних плагинов, которые были адаптированы для процессоров на{" "}
                        <mark>Intel</mark> не будут работать на <mark>Apple Silicon</mark>
                        . Для решения проблемы откатитесь до <mark>23.6</mark> или найдите
                        обновления для сторонних плагинов с поддержкой процессоров{" "}
                        <mark>Apple Silicon</mark>.{" "}
                        <a href="https://helpx.adobe.com/ru/after-effects/kb/after-effects-apple-silicon.html">
                          Подробнее...
                        </a>
                      </li>
                    </ul>
                  </AdditionWarning>
                </li>
                <li>
                  <mark className="app">After Effects</mark> можно запустить на
                  устройствах Mac с процессором <mark>Intel</mark> минимум 6-го поколения
                  с поддержкой инструкций <mark>AVX2</mark>.
                  <AdditionWarning>
                    На старых устройствах, по типу <mark>Mac Pro 2013</mark>, у вас не
                    получится установить <mark className="app">After Effects</mark> версий
                    24.X и новее. Вы можете установить последнюю версию{" "}
                    <mark className="app">After Effects</mark> для вас - <mark>23.6</mark>
                    .
                  </AdditionWarning>
                  Но с развитием технологий, сейчас рекомендуется использовать устройство
                  на базе процессоров <mark>Apple Silicon</mark> минимум <mark>M1</mark>{" "}
                  или его более производительных производных, как <mark>M1 Pro</mark>,{" "}
                  <mark>M1 Max</mark> и прочие. Они более производительнее и
                  энергоэффективнее, чем устройства на базе <mark>Intel</mark>.
                </li>
                <li>
                  Требуется и рекомендуется иметь минимум <mark>16 гигабайт</mark>{" "}
                  оперативной памяти на вашем устройстве.
                  <AdditionWarning>
                    Если в комплектации вашего Mac-устройства только{" "}
                    <mark>8 гигабайт</mark> оперативной памяти или ниже, то скорее всего в
                    сложных проектах вы будете часто сталкиваться с нехваткой оперативной
                    памяти и ошибками по типу <mark className="ui">Out of Memory</mark>.
                  </AdditionWarning>
                </li>
              </ul>
            </div>
          }
          windowsContent={
            <div>
              <ul>
                <li>
                  Для корректной установки и запуска программы требуется{" "}
                  <mark>Windows 10</mark>
                  (64-битная) версии <mark>22H2</mark> или <mark>Windows 11</mark> версии
                  минимум <mark>21H2</mark>, желательно <mark>23H2</mark> или{" "}
                  <mark>24H2</mark>. Также рекомендуется обновить пакеты{" "}
                  <a href="https://github.com/abbodi1406/vcredist/releases">
                    Microsoft Visual C++ Redistributable
                  </a>{" "}
                  до последних версий во избежание проблем с загрузкой сторонних эффектов
                  и плагинов.
                  <AdditionWarning>
                    <ul>
                      <li>
                        С ноября 2025 поддержка <mark>Windows 10</mark> версии{" "}
                        <mark>22H2</mark> закончится и, <i>предварительно</i>, свежие
                        версии <mark className="app">After Effects</mark> от{" "}
                        <mark>2026</mark> будут недоступны к установке.{" "}
                        <i style={{opacity: 0.5}}>
                          Почему предварительно? Потому что <mark>Adobe</mark> прекратила
                          выпуск новых версий <mark>After Effects</mark> для{" "}
                          <mark>Windows 7</mark> и <mark>Windows 8.1</mark> (для него
                          раньше, в одно время с отключением поддержки
                          &quot;семёрки&quot;) после их официальной поддержки{" "}
                          <mark>Майкрософтом</mark> и есть причина подозревать в скорой
                          отключении поддержки &quot;устаревшей&quot; операционной системы
                          в ближайшее время.
                        </i>
                      </li>
                      <li>
                        На <mark>Windows 10</mark> версии <mark>21H2</mark> и ниже вы не
                        сможете установить <mark className="app">After Effects 2024</mark>
                        . Для решения проблемы - обновите систему до более свежего билда.
                        Если у вас стоит редакция <mark>LTSC</mark> - переустановите
                        систему с нуля или установите последнюю версию{" "}
                        <mark className="app">After Effects</mark> для вас -{" "}
                        <mark>23.6</mark>.
                      </li>
                    </ul>
                  </AdditionWarning>
                </li>
                <li>
                  <mark>Процессор Intel</mark> - требуется минимум 6-ое поколение
                  семейства любого семейства, рекомендуется 11-ое поколение или новее
                  семейства <mark>i7</mark> или <mark>i9</mark>.
                  <br />
                  <span style={{fontSize: "0.7rem"}}>Или</span> <mark>Процессор AMD</mark>{" "}
                  - требуется минимум Ryzen серии 1000 пятого семейства, рекомендуется
                  серия 5000 или новее седьмого или девятого семейства.
                  <AdditionWarning>
                    Для <mark className="app">After Effects 2024</mark> и новее требуется
                    процессор с поддержкой инструкций <mark>AVX2</mark>. Если у вашего
                    процессора нет таких инструкций, то для вас последняя версия программы
                    - <mark>23.6</mark>, более свежую вы не сможете поставить.{" "}
                    <a
                      href="https://www.youtube.com/watch?v=1IAwkEdRZZw"
                      style={{opacity: "0.5"}}
                    >
                      Иначе вы наткнётесь на ошибку 0xc0000142.
                    </a>
                  </AdditionWarning>
                </li>
                <li>
                  Для запуска и простых действий в программе требуется минимум{" "}
                  <mark>16 гигабайт</mark>
                  оперативной памяти. Для комфортной работы - минимум{" "}
                  <mark>32 гигабайт</mark> оперативной памяти или более.
                  <AdditionInfo>
                    Для того, чтобы реже сталкиваться с ошибками про нехватку оперативной
                    памяти - рекомендуется настроить <a href="#4.7">файл подкачки</a>.
                  </AdditionInfo>
                </li>
                <li>
                  Для комфортной работы с эффектами, которые поддерживают GPU-ускорение,
                  требуется видеокарта <mark>NVIDIA</mark> минимум{" "}
                  <mark>4 гигабайта</mark> видеопамяти. Также рекомендуется установить
                  свежие драйвера на видеокарту, желательно редакции{" "}
                  <mark>NVIDIA Studio Driver</mark> для более стабильной работы с
                  монтажными программами.
                  <AdditionInfo>
                    Загрузить драйвера <mark>NVIDIA Studio</mark> вы можете на{" "}
                    <a href="https://www.nvidia.com/en-us/geforce/drivers/">
                      официальной странице загрузки драйверов
                    </a>
                    . На странице укажите текущую модель вашей видеокарты, операционную
                    систему и не забудьте указать в{" "}
                    <mark className="ui">Download Type</mark> значение{" "}
                    <mark>Studio Driver</mark>.
                  </AdditionInfo>
                  <AdditionWarning>
                    Видеокарты от <mark>AMD</mark> не рекомендуются для работы с
                    монтажными программами из-за отсутствия CUDA-ядер и некоторых
                    ограничений и приколов. Вы можете переключиться на{" "}
                    <mark className="ui">Mercury Software Only</mark> для рендера на
                    процессоре в <mark className="ui">Project Manager</mark>, который
                    открывается по комбинации клавиш{" "}
                    <mark className="key">Ctrl + Shift + Alt + K</mark>.
                  </AdditionWarning>
                </li>
                <li>
                  Ещё важную роль в производительности программы может играть накопитель,
                  на котором установлена система и{" "}
                  <mark className="app">After Effects</mark>, а также на котором лежат
                  ваши исходники. Если вы с <mark>M.2 SSD</mark> особых проблем не
                  почувствуете, то при работе с исходниками с <mark>HDD</mark>, особенно
                  медленных и потрёпанных жизнью, могут начаться проблемы. Если у вас есть{" "}
                  <mark>SSD</mark> с большим объёмом памяти - следует перенести весь
                  проект туда и продолжить работу, используя его.
                </li>
              </ul>
            </div>
          }
        />
        <Divider>Типичные ошибки пользователя и их влияние на производительность</Divider>
        <p>
          Предположим, что ваше устройство прекрасно соответствует системным требованиям,
          вы открываете программу и начинаете работу. В проекте вы начинаете создавать
          композиции, импортировать различные графические исходники при необходимости,
          постепенно накидывая в композиции кучу различных эффектов. И как раз в этом и
          кроется проблема, что большинство пользователей не обращают внимание на свой
          проект и что они накрутили. Почему?
        </p>
        <ul>
          <li>
            Довольно часто пользователи скачивают различные файлы, пережатые непонятно во
            что и импортируют в <mark className="app">After Effects</mark>, а потом через
            некоторое время замечают некоторые проблемы: артефакты, баги или вообще
            снижение производительности при банальных действиях с композицией. Если вы
            скачали видео в формате <mark className="file">.mp4</mark> или в любом другом
            из интернета, то вам необходимо переконвертировать его в срочном порядке в
            монтажный кодек, например <mark className="video">Apple Prores 422</mark> или{" "}
            <mark className="video">DNxHR</mark> через{" "}
            <mark className="app">Media Encoder</mark>,{" "}
            <mark className="app">Shutter Encoder</mark>,{" "}
            <mark className="app">Handbrake</mark> или{" "}
            <mark className="app">MKVToolNix</mark>.{" "}
            <a href="#5.1">Подробнее про рекомендуемый пайплайн импорта...</a>
            <AdditionInfo>
              <ul>
                <li>
                  Это делать нужно каждый раз, прежде чем импортировать файлы в{" "}
                  <mark className="app">After Effects</mark>, полученные через YouTube или
                  другие подобные площадки. <mark className="app">After Effects</mark> не
                  всегда корректно отрабатывает подобные исходники, потому что площадки
                  изменяют стандарт <mark className="video">H.264</mark> под себя и такие
                  исходники плохо крутятся программой. После перекодирования исходников вы
                  обезопасите себя от внезапных артефактов и глюков при работе с{" "}
                  <mark className="app">After Effects</mark>. После конвертации уже
                  перекодированные исходники вы можете импортировать в ваш проект или
                  заменить файлы в окне <mark className="ui">Project</mark>, нажав{" "}
                  <mark className="key">ПКМ</mark> по исходнику и выбрать{" "}
                  <mark className="ui">Replace Footage &gt; File</mark>.{" "}
                </li>
                <li>
                  Если ваше видео закодировано с переменным FPS (узнать об этом можно
                  через <mark className="app">MediaInfo</mark>), то такие файлы также
                  нужно перекодировать через выше названные утилиты в постоянный
                  (Constant) FPS.
                </li>
                <li>
                  Подробнее о типах кодеков и их области применения вы можете посмотреть в{" "}
                  <a href="https://www.youtube.com/watch?v=MprgQSTqL9E">
                    видео от VideoSmile
                  </a>
                  .
                </li>
              </ul>
            </AdditionInfo>
          </li>
          <li>
            Чтобы исключить проблемы с звуком, аудио-файлы тоже следует
            переконвертировать, например в <mark className="file">.wav</mark>. Звуковые
            файлы могут проигрываться рывками, замедленно или с другими звуковыми багами.
            Переконвертировать аудио можно также через{" "}
            <mark className="app">Media Encoder</mark>,{" "}
            <mark className="app">Shutter Encoder</mark> или{" "}
            <mark className="app">EZ CD Audio Converter</mark>.
          </li>
          <li>
            Пользователи обычно в <mark className="app">After Effects</mark> применяют
            различные эффекты для придания композиции уникальности, но часто забывают о
            требованиях эффектов и сторонних плагинов к ресурсам устройства. И понеслась -
            вешают три разных вида свечения, различные шейки, цветокоррекцию и приправляют
            нагруженными частицами. И пользователь ещё удивляется, почему время экспорта
            слишком большое. Чтобы проанализировать время рендера того или иного слоя, вы
            можете воспользоваться функцией <mark className="ui">Render Time</mark>, речь
            о которой пойдет позже.
            <AdditionWarning>
              <ul>
                <li>
                  Старайтесь{" "}
                  <b>
                    <u>не устанавливать</u>
                  </b>{" "}
                  кучу плагинов и расширений в <mark className="app">After Effects</mark>{" "}
                  не разобравшись, нужно ли оно вам или нет. Также постарайтесь{" "}
                  <b>
                    <u>не мешать в вашей композиции кучу эффектов</u>
                  </b>{" "}
                  с одинаковой сутью, но из разных пакетов, например{" "}
                  <mark className="plugin">BCC Camera Shake</mark> и{" "}
                  <mark className="plugin">uni.shake</mark>. Некоторые эффекты могут
                  конфликтовать друг с другом, если они лежат на одном слое или нарушена
                  очерёдность расположения эффектов. Напомню, что по очередности эффектов
                  на переднем плане будет самый последний эффект в окне{" "}
                  <mark className="ui">Effect Controls</mark>.
                </li>
                <li>
                  Не все эффекты и сторонние плагины в{" "}
                  <mark className="app">After Effects</mark> поддерживают{" "}
                  <mark>GPU-ускорение</mark>. Эффекты, которые не поддерживают{" "}
                  <mark>GPU-ускорение</mark>, могут конфликтовать по скорости рендера с
                  теми эффектами, которые наоборот его поддерживают.
                </li>
              </ul>
            </AdditionWarning>
          </li>
          <li>
            Иногда проблемы с производительностью программы могут возникнуть из-за шрифтов
            в проекте. Да, такое бывает, когда вы используете кривой шрифт и даже не
            догадываетесь об этом. Для решения этой проблемы достаточно заменить шрифт на
            аналогичный или скачать его из другого источника.
          </li>
        </ul>
        <Divider>Отключаем Idle-кэширование для снижения нагрузки</Divider>
        <p>
          Если у вас лагает интерфейс программы и вам сложно в ней выполнять какие-либо
          действия, то скорее всего вы не заметили, что по умолчанию в{" "}
          <mark className="app">After Effects</mark> версии <mark>2022</mark> и новее
          включена функция <mark className="ui">Cache Frames When Idle</mark>. Данная
          функция начинает кэширование композиции, когда вы ничего не делаете.
        </p>
        <p>
          Часто на слабых устройствах эта функция заставляет тормозить программу и
          систему, особенно если у вас много эффектов, поэтому рекомендую его отключить.
          Для этого достаточно прожать комбинацию клавиш{" "}
          <mark className="key">Alt + Shift + I</mark> или выключить его в{" "}
          <mark className="ui">Composition &gt; Preview</mark>.
        </p>
        <ImageFigure
          caption="After Effects"
          imgSrc="images/aftereffects/disable_idle_cache.png"
          imgTitle="Отключение автоматического кэширования предпросмотра при бездействии"
          styleClass="figure_windows-light"
        />
        <Divider>Анализируем время рендера слоёв</Divider>
        <p>
          В <mark className="app">After Effects</mark> версии <mark>2022</mark> и новее
          добавили функционал <mark className="ui">Render Time</mark>, позволяющий увидеть
          время рендера того или иного эффекта в ваших слоях. С помощью него можно
          проанализировать производительность вашего проекта и по возможности
          оптимизировать его, заменив эффекты на более лёгкие или убрать их. Внизу окна с
          таймлайном пишется общее время рендера текущего кадра, вычисляя время рендера
          всех слоев.
        </p>
        <AdditionInfo>
          Чтобы включить отображение времени рендера того или иного слоя, нажмите на
          иконку улитки в левом нижнем углу окна таймлайна или включите колонку{" "}
          <mark className="ui">Render Time</mark> в пункте{" "}
          <mark className="ui">Columns</mark>, нажав <mark className="key">ПКМ</mark> по
          столбцам.
        </AdditionInfo>
        <ImageFigure
          caption="Timeline"
          imgSrc="images/aftereffects/view_render_time.png"
          imgTitle="Смотрим время рендера слоя"
          styleClass="figure_windows-dark"
        />
      </DetailsSummary>
      <DetailsSummary title="Какая версия программы считается наиболее стабильной, наименее лагучей и какую лучше всего установить?">
        <p>
          Этот вопрос останется предметом вечных дебатов в различных чатах и форумах по{" "}
          <mark className="app">Adobe After Effects</mark> без единого верного ответа.
          Причина в огромном разбросе мнений пользователей по поводу стабильности и
          быстродействия. Они могут работать с программой в разных сценариях, использовать
          разное железо и применять различные сторонние плагины, за стабильность которых{" "}
          <mark>Adobe</mark> особо не отвечает.
        </p>
        <p>
          Если вы надеетесь найти в этой статье номер <mark>чудо-версии</mark> программы,
          которая будет быстро работать на любом железе - попридержите коня. Выбор версии{" "}
          <mark className="app">Adobe After Effects</mark> само по себе слабо влияет на
          общую производительность, а устанавливая слишком старую версию - вы лишите себя
          новых функций и возможного улучшения пользовательского опыта, при этом получив
          малый профит.
        </p>
        <Divider>Ссылки на патч-ноуты от Adobe</Divider>
        <p>
          Если что - список обновлений, нововведений и исправлений в последних версиях{" "}
          <mark className="app">Adobe After Effects</mark> вы всегда можете посмотреть на
          официальном сайте Adobe.
        </p>
        <div className="flexible-links">
          <a href="https://helpx.adobe.com/ru/after-effects/using/whats-new.html">
            Что нового в After Effects последних выпусков
          </a>
          <a href="https://helpx.adobe.com/ru/after-effects/kb/fixed-issues.html">
            Список исправленных ошибок
          </a>
          <a href="https://helpx.adobe.com/ru/after-effects/kb/known-issues-after-effects.html">
            Выявленные неполадки в After Effects
          </a>
        </div>
        <Divider>Рекомендации по выбору версии</Divider>
        <ul>
          <li>
            Если вы не часто работаете в программе, любите новые функции или стабильность
            для вас не в приоритете - попробуйте установить и попользоваться{" "}
            <a href="https://helpx.adobe.com/ru/after-effects/using/whats-new.html">
              последней
            </a>{" "}
            версией <mark className="app">Adobe After Effects</mark> на момент чтения этой
            статьи, особенно если вы хотите перейти из предыдущих версий.
          </li>
          <li>
            Если вам нужна более откатанная пользователями, а также относительно
            современная версия программы - попробуйте версию <mark>24.1</mark> (2024),{" "}
            <mark>24.6</mark> (2024) или <mark>23.6</mark> (2023).
          </li>
          <li>
            Если процессор у вашего устройства не поддерживает{" "}
            <a href="https://www.youtube.com/watch?v=1IAwkEdRZZw">инструкции</a>{" "}
            <mark>AVX2</mark> - вы можете установить версию <mark>23.6</mark> (2023) или{" "}
            <mark>24.0</mark> (2024).
            <AdditionWarning>
              Если вы попытаетесь обойти требования по установке и попробуете запустите
              программу версии <mark>24.1</mark> или новее на неподдерживаемом процессоре
              - скорее всего вы нарвётесь на ошибку{" "}
              <mark className="code">0xc0000142</mark> при запуске программы. Обойти это
              нельзя - придётся раскошелиться на новый процессор с поддержкой инструкций{" "}
              <mark>AVX2</mark>.
            </AdditionWarning>
          </li>
          <li>
            Если вы используете устройство на <mark>Windows 7</mark> или{" "}
            <mark>Windows 8.1</mark> - установите версию <mark>16.1</mark> (2019) или{" "}
            <mark>15.1</mark> (2018). Более свежую версию программы вы не сможете
            установить из-за окончания официальной поддержки этих операционных систем
            компаниями <mark>Adobe</mark> и <mark>Microsoft</mark>.
            <AdditionWarning>
              <ul>
                <li>
                  Если вы попытаетесь обойти требования по установке или попробуете
                  запустить программу на старой операционной системе - вероятность его
                  успешно запустить крайне мала, так как скорее всего вы нарветесь на
                  различные ошибки при запуске.
                </li>
                <li>
                  Если у вас программа более свежей версии, чем <mark>16.1</mark>, всё же
                  запустилась на неподдерживаемой операционной системе - стабильная работа
                  программы{" "}
                  <b>
                    <u>не гарантируется!</u>
                  </b>
                </li>
              </ul>
            </AdditionWarning>
          </li>
        </ul>
        <Divider>А как переезжать из одной версии в другую?</Divider>
        <p>
          При переходе с одной версии <mark className="app">Adobe After Effects</mark> на
          другую в пределах <mark className="word">одного года</mark>, например из{" "}
          <mark>24.1</mark> в <mark>24.6</mark> - никакие файлы переносить не нужно.
          Установщик программы в таком случае перезапишет старые файлы программы и не
          затронет пользовательские файлы, в том числе и установленные плагины. При
          запуске новой версии <mark className="app">Adobe After Effects</mark> вам
          предложат перенести настройки пользователя со старой версии программы в новую.
        </p>
        <p>
          Но, если вы решили обновить программу с{" "}
          <mark className="word">одного года</mark> на другой, например с{" "}
          <mark>23.6</mark> на <mark>25.2</mark>, то в таком случае уже потребуется ручной
          перенос плагинов и пресетов в новую версию программы. При установке{" "}
          <mark className="word">другого года</mark> - старая версия программы останется
          на вашем устройстве и не будет автоматически удалена.{" "}
          <a href="#4.3">Подробнее про перенос...</a>
        </p>
        <AdditionWarning>
          Пожалуйста, не забывайте своевременно обновлять сторонние плагины и поддерживать
          вашу операционную систему в хорошем состоянии, периодически очищая его от
          мусора. Устанавливая свежие версии{" "}
          <mark className="app">Adobe After Effects</mark>, не обновляя дополнительные
          надстройки для него - вы рискуете нарваться на различные проблемы при
          использовании программы.{" "}
          <i style={{opacity: "0.5"}}>
            Именно такие несостыковки часто становятся причиной путаницы в обсуждениях на
            форумах или в чатах - когда один говорит, что всё работает, а у другого всё
            разваливается.
          </i>
        </AdditionWarning>
      </DetailsSummary>
      <DetailsSummary
        tag="железо, выбор оптимального пк, сборка"
        title="Какой компьютер или ноутбук стоит купить для работы в Adobe After Effects?"
      >
        <AdditionDanger>
          <ul>
            <li>
              Приведённая в статье информация несёт лишь общие рекомендации по железу и не
              призывает брать какое-либо конкретное устройство. Конечный выбор нового
              устройства остаётся за читателем.
            </li>
            <li>
              Если вы не знаете, что вам выбрать - проконсультируйтесь с специалистами в
              технических чатах, которые вы можете найти на{" "}
              <a href="/">главной странице сайта</a>.
            </li>
            <li>
              Системные требования для <mark className="app">Adobe After Effects</mark> вы
              можете найти на{" "}
              <a href="https://helpx.adobe.com/after-effects/system-requirements.html">
                официальном сайте Adobe
              </a>
              .
            </li>
          </ul>
        </AdditionDanger>
        <p>
          Прежде чем рассуждать о выборе устройства для работы в{" "}
          <mark className="app">Adode After Effects</mark> - для начала определитесь,
          какая операционная система вам лучше подходит, для каких целей вы собираетесь
          брать устройство и на какой бюджет. Вдруг вы планируете работать и в{" "}
          <mark className="app">Cinema 4D</mark> или <mark className="app">Blender</mark>,{" "}
          помимо программ от <mark>Adobe</mark>?
        </p>
        <Divider>Если вы хотите приобрести устройство на Windows</Divider>
        <p>
          Выбор устройства на <mark>Windows</mark> чаще всего зависит от двух факторов: от
          вашего бюджета и какой тип самого устройства вы хотите приобрести - стационарный
          ПК или ноутбук. Выбор блоков питания, жёстких дисков и других комплектующих в
          этой статье затрагиваться не будет.
        </p>
        <ul>
          <li>
            Если бюджет ограничен, скажем, до <mark>1000 USD</mark>, и вы редко работаете
            вне дома - скорее всего, вам хватит стационарного ПК. Поскольку{" "}
            <mark className="app">Adobe After Effects</mark> больше грузит процессор,
            основное внимание стоит уделить именно ему. Видеокарта тоже нужна, даже
            базовая - без неё не обойтись. Для минимально комфортной работы подойдёт{" "}
            <mark>Intel i7-11700</mark> или <mark>AMD Ryzen 7 5800</mark>, видеокарта
            уровня <mark>NVIDIA RTX 3060 на 12 ГБ</mark> или мощнее, и хотя бы{" "}
            <mark>16-32 ГБ</mark> оперативной памяти.
            <AdditionWarning>
              <ul>
                <li>
                  Процессоры от <mark>Intel</mark> лучше подойдут для работы с некоторыми
                  видеоисходниками за счёт{" "}
                  <a href="https://www.pugetsystems.com/labs/articles/what-h-264-and-h-265-hardware-decoding-is-supported-in-premiere-pro-2120/">
                    встроенного видеочипа, который отвечает за декодирование
                  </a>
                  . Ни в коем случае не стоит брать процессор от <mark>Intel</mark> без
                  видеочипа, то есть с суффиксом <mark>F</mark> в конце наименования, даже
                  если вас убеждают в обратном.{" "}
                  <a href="https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D1%80%D0%BA%D0%B8%D1%80%D0%BE%D0%B2%D0%BA%D0%B0_%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D1%80%D0%BE%D0%B2_%D1%84%D0%B8%D1%80%D0%BC%D1%8B_Intel">
                    Подробнее о наименовании процессоров Intel...
                  </a>
                </li>
                <li>
                  Процессоры от <mark>AMD</mark> тоже хороши за счёт хорошего соотношения
                  цены и производительности по ядрам, если создаёте композиции с нуля без
                  частого использования различных видеоисходников. При использовании
                  видеокарты <mark>NVIDIA 5000 серии</mark> - необходимость встроенного
                  видеоядра для декодирования исходников, как у <mark>Intel</mark>,{" "}
                  отпадает.
                </li>
                <li>
                  Видеокарты от <mark>AMD</mark> не очень хорошо подходят для серьёзной
                  работы в программах <mark>Adobe</mark> из-за отсутствия внятной
                  поддержки этих видеокарт. Далеко не все сторонние плагины с поддержкой{" "}
                  <mark>GPU-ускорения</mark> поддерживают работу с такими видеокартами.
                  Только с недавних пор некоторые разработчики начинают адаптировать
                  эффекты для видеокарт <mark>AMD</mark> - привет, <mark>BorisFX</mark> с
                  их <mark className="plugin">Sapphire</mark>. Соотношение количества
                  плагинов, адаптированных под видеокарты <mark>NVIDIA</mark> явно больше,
                  чем тех, что адаптированы под видеокарты <mark>AMD</mark>.
                </li>
              </ul>
            </AdditionWarning>
          </li>
          <li>
            Если у вас бюджет больше, чем <mark>1000 USD</mark> и вы хотите всё же
            приобрести стационарный компьютер - рассмотрите сборки с использованием свежих
            видеокарт <mark>NVIDIA RTX 4000/5000 серии</mark>, минимум{" "}
            <mark>32-64 ГБ</mark> оперативной памяти и процессора от <mark>Intel</mark>{" "}
            или <mark>AMD</mark> седьмой серии или мощнее.
            <AdditionWarning>
              На момент написания этой статьи не все монтажные программы полностью
              адаптированы под работу с видеокартами <mark>NVIDIA RTX 5000 серии</mark>.
            </AdditionWarning>
          </li>
          <li>
            Если у вас уже дома есть стационарный мощный компьютер и вы хотите приобрести
            ноутбук для редактирования небольших правок вне дома или быстрой сборки
            проекта на начальном этапе, чтобы потом продолжить работу на стационаре - вы
            можете рассмотреть бюджетные варианты, например{" "}
            <mark className="copy">ASUS Vivobook</mark> на процессорах минимум{" "}
            <mark>AMD Ryzen 7 серии</mark> или <mark>Intel Core i7</mark> без дискретной
            видеокарты, <mark className="copy">Lenovo IdeaPad Gaming</mark> на дискретной{" "}
            <mark>RTX 3050</mark> или <mark className="copy">MSI Katana</mark> на{" "}
            <mark>Intel Core i7</mark>.
            <AdditionWarning>
              <ul>
                <li>
                  Смотреть на ноутбуки с дискретной видеокартой от <mark>NVIDIA</mark>, по
                  типу <mark>RTX 4050</mark> или <mark>RTX 3050</mark> нужно с
                  осторожностью. Некоторые бюджетные ноутбуки с дискретной видеокартой
                  могут быть слабыми по процессорной части, а также могут быть урезаны по
                  теплопакету, то есть могут выдавать меньше мощности, чем заявлено. Так
                  как <mark className="app">Adobe After Effects</mark> чаще всего работает
                  с процессором и оперативной памятью - стоит расмотреть модели с упором
                  на эти комплектующие.
                </li>
                <li>
                  Если вам нужна точность цветопередачи - внимательно смотрите на
                  характеристики экрана, используемые в бюджетных ноутбуках. На некоторых
                  моделей матрицы выводят изображение в ограниченном цветовом диапазоне и
                  не попадают в <mark className="copy">sRGB 100%</mark>. Также обращайте
                  внимание на максимальную яркость экрана, если вы работаете в условиях
                  яркой освещенности - его значение должно быть как минимум{" "}
                  <mark>400 кд/м</mark>.
                </li>
              </ul>
            </AdditionWarning>
          </li>
          <li>
            Если вам нужна мобильность, часто путешествуете вне вашего места проживания
            или если у вас нет стационарного компьютера - на ноутбук придётся немного
            больше раскошелиться, ведь оно будет вашей единственной рабочей машиной. В
            таком случае рассмотрите линейку ноутбуков{" "}
            <mark className="copy">ASUS Vivobook Pro</mark>,{" "}
            <mark className="copy">ASUS Zenbook</mark>,{" "}
            <mark className="copy">Lenovo Legion</mark>,{" "}
            <mark className="copy">HUAWEI MateBook X Pro</mark> или{" "}
            <mark className="copy">MSI CreatorPro</mark>. При выборе нужной модели
            ноутбука - не забывайте смотреть на параметр ёмкости аккумулятора, если вам
            нужна долгая работа от батареи. Также большинство производителей предлагает
            один и тот же корпус, но с разными характеристиками под ваш вкус, бюджет и
            потребности.
          </li>
        </ul>
        <Divider>Если вы хотите приобрести устройство на macOS</Divider>
        <ul>
          <li>
            Если вы хотите взять первый ноутбук от <mark>Apple</mark> или переехать с{" "}
            <mark>MacBook</mark> на базе <mark>Intel</mark> - посмотрите в сторону{" "}
            <mark className="copy">MacBook Air</mark> или{" "}
            <mark className="copy">MacBook Pro</mark> на процессоре{" "}
            <mark>Apple M1 Pro</mark> или мощнее. В качестве комплектации стоит взять
            минимум <mark>16 ГБ</mark> оперативной и <mark>512 ГБ</mark> постоянной
            памяти. Работа с <mark>8 ГБ</mark> оперативной памяти будет тяжеловата, даже
            несмотря на то, что <mark>macOS</mark> распределяет оперативную память вместе
            с файлом подкачки с помощью <mark>Unified Memory</mark>.
          </li>
          <li>
            Если вы не часто путешествуете, хотите миниатюрный компьютер или ноутбуки{" "}
            <mark>MacBook</mark> оказались для вас дорогими - вам может подойти{" "}
            <mark className="copy">Mac Mini</mark> или{" "}
            <mark className="copy">Mac Studio</mark> на процессоре <mark>Apple M4</mark>{" "}
            или мощнее. Его можно взять, если у вас уже есть дома хороший монитор,
            клавиатура и мышь. Из комплектации также советуем брать минимум с{" "}
            <mark>16-24 ГБ</mark> оперативной и <mark>512 ГБ</mark> постоянной памяти.
          </li>
        </ul>
        <Divider>Дополнительная информация для размышлений</Divider>
        <div className="flexible-links">
          <a href="https://www.pugetsystems.com/solutions/video-editing-workstations/adobe-after-effects/hardware-recommendations/">
            Рекомендации по железу от Puget Systems
          </a>
          <a href="https://helpx.adobe.com/premiere-pro/kb/hardware-recommendations.html">
            Рекомендации по оборудованию от Adobe
          </a>
        </div>
        <YouTubeVideo
          caption="Как выбрать ноутбук или ПК для After Effects?"
          link="wdXf4ngU4fM"
        />
        <YouTubeVideo
          caption="M4 Max / Pro против всех поколений - что взять в 2025?"
          link="bbcnEiu02uc"
        />
      </DetailsSummary>
      <DetailsSummary
        tag="disable idle caching, выключить кеширование при простое, очень тормозит и зависает программа при выполнении какого-нибудь действия после небольшой паузы"
        title="Как отключить автоматическое кэширование предпросмотра при бездействии?"
      >
        <p>
          Функция автоматического кэширования кадров текущей композиции во время простоя
          была добавлена в <mark className="app">Adobe After Effects</mark> версии{" "}
          <mark>2022</mark> и новее, и включена по умолчанию. Эта функция может часто
          мешает комфортной работе с проектом на слабых компьютерах или с нагруженными
          эффектами, нагружая системные компоненты лишний раз и заполняя оперативную
          память. Также из-за такого поведения некоторые{" "}
          <mark className="word">староверы</mark> не очень охотно переходят на более новые
          версии программы, ссылаясь на то что{" "}
          <mark className="quote">
            у них всо лагает на нових версыях в прастых девствиях!!1!
          </mark>
          . Благо в <mark>Adobe</mark> при внедрении этой функции додумались дать
          возможность пользователям отключения кэширования в простое.{" "}
          <i style={{opacity: "0.5"}}>И не все об этом в курсе.</i>
        </p>
        <Divider>Отключаем кэширование при простое</Divider>
        <p>
          Для отключения автоматического кэширования при бездействии пользователя,
          перейдите в <mark className="ui">Composition &gt; Preview</mark> и выключите
          галочку <mark className="ui">Cache Frames When Idle</mark> или прожмите
          комбинацию клавиш <mark className="key">Alt + Shift + I</mark>.
        </p>
        <ImageFigure
          caption="Adobe After Effects"
          imgSrc="images/aftereffects/disable_idle_cache.png"
          imgTitle="Отключение автоматического кэширования предпросмотра при бездействии"
          styleClass="figure_windows-light"
        />
        <Divider>Настраиваем функцию кэширования в простое</Divider>
        <p>
          Если вы не хотите отключать эту функцию, но хотите изменить время, после
          которого начнётся автоматического кэширования, то перейдите в{" "}
          <mark className="ui">Edit &gt; Preferences &gt; Previews</mark>. В параметре{" "}
          <mark className="ui">Idle Delay Before Caching Starts</mark> вы можете указать
          любое число от <mark>2</mark> до <mark>15</mark>.
        </p>
        <AdditionInfo>
          Чуть ниже этого параметра вы можете настроить область кэширования и направление
          кэширования - <mark>вокруг временной метки</mark>,{" "}
          <mark>от временной метки</mark> или <mark>от начала рабочей области</mark>.
        </AdditionInfo>
        <ImageFigure
          caption="Preferences"
          imgSrc="images/aftereffects/change_time_idle_cache.png"
          imgTitle="Изменение времени для автоматического кэширования при бездействии"
          styleClass="figure_windows-dark"
        />
      </DetailsSummary>
      <DetailsSummary
        tag="mercury gpu acceleration, software only, video rendering, ракета"
        title='Для чего пользователи иногда настраивают рендеринг "только через процессор", а не с использованием видеокарты и как это сделать?'
      >
        <p>
          В <mark className="app">Adobe After Effects</mark> существует два типа ускорения
          - аппаратное и программное, и каждый работает с конкретным проектом по разному.
          В некоторых случаях пользователю может пригодиться изменение аппаратного
          ускорения на программное, чтобы избавиться от некоторых проблем при
          использовании <mark className="word">Mercury GPU Acceleration</mark>. Например,
          переполнение видеопамяти процессора, различные артефакты или остановка рендера
          без внятной причины. Или наоборот, когда стандартный эффект, например{" "}
          <mark className="plugin">VR Chromatic Abberation</mark>, просит включить
          аппаратное ускорение, если у вас включено{" "}
          <mark className="word">Mercury Software Only</mark>.
        </p>
        <p>
          Чтобы изменить тип ускорения - откройте окно{" "}
          <mark className="ui">Project Manager</mark> c помощью комбинации клавиш{" "}
          <mark className="key">Ctrl + Alt + Shift + K</mark> или{" "}
          <mark className="ui">File &gt; Project Manager</mark>. По умолчанию при открытии
          данного окна вы попадаете во вкладку{" "}
          <mark className="ui">Video Rendering and Effects</mark>, в котором есть один
          изменяемый параметр <mark className="ui">Use</mark>, который и отвечает за
          изменение типа ускорения рендера.
        </p>
        <AdditionInfo>
          Окно <mark className="ui">Project Manager</mark> часто называют{" "}
          <mark className="word">ракетой</mark>, так как{" "}
          <mark className="ui">иконка космической ракеты</mark> в окне{" "}
          <mark className="ui">Project</mark> открывает это окно.
        </AdditionInfo>
        <ImageFigure
          caption="Project Manager"
          imgSrc="images/aftereffects/project_manager_mercury.png"
          imgTitle="Переключение типа рендера"
          styleClass="figure_windows-dark"
        />
        <ul>
          <li>
            <mark className="ui">Mercury Software Only</mark> или{" "}
            <mark className="word">программное ускорение</mark> позволит{" "}
            <mark className="app">Adobe After Effects</mark> реже прибегать к
            использованию видеокарты и использовать в большинстве случаев рендеринг на
            процессоре. Рендеринг на процессоре обычно стабильнее, нежели при рендеринге с
            использованием видеокарты.
            <AdditionInfo>
              <ul>
                <li>
                  Если у вас включен данный параметр рендеринга, то какой-нибудь сторонний
                  эффект всё же может просчитаться через видеокарту при необходимости,
                  например <mark className="plugin">Depth Scanner</mark>. Обычно это
                  поведение можно изменить в настройках плагина.
                </li>
                <li>
                  С данным параметром рендеринга время просчёта композиций может
                  измениться в худшую или лучшую сторону - зависит от железа, но в сложных
                  композициях зачастую время остаётся неизменным. Иногда при рендеринге на
                  процессоре просчёт может пройти быстрее, чем при использовании{" "}
                  <mark className="ui">Mercury GPU Acceleration</mark>.
                </li>
              </ul>
            </AdditionInfo>
          </li>
          <li>
            <mark className="ui">Mercury GPU Acceleration</mark> или{" "}
            <mark className="word">аппаратное ускорение</mark> позволит программе
            использовать при рендеринге и процессор, и видеокарту. Видеокарта будет
            использоваться в тех случаях, если применённый эффект поддерживает его. Иногда
            данное значение может быть продублировано. Обычно рядом с ним находится ещё
            технология ваших видеокарт, например <mark>CUDA (NVIDIA)</mark>,{" "}
            <mark>OpenСL (AMD)</mark>, <mark>OpenGL (Intel)</mark> или{" "}
            <mark>Metal (Apple Silicon)</mark>.
            <AdditionWarning>
              На видеокартах с малым объёмом <mark>VRAM</mark> вы можете часто
              сталкиваться с ошибкой{" "}
              <mark>
                After Effects has encountered a failure related to GPU-enabled effects
                from this frame
              </mark>
              . Это происходит из-за переполнения видеопамяти. В таком случае{" "}
              <mark className="app">Adobe After Effects</mark> предложит переключиться
              обратно на <mark>Mercury Software Only</mark>.
            </AdditionWarning>
            <AdditionDanger>
              <ul>
                <li>
                  Если смешать на одном слое эффект, который поддерживает{" "}
                  <mark>GPU-ускорение</mark> и который не поддерживает, то скорость
                  рендера слоя упрётся в скорость обработки эффекта, который выполняется с
                  помощью процессора.
                </li>
                <li>
                  Часто бытует мнение, что при включенном{" "}
                  <mark className="ui">Mercury GPU Acceleration</mark> видеокарта якобы
                  обязана использоваться во всех случаях рендера. Это так не работает -{" "}
                  программа будет его использовать только при необходимости, а не по вашей
                  прихоти. <mark className="app">Adobe After Effects</mark> по большей
                  части использует процессор для обработки большинства действий, но
                  разработчики стандартных и сторонних эффектов в последнее время все чаще
                  и чаще добавляют поддержку ускорения с помощью видеокарты.
                </li>
              </ul>
            </AdditionDanger>
          </li>
        </ul>
        <Divider>Какие эффекты поддерживают GPU-ускорение?</Divider>
        <p>
          Для того чтобы посмотреть список тех эффектов, которые поддерживают{" "}
          <mark>GPU-ускорение</mark> - откройте окно{" "}
          <mark className="ui">Effects & Presets</mark> и в его контекстном меню включите
          параметр <mark className="ui">Show GPU Capable Effects Only</mark>. После его
          включения вы заметите, насколько сильно сократится список ваших эффектов.
        </p>
        <ImageFigure
          caption="Adobe After Effects"
          imgSrc="images/aftereffects/show_gpu_capable_effects_only.png"
          imgTitle="Включение отображение только тех эффектов, которые поддерживают GPU-ускорение"
          styleClass="figure_windows-dark"
        />
      </DetailsSummary>
    </div>
  );
};

export default AEPerformance;
