import React from "react";
import DetailsSummary from "../../../components/DetailsSummary";
import GithubUpdateInfo from "../../../components/features/GithubUpdateInfo";
import {
  AdditionDanger,
  AdditionInfo,
  AdditionWarning,
} from "../../../components/Additions";
import ContentSwitcher from "../../../components/features/ContentFilter";
import {ImageFigure, VideoFigure, YouTubeVideo} from "../../../components/ContentFigure";
import {Divider} from "antd";

const AETips: React.FC = () => {
  return (
    <div className="faq-content">
      <GithubUpdateInfo filePath="src/pages/sections/aefaq/Tips.tsx" />
      <DetailsSummary
        tag="бекап, резервное копирование, возврат, вернуть, восстановить, облачное хранилище, облако, яндекс диск, журнал файлов, бэкап, история изменений файлов, откат проекта"
        title="Чем я могу сделать резервные копии файлов и, при необходимости, возвращаться к предыдущим версиям файлов?"
      >
        <p>
          Бывают ситуации, когда после внесённых изменений клиенту результат не подходит,
          и требуется вернуться к предыдущей версии проекта. Или, например,{" "}
          <mark className="file">.aep</mark> файл неожиданно сломался и перестал корректно
          открываться, выбивая ошибку{" "}
          <mark className="ui">Bad format or not readable</mark> или{" "}
          <mark className="ui">File is damaged</mark>. Если заранее позаботиться о
          резервном копировании ваших файлов - подобных проблем можно было бы избежать,
          сэкономив время и усилия на восстановление данных. Есть два варианта создания
          резервного копирования - на облачном хранилище или локально на вашем устройстве
          или сервере.
        </p>
        <AdditionInfo>
          Если вы хотите быстро сохранить открытый проект под другим названием -
          воспользуйтесь комбинацией клавиш{" "}
          <mark className="key">Ctrl + Alt + Shift + S</mark>. Данная команда сохранит
          проект с тем же названием и добавит число в конце по возрастанию.
        </AdditionInfo>
        <Divider>Создаём резервные копии на облачном хранилище</Divider>
        <p>
          Самый простой способ организовать резервное копирование различных файлов
          проектов - воспользоваться услугами облачного хранилища и настроить
          автоматическую синхронизацию файлов на вашем компьютере с сервером. У популярных
          облачных хранилищ, например <mark>Яндекс.Диск</mark>, <mark>Google Drive</mark>{" "}
          или <mark>Dropbox</mark>, есть собственные клиенты для <mark>Windows</mark> и{" "}
          <mark>macOS</mark> для того, чтобы настроить автоматическую синхронизацию
          указанных вами папок.
        </p>
        <p>
          Также у многих популярных облачных хранилищ есть функция восстановления файлов
          при их изменении на сервере или случайном удалении на вашем устройстве. Это
          бывает очень полезно, если вы случайно перезаписали нужный файл проекта другим
          файлом с одинаковым названием. С помощью истории файлов можно быстро выкачать
          предыдущую версию. Учтите, что у каждого сервиса свой срок хранения истории
          файлов и корзины - уточняйте это в вашем тарифном плане.
        </p>
        <div className="flexible-links">
          <a href="https://yandex.ru/support/yandex-360/customers/disk/desktop/windows/ru/version-control">
            История изменения файла в Яндекс.Диск
          </a>
          <a href="https://support.google.com/drive/answer/2409045?hl=ru&co=GENIE.Platform%3DDesktop">
            Журнал файлов в Google Drive
          </a>
          <a href="https://help.dropbox.com/ru-ru/delete-restore/version-history-overview">
            Журнал версий файлов в Dropbox
          </a>
          <a href="https://help.mega.io/ru/files-folders/restore-delete/file-version-history">
            Как управлять версиями файлов в Mega?
          </a>
          <a href="https://support.microsoft.com/ru-ru/office/%D0%B2%D0%BE%D1%81%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BF%D1%80%D0%B5%D0%B4%D1%8B%D0%B4%D1%83%D1%89%D0%B5%D0%B9-%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%B8-%D1%84%D0%B0%D0%B9%D0%BB%D0%B0-%D1%85%D1%80%D0%B0%D0%BD%D1%8F%D1%89%D0%B5%D0%B3%D0%BE%D1%81%D1%8F-%D0%B2-onedrive-159cad6d-d76e-4981-88ef-de6e96c93893">
            Восстановление предыдущей версии файла в OneDrive
          </a>
        </div>
        <Divider>
          Создаём локальные резервные копии файлов стандартными функциями операционной
          системы
        </Divider>
        <p>
          Если вам вариант с облачным хранилищем не подходит по каким-то причинам, то вы
          можете организовать свою локальную систему резервного копирования. В{" "}
          <mark>Windows</mark> и <mark>macOS</mark> есть функция локального резервного
          копирования файлов, которую необходимо включить. Обычно для работы этой функции
          требуется внешний или отдельный накопитель.
        </p>
        <ContentSwitcher
          macContent={
            <div>
              <p>
                В <mark>macOS</mark> функция бэкапа файлов называется{" "}
                <mark className="app">Time Machine</mark>, которая создаёт снапшот вашей
                системы и файлов каждый час или по нажатию кнопки создания бэкапа.
              </p>
              <AdditionWarning>
                Для работы данной функции нужен внешний накопитель, желательно с объёмом
                от <mark>512 ГБ</mark> и более.
              </AdditionWarning>
              <YouTubeVideo
                caption="How to Set up & Use Time Machine to Backup your Mac"
                link="Gx76i28c150"
              />
            </div>
          }
          windowsContent={
            <div>
              <p>
                В <mark>Windows</mark> стандартная функция бэкапа файлов называется{" "}
                <mark className="app">История файлов</mark>, которая создаёт копии файлов
                на другую директорию. С помощью него вы можете восстановить удалённый файл
                или вернуть предыдущую версию файла в свойствах файла.
              </p>
              <AdditionInfo>
                Для работы данной функции заранее укажите диск, на который вы планируете
                сохранять копии файлов в разделе <mark className="ui">Смена диска</mark>.
              </AdditionInfo>
              <YouTubeVideo
                caption="История файлов в Windows 11 и Windows 10"
                link="xDFQEx9gylc"
              />
              <p>
                В настройках этой функции можно установить интервал сохранения от{" "}
                <mark>10 минут</mark> до <mark>одного раза в день</mark>. Также можно
                задать срок хранения от <mark>одного месяца</mark> до{" "}
                <mark>двух лет</mark>, по истечении которого система автоматически удалит
                старые резервные копии из указанной директории.
              </p>
              <AdditionInfo>
                <p>
                  По умолчанию функция <mark className="app">История файлов</mark>{" "}
                  копирует только из стандартных папок{" "}
                  <mark className="path">Библиотеки</mark>,{" "}
                  <mark className="path">Рабочий стол</mark>,{" "}
                  <mark className="path">Контакты</mark> и{" "}
                  <mark className="path">Избранное</mark>. Если вам нужно установить свои
                  папки, откуда нужно копировать файлы - зайдите в параметры и создайте
                  свою библиотеку.
                </p>
                <ul>
                  <li>
                    На <mark>Windows 11</mark> - откройте проводник, выберите нужную папку
                    и нажмите на <mark className="key">ПКМ</mark>. Затем в контекстном
                    меню нажмите на <mark className="ui">Добавить в библиотеку</mark>. Вы
                    можете выбрать уже существующую библиотеку или создать новую.
                    <AdditionWarning>
                      Если у вас нет кнопки{" "}
                      <mark className="ui">Добавить в библиотеку</mark> в контекстном меню
                      - включите их отображение в параметрах папок.{" "}
                      <a href="https://remontka.pro/manage-libraries-windows/">
                        Подробнее...
                      </a>
                    </AdditionWarning>
                  </li>
                </ul>
              </AdditionInfo>
            </div>
          }
        />
        <Divider>
          Альтернативные варианты контроля версий файлов и их резервного копирования
        </Divider>
        <p>
          В качестве альтернативных вариантов контроля версий и резервного копирования вы
          можете воспользоваться <mark className="app">Git</mark>, который доступен для{" "}
          <a href="https://git-scm.com/downloads/win">Windows</a> и{" "}
          <a href="https://git-scm.com/downloads/mac">macOS</a>, или создать свой сервер с
          помощью любого устройства, будь то <mark>Raspberry Pi</mark> или старый
          компьютер. Здесь особо об этом расписывать не буду, но при всём желании - некую
          часть информации вы можете найти в интернете. Если вы решили контролировать свои
          файлы с помощью <mark className="app">Git</mark>, то советую клиенты{" "}
          <mark className="app">SourceGit</mark> или{" "}
          <mark className="app">SourceTree</mark>.
        </p>
        <YouTubeVideo
          caption="Объясняем на пальцах про Git"
          link="G4f9OH4IQE8"
        />
      </DetailsSummary>
      <DetailsSummary
        tag="рекомендация, топ, твикстор, рсмб, мбл, борисфх, трапкод, флоу, тру комп дупликатор, юниверс, mbl"
        title="Какие плагины мне стоит поставить в первую очередь для программы?"
      >
        <AdditionWarning>
          Сразу хочу{" "}
          <b>
            <u>предупредить</u>
          </b>{" "}
          - пожалуйста, не надо скачивать и устанавливать в{" "}
          <mark className="app">Adobe After Effects</mark> все плагины мира подряд, так
          как это может привести к снижению производительности программы. Для начала
          определитесь с тем, что вам действительно нужно. Рекомендации автора по списку
          сторонних плагинов может не совпадать с вашим мнением.
        </AdditionWarning>
        <p>
          <mark className="plugin">Плагины</mark> - вещь действительно интересная и
          полезная, особенно когда оно ускоряет работу за счёт автоматизации рутинных
          задач. Вот мой личный список плагинов, которые я ставлю при каждой установке
          программы.
        </p>
        <Divider>Для совместимости с чужими проектами</Divider>
        <ul>
          <li>
            <mark className="plugin">Boris FX Sapphire</mark> и{" "}
            <mark className="plugin">Boris FX Continuum</mark> - база из всех баз.
            Особенно популярен у <del>мамкиных</del> эдиторов, они без него жить не могут.
          </li>
          <li>
            <mark className="plugin">Boris FX Mocha Pro</mark> - расширенная версия
            стандартного плагина <mark className="plugin">Mocha AE</mark>.
          </li>
          <li>
            Плагины от Red Giant: <mark className="plugin">Magic Bullet Suite</mark>,{" "}
            <mark className="plugin">Trapcode Suite</mark>,{" "}
            <mark className="plugin">VFX Suite</mark> и{" "}
            <mark className="plugin">Universe</mark> - сборник плагинов для цветокора,
            частиц и различных эффектов. Особенно хорош{" "}
            <mark className="plugin">Primatte Keyer</mark> и{" "}
            <mark className="plugin">Supercomp</mark> для решения повседневных задач по
            композингу.
          </li>
          <li>
            <mark className="plugin">Element 3D от VideoCopilot</mark> - даже после выхода
            Advanced 3D - этот плагин не теряет актуальности в плане импорта 3D-моделей в
            вашу композицию.
          </li>
          <li>
            <mark className="plugin">Deep Glow</mark> - даёт хорошее свечение, но неплохо
            замедляет скорость экспорта. Если производительность проекта вам очень важна -
            замените его на более простые решения.
          </li>
          <li>
            <mark className="plugin">Twixtor</mark> и <mark className="plugin">RSMB</mark>{" "}
            - плагины для плавного замедления и интерполяции соседних кадров.
          </li>
          <li>
            <mark className="plugin">Crates Light Wrap</mark> - создаёт контурный свет для
            объекта за счёт размытия указанного фонового слоя в параметрах плагина.
          </li>
        </ul>
        <Divider>Полезные инструменты</Divider>
        <ul>
          <li>
            <mark className="plugin">FXConsole от VideoCopilot</mark> - всплывающая
            панелька для быстрого поиска и применения эффектов и пресетов.
          </li>
          <li>
            <mark className="plugin">Flow</mark> - расширение для быстрого применения
            интерполяции ключей. Если создать свои пресеты, которыми часто пользуешься в
            анимации - ускоришь свою рутинную работу в несколько раз.
          </li>
          <li>
            <mark className="plugin">Motion Tools Pro</mark> - набор инструментов для
            анимации. Полностью настраиваемый.
          </li>
          <li>
            <mark className="plugin">kBar</mark> - полностью настраиваемая панель для
            прикрепления различных действий на кнопки, например: применение готовых
            выражений, применение пресетов и эффектов, открытие различных меню в программе
            и многое другое.
          </li>
          <li>
            <mark className="plugin">Keystone</mark> - инструмент для манипуляций над
            ключевыми кадрами и слоями на таймлайне: растягивание, смещение, выравнивание
            и много чего другого.
          </li>
          <li>
            <mark className="plugin">Newton</mark> - плагин для создания физического
            поведения 2D-объектов.
          </li>
          <li>
            <mark className="plugin">True Comp Duplicator</mark> - скрипт для дублирования
            композиций с нужными параметрами.
          </li>
          <li>
            <mark className="plugin">rd_compsetter</mark> - скрипт для одновременного
            изменения параметров нескольких композиций.
          </li>
          <li>
            <mark className="plugin">Workflower</mark> - плагин для организации слоёв на
            таймлайне, позволяет делать папки со слоями без прекомпоза.
            <AdditionDanger>
              Не рекомендуется передавать проект с использованием этого плагина другим
              лицам, у которых не установлен этот плагин. Иначе столкнётесь с неожиданными
              результатами.
            </AdditionDanger>
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        tag="обновление, перенос плагинов и пресетов, новая версия афтера"
        title="Я хочу обновить программу с одной версии на другую. В каких случаях мне нужно будет переносить плагины и как это сделать без танцев с бубнами?"
      >
        <p>
          Обновления программы - это вещь хорошая, так как разработчики добавляют
          различные новые функции или исправляют старые баги. У некоторых пользователей
          часто возникает вопрос про то, как правильно обновляться и нужно ли что-то
          делать из дополнительных действий после обновления{" "}
          <mark className="app">Adobe After Effects</mark>. На данный момент есть два вида
          обновлений - между <mark className="word">одним годом</mark> и между{" "}
          <mark className="word">разными годами</mark>.
        </p>
        <AdditionInfo>
          Под <mark className="word">годом</mark> обычно подразумевается годовое число в
          названии версии программы, например{" "}
          <mark className="app">Adobe After Effects 2023</mark> или{" "}
          <mark className="app">Adobe Media Encoder 2025</mark>.
        </AdditionInfo>
        <Divider>Переход между версиями одного года</Divider>
        <p>
          При переходе с одной версии <mark className="app">Adobe After Effects</mark> на
          другую в пределах <mark className="word">одного года</mark>, например из{" "}
          <mark>24.1</mark> в <mark>24.6</mark> - ничего из файлов плагинов и пресетов
          переносить не нужно. Установщик в таком случае перезапишет старые файлы
          программы в том расположении, где она была установлена и не затронет
          пользовательские файлы. При запуске новой версии{" "}
          <mark className="app">Adobe After Effects</mark> вам предложат перенести
          настройки пользователя со старой версии программы в новую.
        </p>
        <ImageFigure
          caption="Adobe After Effects"
          imgSrc="images/aftereffects/migrate_settings.png"
          imgTitle="Диалог переноса настроек со старой версии в более новую"
          styleClass="figure_windows-dark"
        />
        <AdditionInfo>
          Если вы случайно закрыли окно с вопросом про перенос настроек из старой версии,
          то вы его можете открыть снова в{" "}
          <mark className="ui">
            Edit &gt; Preferences &gt; Startup & Repair &gt; Migrate Previous Version
            Preferences
          </mark>
          . В старых версиях <mark className="app">Adobe After Effects</mark> данная
          кнопка находится в разделе <mark className="ui">General</mark>.
        </AdditionInfo>
        <Divider>Обновление с одного года на другой</Divider>
        <p>
          Если вы решили обновить программу с <mark className="word">одного года</mark> на
          другой, например с <mark>23.6</mark> на <mark>25.2</mark>, то в таком случае уже
          потребуется ручной перенос плагинов и пресетов в новую версию программы. При
          установке <mark className="word">другого года</mark> - старая версия программы
          останется на вашем устройстве и не будет автоматически удалена.
        </p>
        <AdditionDanger>
          Способ обновления программы, описанный ниже, не гарантирует <mark>100%</mark>{" "}
          стабильность работы новой версии{" "}
          <mark className="app">Adobe After Effects</mark>, поэтому обновляйтесь таким
          способом на свой страх и риск. Если после такого способа обновления вы
          столкнулись с трудностями в работе - переустановите программу начисто,
          предварительно удалив предыдущие версии с помощью{" "}
          <a href="https://helpx.adobe.com/ru/creative-cloud/kb/cc-cleaner-tool-installation-problems.html">
            Adobe Creative Cloud Cleaner
          </a>{" "}
          или любой другой программы по удалению программ, например{" "}
          <mark className="app">Revo Uninstaller</mark>.
        </AdditionDanger>
        <p>
          Прежде чем обновить программу с сохранением установленных плагинов и пресетов -
          вам нужно переименовать папку старой версии программы так, чтобы установщик
          новой версии думал, что новая версия уже установлена на устройстве и предложит
          перезаписать файлы программы. Для нужно открыть директорию с установленными
          программами от <mark>Adobe</mark>, обычно это{" "}
          <mark className="path">C:\Program Files\Adobe</mark>. Затем нужно продублировать
          папку с старой версией программы, убрать приставку <mark>- копия</mark> в
          названии клона папки и изменить номер года на нужный. Например, если вы
          обновляетесь с <mark>23.6</mark> на <mark>25.2</mark>, то вам нужно будет
          переименовать <mark className="path">Adobe After Effects 2023</mark> в{" "}
          <mark className="path">Adobe After Effects 2025</mark>.
        </p>
        <p>
          После переименования откройте установщик новой версии программы и убедитесь в
          том, что установщик увидел продублированную папку и предлагает установить в неё.
          Далее выбираем нужный язык программы, то есть английский и нажимаем на{" "}
          <mark className="ui">Продолжить</mark>. После установки новая версия{" "}
          <mark className="app">Adobe After Effects</mark> предложит вам перенести
          настройки со старой версии программы, с чем мы и соглашаемся.
        </p>
        <AdditionInfo>
          После обновления <mark className="app">Adobe After Effects</mark> не забудьте
          обновить <mark className="app">Adobe Premiere Pro</mark> и{" "}
          <mark className="app">Adobe Media Encoder</mark> для корректной работы связи
          между этими программы. Если у вас были установлены слишком старые версии
          определённых плагинов и они перестали работать в новой версии{" "}
          <mark className="app">Adobe After Effects</mark> - найдите и установите более
          свежие версии нужных плагинов, предварительно удалив старые версии.
        </AdditionInfo>
      </DetailsSummary>
      <DetailsSummary title="Как открыть несколько экземпляров программы и работать в разных проектах?">
        <AdditionDanger>
          Использование нескольких открытых экземпляров{" "}
          <mark className="app">Adobe After Effects</mark> может привести к увеличению
          потребления оперативной памяти и остальных ресурсов вашего устройства.
          Используйте эту опцию с умом!
        </AdditionDanger>
        <p>
          Иногда возникает ситуация, когда вы закончили работу и поставили свой проект на
          рендер, но в это время нужно открыть другой проект и внести в него правки. А
          сделать вы это не можете, потому что программа занята экспортом другой
          композиции. По умолчанию <mark className="app">Adobe After Effects</mark> не
          позволяет открывать больше одного экземпляра, но разработчики оставили
          возможность запуска нескольких инстанций программы.
        </p>
        <ContentSwitcher
          macContent={
            <div>
              <p>
                Чтобы открыть ещё один экземпляр - нужно перейти в директорию{" "}
                <mark className="path">~/Library/Applications/After Effects 20XX</mark>,
                затем нажать <mark className="key">ПКМ</mark> по{" "}
                <mark className="app">Adobe After Effects 20XX</mark> и выбрать{" "}
                <mark className="ui">Показать содержимое пакета</mark>. После открытия
                содержимого перейдите в <mark className="ui">Contents/MacOS</mark> и
                нажмите два раза по файлу <mark className="app">Adobe After Effects</mark>
                . У вас должна открыться консоль и открыться ещё один экземпляр программы.
              </p>
              <YouTubeVideo
                caption="Как открыть несколько инстанций Adobe After Effects"
                link="k1x1goE2F10"
              />
            </div>
          }
          windowsContent={
            <div>
              <p>
                Чтобы убрать данное ограничение - установите ключ{" "}
                <mark className="code">-m</mark> в конец ярлыка с программой. Для этого
                откройте свойства ярлыка с{" "}
                <mark className="app">Adobe After Effects</mark> и переместите курсор до
                конца в поле <mark className="ui">Объект</mark>. Затем напишите{" "}
                <mark className="code">-m</mark> и нажмите на{" "}
                <mark className="ui">Применить</mark> в правом нижем углу окна. После
                этого вы сможете запускать несколько экземпляров{" "}
                <mark className="app">Adobe After Effects</mark> с помощью этого ярлыка и
                работать с программами как обычно.
              </p>
              <VideoFigure
                caption="Включение возможности открытия нескольких экземпляров Adobe After Effects"
                styleClass="figure_windows-dark"
                videoSrc="images/aftereffects/enable_multiple_ae_instances.mp4"
              />
            </div>
          }
        />
      </DetailsSummary>
      <DetailsSummary
        tag="своп, свап, swapfile"
        title="Для чего нужен файл подкачки в Windows и почему его не стоит отключать?"
      >
        <p>
          <mark className="word">Файл подкачки</mark> или же{" "}
          <mark className="file">pagefile.sys</mark> - это специальный файл, который
          служит виртуальным расширением оперативной памяти устройства. Когда системе не
          хватает физической оперативной памяти при выполнении ресурсоёмких задач, она
          начинает использовать файл подкачки для временного хранения данных. По
          умолчанию, если <mark className="file">pagefile.sys</mark> не отключен в вашей
          сборке <mark>Windows</mark>, система автоматически управляет размером файла
          подкачки, однако часто делает это не очень эффективно - поэтому рекомендуем
          настроить его параметры вручную.
        </p>
        <p>
          Нередко можно встретить мнение в интернете, а также от горе-сборщиков
          самодельных образов <mark>Windows</mark>, что файл подкачки лучше отключить, мол
          он вредит вашему жёсткому диску. Отчасти это верно, но при использовании
          приложений от <mark>Adobe</mark> мы{" "}
          <b>
            <u>не рекомендуем</u>
          </b>{" "}
          вам следовать этому вредному совету, так как вы можете заработать себе кучу
          проблем. При отключенном файле подкачки вы можете в{" "}
          <mark className="app">Adobe After Effects</mark> столкнуться с различными
          ошибками, например{" "}
          <mark className="ui">
            After Effects has unexpectedly run out of memory and cannot complete this
            export
          </mark>
          , <mark className="ui">Out of Memory</mark> или{" "}
          <mark className="ui">
            Low memory warning. RAM use has been extended for previews
          </mark>
          . Кроме того, при нехватке оперативной памяти и отсутствии файла подкачки
          возможны вылеты приложений, появление сообщения об ошибке{" "}
          <mark className="ui">В системе недостаточно памяти</mark>, различные подвисания
          системы или даже чёрный экран, который лечится только перезагрузкой устройства.
        </p>
        <p>
          Чтобы настроить размер файла подкачки в <mark>Windows</mark> или включить его -
          следуйте поэтапной инструкции ниже.
        </p>
        <Divider>Инструкция для Windows 10 или 11</Divider>
        <ul>
          <li>
            Откройте окно <mark className="app">Выполнить</mark> с помощью комбинации
            клавиш <mark className="key">Win + R</mark>.
          </li>
          <li>
            Введите в поле <mark className="ui">Открыть</mark> команду{" "}
            <mark className="code">SystemPropertiesAdvanced.exe</mark> и нажмите на{" "}
            <mark className="key">Enter</mark>{" "}
            <b>
              <u>два</u>
            </b>{" "}
            раза. Таким образом вы откроете окно{" "}
            <mark className="ui">Свойства системы</mark> и сразу перейдете в{" "}
            <mark className="ui">Параметры быстродействия</mark>.
          </li>
          <li>
            В окне <mark className="ui">Параметры быстродействия</mark> выберите вкладку{" "}
            <mark className="ui">Дополнительно</mark>.
          </li>
          <li>
            В вкладке <mark className="ui">Дополнительно</mark> нажмите на{" "}
            <mark className="ui">Изменить</mark> в разделе{" "}
            <mark className="ui">Виртуальная память</mark>.
          </li>
          <li>
            Если у вас стоит чекбокс возле параметра{" "}
            <mark className="ui">Автоматически выбирать объем файла подкачки</mark> -
            уберите его.
          </li>
          <li>
            Выберите раздел, на котором у вас стоит система. Если у выбранного раздела
            стоит значение <mark className="ui">Без файла подкачки</mark> или{" "}
            <mark className="ui">Размер по выбору системы</mark> - измените на{" "}
            <mark className="ui">Указать размер</mark>.
            <AdditionInfo>
              Для файла подкачки нужно выбрать раздел с самым производительным диском,
              установленный на вашем устройстве. Установка файла подкачки на раздел с
              медленным диском может ухудшить пользовательский опыт работы с{" "}
              <mark className="app">Adobe After Effects</mark> и <mark>Windows</mark> в
              целом.
            </AdditionInfo>
          </li>
          <li>
            Укажите исходный (минимальный) и максимальный размер файла подкачки. После
            ввода значений - не забудьте нажать на <mark className="ui">Задать</mark> для
            сохранения значений, а затем нажмите на <mark className="ui">ОК</mark> внизу
            окна.
            <AdditionInfo>
              <ul>
                <li>
                  <mark className="word">Минимальный размер файла</mark> - это изначальный
                  размер подкачки, который всегда будет использоваться в вашей системе.{" "}
                  <mark className="word">Максимальный размер файла</mark> - это та
                  граница, до которой <mark>Windows</mark> будет автоматически расширять
                  размер подкачки при необходимости. Если операционная система достигнет
                  этой границы, то файл выше указанного вами размера уже не будет
                  расширяться.
                </li>
                <li>
                  В качестве{" "}
                  <mark className="word">минимального размера файла подкачки</mark> вы
                  можете установить значение от <mark>2048</mark> до любого числа.{" "}
                  <mark>Windows</mark> позволяет поставить и более низкое значение для{" "}
                  <mark className="word">минимального размера файла подкачки</mark>, но не
                  всегда это рекомендуется делать, особенно если у вас медленный
                  накопитель.
                </li>
                <li>
                  В качестве{" "}
                  <mark className="word">максимального размера файла подкачки</mark> для
                  повседневных задач вы можете поставить значение по формуле{" "}
                  <mark>
                    текущий объем оперативной памяти вашего устройства, умноженное на 3
                    или 4
                  </mark>{" "}
                  или сразу установить максимальное значение{" "}
                  <mark className="copy">65536</mark> или{" "}
                  <mark className="copy">131072</mark>.{" "}
                  <b>
                    <u>
                      Убедитесь в том, что вы сможете поддерживать свободное пространство
                      на выбранном разделе для файла подкачки!
                    </u>
                  </b>
                </li>
              </ul>
            </AdditionInfo>
          </li>
          <li>
            <b>
              <u>Перезагрузите</u>
            </b>{" "}
            ваше устройство. Теперь у вас активирован и настроен файл подкачки в
            соответствии с заданными параметрами.
          </li>
        </ul>
      </DetailsSummary>
      <DetailsSummary
        tag="presets, ffx, пресеты"
        title="Как я могу создать свой пресет с своими эффектами на слое и передать другому человеку?"
      >
        <p>
          <mark className="word">Пресеты</mark> - это набор эффектов с заданными
          пользователем настройками, которые можно сохранить, поделиться с другими
          пользователями и применять их в своих проектах.
        </p>
        <p>
          Чтобы создать пресет из нужных эффектов, примените их на какой-нибудь слой, а
          затем выделите применённые эффекты в окне{" "}
          <mark className="ui">Effects Control</mark>. Затем откройте{" "}
          <mark className="ui">Effects & Presets</mark> рядом с окном{" "}
          <mark className="ui">Effects Control</mark> и в его заголовке окна нажмите на
          три полоски. В контекстном меню выберите{" "}
          <mark className="ui">Save Animation Preset</mark> и в новом окне укажите нужный
          путь и название для сохранения пресета.
        </p>
        <VideoFigure
          caption="Создание пресета"
          styleClass="figure_windows-dark"
          videoSrc="images/aftereffects/save_animation_preset.mp4"
        />
        <p>
          Теперь, когда у вас есть сохранённый пресет, им можно поделиться с другими
          пользователями. Получатель может спокойно установить пресеты, следуя{" "}
          <a href="#2.1">инструкции по установке</a>, а затем применять их в программе из
          папки <mark className="path">Animation Presets</mark> из окна{" "}
          <mark className="ui">Effects & Presets</mark> или с помощью{" "}
          <mark className="plugin">FX Console</mark>.
        </p>
        <AdditionWarning>
          Прежде чем делиться какими-либо пресетами - уточните для получателя, для какой
          версии <mark className="app">Adobe After Effects</mark> они предназначены, для
          какого разрешения проекта или соотношения сторон и, при необходимости, укажите,
          какие сторонние плагины и их версии должны быть установлены для корректной
          работы ваших пресетов.
        </AdditionWarning>
      </DetailsSummary>
    </div>
  );
};
export default AETips;
